Fagear/SDVPCMdecoder/stc007datastitcher.cpp
#include "stc007datastitcher.h"

STC007DataStitcher::STC007DataStitcher(QObject *parent) : QObject(parent)
{
    // Reset pointers to input/output queues.
    in_lines = NULL;
    out_samples = NULL;
    mtx_lines = NULL;
    mtx_samples = NULL;

    // Set internal frame and field buffer sizes.
    trim_buf.resize(BUF_SIZE_TRIM);
    frame1_even.resize(BUF_SIZE_FIELD);
    frame1_odd.resize(BUF_SIZE_FIELD);
    frame2_even.resize(BUF_SIZE_FIELD);
    frame2_odd.resize(BUF_SIZE_FIELD);

    file_name.clear();

    preset_video_mode = FrameAsmDescriptor::VID_UNKNOWN;
    preset_field_order = FrameAsmDescriptor::ORDER_UNK;
    preset_audio_res = SAMPLE_RES_UNKNOWN;
    preset_sample_rate = PCMSamplePair::SAMPLE_RATE_AUTO;

    log_level = 0;
    trim_fill = 0;
    file_start = file_end = false;
    enable_P_code = false;
    enable_Q_code = false;
    enable_CWD = true;
    mode_m2 = false;
    finish_work = false;

    // Reset internal state.
    resetState();
    // Preset default fine parameters.
    setDefaultFineSettings();
}

//------------------------ Set pointers to shared input data.
void STC007DataStitcher::setInputPointers(std::deque<STC007Line> *in_pcmline, QMutex *mtx_pcmline)
{
    if((in_pcmline==NULL)||(mtx_pcmline==NULL))
    {
        qWarning()<<DBG_ANCHOR<<"[L2B-007] Empty input pointer provided, unable to apply!";
    }
    else
    {
        in_lines = in_pcmline;
        mtx_lines = mtx_pcmline;
    }
}

//------------------------ Set pointers to shared output data.
void STC007DataStitcher::setOutputPointers(std::deque<PCMSamplePair> *out_pcmsamples, QMutex *mtx_pcmsamples)
{
    if((out_pcmsamples==NULL)||(mtx_pcmsamples==NULL))
    {
        qWarning()<<DBG_ANCHOR<<"[L2B-007] Empty output pointer provided, unable to apply!";
    }
    else
    {
        out_samples = out_pcmsamples;
        mtx_samples = mtx_pcmsamples;
    }
}

//------------------------ Reset all stats from the last file, start from scratch.
void STC007DataStitcher::resetState()
{
    // Clear good field order history.
    clearFieldOrderStats();
    // Clear detected audio resolution history.
    clearResolutionStats();
    // Clear queue.
    conv_queue.clear();
    // Set default assembling parameters.
    last_pad_counter = 0xFF;
    broken_countdown = 0;
    frasm_f0.clear();
    frasm_f1.clearMisc();
    frasm_f2.clearMisc();
#ifdef DI_EN_DBG_OUT
    //if((log_level&LOG_PROCESS)!=0)
    {
        qInfo()<<"[L2B-007] Internal state is reset";
    }
#endif
}

//------------------------ Wait until two full frames are in the input queue.
bool STC007DataStitcher::waitForTwoFrames()
{
    bool frame1_lock, frame2_lock, two_frame_lock;
    std::deque<STC007Line>::iterator buf_scaner;

    frasm_f1.clear();
    frasm_f2.clear();
    frame1_lock = frame2_lock = two_frame_lock = false;

#ifdef DI_LOG_BUF_WAIT_VERBOSE
    if((log_level&LOG_PROCESS)!=0)
    {
        qInfo()<<"[L2B-007] Searching for two full frames in the input buffer within"<<in_lines->size()<<"lines...";
    }
#endif

    // Pick start of the queue.
    buf_scaner = in_lines->begin();

    // Fill up buffer until there is nothing in the input.
    while(buf_scaner!=in_lines->end())
    {
#ifdef DI_LOG_BUF_WAIT_VERBOSE
        if((log_level&LOG_PROCESS)!=0)
        {
            qInfo()<<"[L2B-007] Current line:"<<(*buf_scaner).frame_number<<"|"<<(*buf_scaner).line_number;
        }
#endif
        // Still at the first frame in the buffer.
        if(frame1_lock==false)
        {
            // End of the first frame is not detected yet.
            // Check if there is service tag for the end of the frame.
            if((*buf_scaner).isServEndFrame()!=false)
            {
                // Got to the end of the first frame: one full frame is in the buffer.
                frame1_lock = true;
                // Set frame number for the second frame in the buffer.
                frasm_f1.frame_number = (*buf_scaner).frame_number;
#ifdef DI_LOG_BUF_WAIT_VERBOSE
                if((log_level&LOG_PROCESS)!=0)
                {
                    qInfo()<<"[L2B-007] Detected end of the Frame A";
                }
#endif
            }
        }
        else if(frame2_lock==false)
        {
            // Second frame is not locked yet.
            // Check if there is a service tag for the end of the frame.
            if((*buf_scaner).isServEndFrame()!=false)
            {
                // Mark second frame as detected.
                frame2_lock = true;
                // Set frame number for the second frame in the buffer.
                frasm_f2.frame_number = (*buf_scaner).frame_number;
#ifdef DI_LOG_BUF_WAIT_VERBOSE
                if((log_level&LOG_PROCESS)!=0)
                {
                    qInfo()<<"[L2B-007] Detected end of the Frame B";
                }
#endif
            }
        }

        if((frame1_lock!=false)&&(frame2_lock!=false))
        {
            // Two full frames found in the buffer.
            two_frame_lock = true;
#ifdef DI_LOG_BUF_WAIT_VERBOSE
            if((log_level&LOG_PROCESS)!=0)
            {
                qInfo()<<"[L2B-007] Two finished frames in the buffer, exiting search...";
            }
#endif
            break;
        }
        // Check for the End Of File.
        if((*buf_scaner).isServEndFile()!=false)
        {
#ifdef DI_LOG_BUF_WAIT_VERBOSE
            if((log_level&LOG_PROCESS)!=0)
            {
                qInfo()<<"[L2B-007] EOF detected";
            }
#endif
            //break;
        }
        // Go to the next line in the input.
        buf_scaner++;
    };

    return two_frame_lock;
}

//------------------------ Fill internal buffer up to two frames from input queue.
void STC007DataStitcher::fillUntilTwoFrames()
{
    std::deque<STC007Line>::iterator buf_scaner;
    uint8_t frames_cnt;

    // Reset internal buffer fill counter.
    trim_fill = 0;
    frames_cnt = 0;

#ifdef DI_EN_DBG_OUT
    if((log_level&LOG_PROCESS)!=0)
    {
        qInfo()<<"[L2B-007] Copying up to two full frames from the input queue...";
    }
#endif
    buf_scaner = in_lines->begin();

    // Fill up buffer until there is nothing in the input.
    while(buf_scaner!=in_lines->end())
    {
        // Check if there is a service tag for the end of the frame.
        if((*buf_scaner).isServEndFrame()!=false)
        {
            // Increase number of finished frames.
            frames_cnt++;
#ifdef DI_LOG_BUF_FILL_VERBOSE
            if((log_level&LOG_PROCESS)!=0)
            {
                QString log_line;
                log_line.sprintf("[L2B-007] Frame end at line %u-%u, fill index: %u", (*buf_scaner).frame_number, (*buf_scaner).line_number, trim_fill);
                qInfo()<<log_line;
            }
#endif
            if(frames_cnt>=2)
            {
                // Two frames are enough.
                break;
            }
        }
        // Check for internal buffer overflow.
        else if(trim_fill<BUF_SIZE_TRIM)
        {
            // Copy data into internal buffer.
            trim_buf[trim_fill] = (*buf_scaner);
#ifdef DI_LOG_BUF_FILL_VERBOSE
            if((log_level&LOG_PROCESS)!=0)
            {
                QString log_line;
                log_line.sprintf("[L2B-007] Added line %u-%u (%u) into buffer at index: %u",
                                 (*buf_scaner).frame_number,
                                 (*buf_scaner).line_number,
                                 (*buf_scaner).isServiceLine(),
                                 trim_fill);
                qInfo()<<log_line;
            }
#endif
            // Increase number of filled lines.
            trim_fill++;
        }
        else
        {
            qWarning()<<DBG_ANCHOR<<"[L2B-007] Line buffer index out of bound! Logic error! Line skipped!";
            qWarning()<<DBG_ANCHOR<<"[L2B-007] Max lines:"<<BUF_SIZE_TRIM;
        }
        // Go to the next line in the input.
        buf_scaner++;
    }
}

