Fagear/SDVPCMdecoder/stc007datastitcher.cpp
//------------------------ Detect frame trimming (how many lines to skip from top and bottom of each field).
void STC007DataStitcher::findFramesTrim()
{
    uint16_t line_ind, f1o_good, f1e_good, f2o_good, f2e_good;
    bool f1e_top, f1e_bottom, f1o_top, f1o_bottom;
    bool f2e_top, f2e_bottom, f2o_top, f2o_bottom;
    bool f1o_skip_bad, f1e_skip_bad, f2o_skip_bad, f2e_skip_bad;

    f1e_top = f1e_bottom = f1o_top = f1o_bottom = false;
    f2e_top = f2e_bottom = f2o_top = f2o_bottom = false;
    f1o_skip_bad = f1e_skip_bad = f2o_skip_bad = f2e_skip_bad = false;
    f1o_good = f1e_good = f2o_good = f2e_good = 0;

#ifdef DI_EN_DBG_OUT
    if(((log_level&LOG_TRIM)!=0)||((log_level&LOG_PROCESS)!=0))
    {
        qInfo()<<"[L2B-007] -------------------- Trim search starting...";
    }
#endif

    // Check if frame A data was moved from frame B.
    if(frasm_f1.trim_ok!=false)
    {
        // Don't need to adjust trimming.
        f1e_top = f1o_top = f1e_bottom = f1o_bottom = true;
#ifdef DI_LOG_TRIM_VERBOSE
        if(((log_level&LOG_TRIM)!=0)&&((log_level&LOG_PROCESS)!=0))
        {
            qInfo()<<"[L2B-007] Frame A trim does not require adjustments.";
        }
#endif
    }
    else
    {
        // Preset default trim.
        frasm_f1.even_top_data = frasm_f1.even_bottom_data = frasm_f1.odd_top_data = frasm_f1.odd_bottom_data = 0;
    }
    // Check if both frames are already processed.
    if(frasm_f2.trim_ok!=false)
    {
        // Don't need to adjust trimming.
        f2e_top = f2o_top = f2e_bottom = f2o_bottom = true;
#ifdef DI_LOG_TRIM_VERBOSE
        if(((log_level&LOG_TRIM)!=0)&&((log_level&LOG_PROCESS)!=0))
        {
            qInfo()<<"[L2B-007] Frame B trim does not require adjustments.";
        }
#endif
    }
    else
    {
        // Preset default trim.
        frasm_f2.even_top_data = frasm_f2.even_bottom_data = frasm_f2.odd_top_data = frasm_f2.odd_bottom_data = 0;
    }

    // Pre-scan buffer to count up number of good lines.
    line_ind = 0;
    while(line_ind<trim_fill)
    {
        if(trim_buf[line_ind].frame_number==frasm_f1.frame_number)
        {
            // Frame A number is ok.
            if(trim_buf[line_ind].isServiceLine()==false)
            {
                // Current line is not a service one.
                if(trim_buf[line_ind].isCRCValid()!=false)
                {
                    // Binarization gave good result.
                    if((trim_buf[line_ind].line_number%2)==0)
                    {
                        // Line from even field.
                        f1e_good++;
                        if(f1e_good>MIN_GOOD_LINES_PF)
                        {
                            f1e_skip_bad = true;
                        }
                    }
                    else
                    {
                        // Line from odd field.
                        f1o_good++;
                        if(f1o_good>MIN_GOOD_LINES_PF)
                        {
                            f1o_skip_bad = true;
                        }
                    }
                }
            }
            else if(trim_buf[line_ind].isServNewFile()!=false)
            {
                // Line contains Service line with "New file" tag.
                file_start = true;
                file_name = trim_buf[line_ind].file_path;
            }
            else if(trim_buf[line_ind].isServEndFile()!=false)
            {
                // Line contains Service line with "File end" tag.
                file_end = true;
            }
            else if(trim_buf[line_ind].isServCtrlBlk()!=false)
            {
                // Line contains Service line with STC-007 Control Block data.
                // Check if this line is at the top of the field
                // and not somewhere in the middle due to broken frame sync.
                if((f1e_good==0)&&(f1o_good==0))
                {
                    // Copy addresss data into frame descriptor.
                    frasm_f1.ctrl_index = trim_buf[line_ind].getCtrlIndex();
                    frasm_f1.ctrl_hour = trim_buf[line_ind].getCtrlHour();
                    frasm_f1.ctrl_minute = trim_buf[line_ind].getCtrlMinute();
                    frasm_f1.ctrl_second = trim_buf[line_ind].getCtrlSecond();
                    frasm_f1.ctrl_field = trim_buf[line_ind].getCtrlField();
                }
            }
        }
        else if(trim_buf[line_ind].frame_number==frasm_f2.frame_number)
        {
            // Frame B number is ok.
            if(trim_buf[line_ind].isServiceLine()==false)
            {
                // Current line is not a service one.
                if(trim_buf[line_ind].isCRCValid()!=false)
                {
                    // Binarization gave good result.
                    if((trim_buf[line_ind].line_number%2)==0)
                    {
                        // Line from even field.
                        f2e_good++;
                        if(f2e_good>MIN_GOOD_LINES_PF)
                        {
                            f2e_skip_bad = true;
                        }
                    }
                    else
                    {
                        // Line from odd field.
                        f2o_good++;
                        if(f2o_good>MIN_GOOD_LINES_PF)
                        {
                            f2o_skip_bad = true;
                        }
                    }
                }
            }
            else if(trim_buf[line_ind].isServEndFile()!=false)
            {
                // Line contains Service line with "File end" tag.
                file_end = true;
            }
            else if(trim_buf[line_ind].isServCtrlBlk()!=false)
            {
                // Line contains Service line with STC-007 Control Block data.
                // Check if this line is at the top of the field
                // and not somewhere in the middle due to broken frame sync.
                if((f2e_good==0)&&(f2o_good==0))
                {
                    // Copy addresss data into frame descriptor.
                    frasm_f2.ctrl_index = trim_buf[line_ind].getCtrlIndex();
                    frasm_f2.ctrl_hour = trim_buf[line_ind].getCtrlHour();
                    frasm_f2.ctrl_minute = trim_buf[line_ind].getCtrlMinute();
                    frasm_f2.ctrl_second = trim_buf[line_ind].getCtrlSecond();
                    frasm_f2.ctrl_field = trim_buf[line_ind].getCtrlField();
                }
            }
        }
        // Go to next line.
        line_ind++;
    }

#ifdef DI_EN_DBG_OUT
    if(((log_level&LOG_TRIM)!=0)||((log_level&LOG_PROCESS)!=0))
    {
        if(file_start!=false)
        {
            qInfo()<<"[L2B-007] New file tag detected in the frame";
        }
        if(file_end!=false)
        {
            qInfo()<<"[L2B-007] File end tag detected in the frame";
        }
        if(f1o_skip_bad!=false)
        {
            qInfo()<<"[L2B-007]"<<f1o_good<<"lines with good CRC in Frame A odd field, aggresive trimming enabled for Frame A odd field";
        }
        if(f1e_skip_bad!=false)
        {
            qInfo()<<"[L2B-007]"<<f1e_good<<"lines with good CRC in Frame A even field, aggresive trimming enabled for Frame A even field";
        }
        if(f2o_skip_bad!=false)
        {
            qInfo()<<"[L2B-007]"<<f2o_good<<"lines with good CRC in Frame B odd field, aggresive trimming enabled for Frame B odd field";
        }
        if(f2e_skip_bad!=false)
        {
            qInfo()<<"[L2B-007]"<<f2e_good<<"lines with good CRC in Frame B even field, aggresive trimming enabled for Frame B even field";
        }
    }
#endif
    if(file_end!=false)
    {
        qInfo()<<"[L2B-007] File end tag detected in the frame";
    }

    // Cycle through the whole buffer.
    // (assuming that buffer starts on the first line of the frame)
    line_ind = 0;
    while(line_ind<trim_fill)
    {
        if((frasm_f1.trim_ok!=false)&&(frasm_f2.trim_ok!=false))
        {
#ifdef DI_EN_DBG_OUT
            if(((log_level&LOG_TRIM)!=0)&&((log_level&LOG_PROCESS)!=0))
            {
                qInfo()<<"[L2B-007] Both frames are already trimmed, aborting search.";
            }
#endif
            break;
        }

        // Check for service lines in the input.
        if((trim_buf[line_ind].isServiceLine()!=false)&&(trim_buf[line_ind].isServFiller()==false))
        {
#ifdef DI_LOG_TRIM_VERBOSE
            if(((log_level&LOG_TRIM)!=0)&&((log_level&LOG_PROCESS)!=0))
            {
                qInfo()<<"[L2B-007] Skipping service line at"<<trim_buf[line_ind].frame_number<<"/"<<trim_buf[line_ind].line_number;
            }
#endif
            // Go to next line.
            line_ind++;
            // Skip service lines.
            continue;
        }

#ifdef DI_LOG_TRIM_VERBOSE
        if(((log_level&LOG_TRIM)!=0)&&((log_level&LOG_PROCESS)!=0))
        {
            QString log_line;
            log_line.sprintf("[L2B-007] Check: at %04u, line: %03u/%03u, PCM: ",
                             line_ind,
                             trim_buf[line_ind].frame_number,
                             trim_buf[line_ind].line_number);
            if(trim_buf[line_ind].isCRCValidIgnoreForced()==false)
            {
                log_line += "no ";
            }
            else
            {
                log_line += "yes";
            }
            qInfo()<<log_line;
        }
#endif

        // Check frame numbers (that are set in [waitForTwoFrames()]).
        if((trim_buf[line_ind].frame_number==frasm_f1.frame_number)&&(frasm_f1.trim_ok==false))
        {
            // Frame A number is ok.
            // Check field.
            if((trim_buf[line_ind].line_number%2)==0)
            {
                // Line from even field.
                if(((f1e_skip_bad==false)&&(trim_buf[line_ind].hasMarkers()!=false))||
                   ((f1e_skip_bad==false)&&(trim_buf[line_ind].isCRCValidIgnoreForced()!=false))||
                   ((f1e_skip_bad!=false)&&(trim_buf[line_ind].isCRCValidIgnoreForced()!=false)))
                {
                    // PCM detected in the line.
                    if(f1e_top==false)
                    {
                        // Set number of the line that PCM is starting.
                        frasm_f1.even_top_data = trim_buf[line_ind].line_number;
                        // Detect only first encounter in the buffer.
                        f1e_top = true;
#ifdef DI_EN_DBG_OUT
                        if(((log_level&LOG_TRIM)!=0)&&((log_level&LOG_PROCESS)!=0))
                        {
                            qInfo()<<"[L2B-007] Frame A even field new top trim:"<<frasm_f1.even_top_data;
                        }
#endif
                    }
                    // Update last line with PCM from the bottom.
                    frasm_f1.even_bottom_data = trim_buf[line_ind].line_number;
                    f1e_bottom = true;
                }
            }
            else
            {
                // Line from odd field.
                if(((f1o_skip_bad==false)&&(trim_buf[line_ind].hasMarkers()!=false))||
                   ((f1o_skip_bad==false)&&(trim_buf[line_ind].isCRCValidIgnoreForced()!=false))||
                   ((f1o_skip_bad!=false)&&(trim_buf[line_ind].isCRCValidIgnoreForced()!=false)))
                {
                    // PCM detected in the line.
                    if(f1o_top==false)
                    {
                        // Set number of the line that PCM is starting.
                        frasm_f1.odd_top_data = trim_buf[line_ind].line_number;
                        // Detect only first encounter in the buffer.
                        f1o_top = true;
#ifdef DI_EN_DBG_OUT
                        if(((log_level&LOG_TRIM)!=0)&&((log_level&LOG_PROCESS)!=0))
                        {
                            qInfo()<<"[L2B-007] Frame A odd field new top trim:"<<frasm_f1.odd_top_data;
                        }
#endif
                    }
                    // Update last line with PCM from the bottom.
                    frasm_f1.odd_bottom_data = trim_buf[line_ind].line_number;
                    f1o_bottom = true;
                }
            }
        }
        else if((trim_buf[line_ind].frame_number==frasm_f2.frame_number)&&(frasm_f2.trim_ok==false))
        {
            // Frame B number is ok.
            // Check field.
            if((trim_buf[line_ind].line_number%2)==0)
            {
                // Line from even field.
                if(((f2e_skip_bad==false)&&(trim_buf[line_ind].hasMarkers()!=false))||
                   ((f2e_skip_bad==false)&&(trim_buf[line_ind].isCRCValidIgnoreForced()!=false))||
                   ((f2e_skip_bad!=false)&&(trim_buf[line_ind].isCRCValidIgnoreForced()!=false)))
                {
                    // PCM detected in the line.
                    if(f2e_top==false)
                    {
                        // Set number of the line that PCM is starting.
                        frasm_f2.even_top_data = trim_buf[line_ind].line_number;
                        // Detect only first encounter in the buffer.
                        f2e_top = true;
#ifdef DI_EN_DBG_OUT
                        if(((log_level&LOG_TRIM)!=0)&&((log_level&LOG_PROCESS)!=0))
                        {
                            qInfo()<<"[L2B-007] Frame B even field new top trim:"<<frasm_f2.even_top_data;
                        }
#endif
                    }
                    // Update last line with PCM from the bottom.
                    frasm_f2.even_bottom_data = trim_buf[line_ind].line_number;
                    f2e_bottom = true;
                }
            }
            else
            {
                // Line from odd field.
                if(((f2o_skip_bad==false)&&(trim_buf[line_ind].hasMarkers()!=false))||
                   ((f2o_skip_bad==false)&&(trim_buf[line_ind].isCRCValidIgnoreForced()!=false))||
                   ((f2o_skip_bad!=false)&&(trim_buf[line_ind].isCRCValidIgnoreForced()!=false)))
                {
                    // PCM detected in the line.
                    if(f2o_top==false)
                    {
                        // Set number of the line that PCM is starting.
                        frasm_f2.odd_top_data = trim_buf[line_ind].line_number;
                        // Detect only first encounter in the buffer.
                        f2o_top = true;
#ifdef DI_EN_DBG_OUT
                        if(((log_level&LOG_TRIM)!=0)&&((log_level&LOG_PROCESS)!=0))
                        {
                            qInfo()<<"[L2B-007] Frame B odd field new top trim:"<<frasm_f2.odd_top_data;
                        }
#endif
                    }
                    // Update last line with PCM from the bottom.
                    frasm_f2.odd_bottom_data = trim_buf[line_ind].line_number;
                    f2o_bottom = true;
                }
            }
        }

        // Go to next line.
        line_ind++;
    }
    // Check if trim is done for each frame.
    if((f1e_top!=false)&&(f1o_top!=false)&&(f1e_bottom!=false)&&(f1o_bottom!=false))
    {
        if(frasm_f1.trim_ok==false)
        {
            frasm_f1.trim_ok = true;
#ifdef DI_LOG_TRIM_VERBOSE
            if((log_level&LOG_PROCESS)!=0)
            {
                qInfo()<<"[L2B-007] Frame A trim is complete";
            }
#endif
        }
    }
    if((f2e_top!=false)&&(f2o_top!=false)&&(f2e_bottom!=false)&&(f2o_bottom!=false))
    {
        if(frasm_f2.trim_ok==false)
        {
            frasm_f2.trim_ok = true;
#ifdef DI_LOG_TRIM_VERBOSE
            if((log_level&LOG_PROCESS)!=0)
            {
                qInfo()<<"[L2B-007] Frame B trim is complete";
            }
#endif
        }
    }

#ifdef DI_EN_DBG_OUT
    if(((log_level&LOG_TRIM)!=0)||((log_level&LOG_PROCESS)!=0))
    {
        QString log_line;
        log_line = "[L2B-007] Frame A ("+QString::number(frasm_f1.frame_number)+") trim (OT, OB, ET, EB): ";
        if(f1o_top==false)
        {
            log_line += "UNK, ";
        }
        else
        {
            log_line += QString::number(frasm_f1.odd_top_data)+", ";
        }
        if(f1o_bottom==false)
        {
            log_line += "UNK, ";
        }
        else
        {
            log_line += QString::number(frasm_f1.odd_bottom_data)+", ";
        }
        if(f1e_top==false)
        {
            log_line += "UNK, ";
        }
        else
        {
            log_line += QString::number(frasm_f1.even_top_data)+", ";
        }
        if(f1e_bottom==false)
        {
            log_line += "UNK";
        }
        else
        {
            log_line += QString::number(frasm_f1.even_bottom_data);
        }
        qInfo()<<log_line;
        log_line.clear();
        log_line = "[L2B-007] Frame B ("+QString::number(frasm_f2.frame_number)+") trim (OT, OB, ET, EB): ";
        if(f2o_top==false)
        {
            log_line += "UNK, ";
        }
        else
        {
            log_line += QString::number(frasm_f2.odd_top_data)+", ";
        }
        if(f2o_bottom==false)
        {
            log_line += "UNK, ";
        }
        else
        {
            log_line += QString::number(frasm_f2.odd_bottom_data)+", ";
        }
        if(f2e_top==false)
        {
            log_line += "UNK, ";
        }
        else
        {
            log_line += QString::number(frasm_f2.even_top_data)+", ";
        }
        if(f2e_bottom==false)
        {
            log_line += "UNK";
        }
        else
        {
            log_line += QString::number(frasm_f2.even_bottom_data);
        }
        qInfo()<<log_line;
    }
#endif
}

//------------------------ Split 2 frames (current [Frame A] and the next one [Frame B]) into 4 internal buffers per field.
void STC007DataStitcher::splitFramesToFields()
{
    uint16_t line_ind, line_num;
    uint32_t ref_lvl_odd, ref_lvl_even, ref_lvl_odd_bad, ref_lvl_even_bad;

#ifdef DI_EN_DBG_OUT
    if(((log_level&LOG_TRIM)!=0)||((log_level&LOG_PROCESS)!=0))
    {
        qInfo()<<"[L2B-007] -------------------- Splitting frames into field buffers...";
        qInfo()<<"[L2B-007]"<<trim_fill<<"total lines in the buffer";
    }
#endif

