Fagear/SDVPCMdecoder/stc007datastitcher.cpp
    line_ind = 0;
    ref_lvl_odd = ref_lvl_even = ref_lvl_odd_bad = ref_lvl_even_bad = 0;
    f1_max_line = f2_max_line = 0;
    frasm_f1.odd_data_lines = frasm_f1.even_data_lines = frasm_f2.odd_data_lines = frasm_f2.even_data_lines = 0;
    frasm_f1.odd_valid_lines = frasm_f1.even_valid_lines = frasm_f2.odd_valid_lines = frasm_f2.even_valid_lines = 0;
    // Reset assembly stats.
    frasm_f1.clearAsmStats();

    // Cycle splitting 2-frame buffer into 4 field buffers.
    while(line_ind<trim_fill)
    {
        // Save current line number.
        line_num = trim_buf[line_ind].line_number;
        // Check for stray service line.
        if(trim_buf[line_ind].isServiceLine()!=false)
        {
            if(trim_buf[line_ind].isServFiller()==false)
            {
                /*if(trim_buf[line_ind].isServCtrlBlk()!=false)
                {
                    qDebug()<<"[L2B-007] Stray Control Block"<<trim_buf[line_ind].frame_number<<trim_buf[line_ind].line_number;
                }*/
                // Skip stray unfiltered or lost sync service line.
                line_ind++;
                continue;
            }
        }
        // Pick lines for frame A.
        if(trim_buf[line_ind].frame_number==frasm_f1.frame_number)
        {
            // Update maximum line number for Frame A.
            if(f1_max_line<line_num)
            {
                f1_max_line = line_num;
            }
            // Fill up frame A, splitting fields.
            if((line_num%2)==0)
            {
                // Check if lines are available after trimming (not top = bottom = current = 0).
                if((frasm_f1.even_top_data!=frasm_f1.even_bottom_data)||(frasm_f1.even_top_data!=0))
                {
                    // Check frame trimming.
                    if((line_num>=frasm_f1.even_top_data)&&(line_num<=frasm_f1.even_bottom_data))
                    {
                        // Check array index bounds.
                        if(frasm_f1.even_data_lines<BUF_SIZE_FIELD)
                        {
                            // Fill up even field.
                            frame1_even[frasm_f1.even_data_lines] = trim_buf[line_ind];
                            frasm_f1.even_data_lines++;
                            // Pre-calculate average reference level for all lines.
                            ref_lvl_even_bad += trim_buf[line_ind].ref_level;
                            if(trim_buf[line_ind].isCRCValid()!=false)
                            {
                                // Calculate number of lines with valid CRC in the field.
                                frasm_f1.even_valid_lines++;
                                // Pre-calculate average reference level for valid lines.
                                ref_lvl_even += trim_buf[line_ind].ref_level;
                            }
                        }
#ifdef DI_LOG_NOLINE_SKIP_VERBOSE
                        else
                        {
                            qInfo()<<"[L2B-007] Frame A even field index out of bound! Line skipped!"<<line_num;
                        }
#endif
                    }
                }
#ifdef DI_LOG_NOLINE_SKIP_VERBOSE
                else
                {
                    if(((log_level&LOG_PADDING)!=0)&&((log_level&LOG_PROCESS)!=0))
                    {
                        qInfo()<<"[L2B-007] Frame A no line even field skip";
                    }
                }
#endif
            }
            else
            {
                // Check frame trimming.
                if((line_num>=frasm_f1.odd_top_data)&&(line_num<=frasm_f1.odd_bottom_data))
                {
                    // Check array index bounds.
                    if(frasm_f1.odd_data_lines<BUF_SIZE_FIELD)
                    {
                        // Fill up odd field.
                        frame1_odd[frasm_f1.odd_data_lines] = trim_buf[line_ind];
                        frasm_f1.odd_data_lines++;
                        // Pre-calculate average reference level for all lines.
                        ref_lvl_odd_bad += trim_buf[line_ind].ref_level;
                        if(trim_buf[line_ind].isCRCValid()!=false)
                        {
                            // Calculate number of lines with valid CRC in the field.
                            frasm_f1.odd_valid_lines++;
                            // Pre-calculate average reference level for valid lines.
                            ref_lvl_odd += trim_buf[line_ind].ref_level;
                        }
                    }
#ifdef DI_LOG_NOLINE_SKIP_VERBOSE
                    else
                    {
                        qInfo()<<"[L2B-007] Frame A odd field index out of bound! Line skipped!"<<line_num;
                    }
#endif
                }
            }
        }
        // Pick lines for frame B.
        else if(trim_buf[line_ind].frame_number==frasm_f2.frame_number)
        {
            // Update maximum line number for Frame B.
            if(f2_max_line<line_num)
            {
                f2_max_line = line_num;
            }
            // Fill up frame B, splitting fields.
            if((line_num%2)==0)
            {
                // Check if lines are available after trimming (not top = bottom = current = 0).
                if((frasm_f2.even_top_data!=frasm_f2.even_bottom_data)||(frasm_f2.even_top_data!=0))
                {
                    // Check frame trimming.
                    if((line_num>=frasm_f2.even_top_data)&&(line_num<=frasm_f2.even_bottom_data))
                    {
                        // Check array index bounds.
                        if(frasm_f2.even_data_lines<BUF_SIZE_FIELD)
                        {
                            // Fill up even field.
                            frame2_even[frasm_f2.even_data_lines] = trim_buf[line_ind];
                            frasm_f2.even_data_lines++;
                            if(trim_buf[line_ind].isCRCValid()!=false)
                            {
                                // Calculate number of lines with valid CRC in the field.
                                frasm_f2.even_valid_lines++;
                            }
                        }
#ifdef DI_LOG_NOLINE_SKIP_VERBOSE
                        else
                        {
                            qInfo()<<"[L2B-007] Frame B even field index out of bound! Line skipped!"<<line_num;
                        }
#endif
                    }
                }
#ifdef DI_LOG_NOLINE_SKIP_VERBOSE
                else
                {
                    if(((log_level&LOG_PADDING)!=0)&&((log_level&LOG_PROCESS)!=0))
                    {
                        qInfo()<<"[L2B-007] Frame B no line even field skip";
                    }
                }
#endif
            }
            else
            {
                // Check frame trimming.
                if((line_num>=frasm_f2.odd_top_data)&&(line_num<=frasm_f2.odd_bottom_data))
                {
                    // Check array index bounds.
                    if(frasm_f2.odd_data_lines<BUF_SIZE_FIELD)
                    {
                        // Fill up odd field.
                        frame2_odd[frasm_f2.odd_data_lines] = trim_buf[line_ind];
                        frasm_f2.odd_data_lines++;
                        if(trim_buf[line_ind].isCRCValid()!=false)
                        {
                            // Calculate number of lines with valid CRC in the field.
                            frasm_f2.odd_valid_lines++;
                        }
                    }
#ifdef DI_LOG_NOLINE_SKIP_VERBOSE
                    else
                    {
                        qInfo()<<"[L2B-007] Frame B odd field index out of bound! Line skipped!"<<line_num;
                    }
#endif
                }
            }
        }
        // Continue search through the buffer.
        line_ind++;
    }

    // Calculate average reference level for odd field.
    if(frasm_f1.odd_valid_lines>0)
    {
        // There was valid data, calculate reference only by valid lines.
        ref_lvl_odd = ref_lvl_odd/frasm_f1.odd_valid_lines;
        frasm_f1.odd_ref = (uint8_t)ref_lvl_odd;
    }
    else if(frasm_f1.odd_data_lines>0)
    {
        // There was no valid data, calculate reference by all lines with something in those.
        ref_lvl_odd_bad = ref_lvl_odd_bad/frasm_f1.odd_data_lines;
        frasm_f1.odd_ref = (uint8_t)ref_lvl_odd_bad;
    }
    else
    {
        frasm_f1.odd_ref = 0;
    }
    // Calculate average reference level for even field.
    if(frasm_f1.even_valid_lines>0)
    {
        // There was valid data, calculate reference only by valid lines.
        ref_lvl_even = ref_lvl_even/frasm_f1.even_valid_lines;
        frasm_f1.even_ref = (uint8_t)ref_lvl_even;
    }
    else if(frasm_f1.even_data_lines>0)
    {
        ref_lvl_even_bad = ref_lvl_even_bad/frasm_f1.even_data_lines;
        frasm_f1.even_ref = (uint8_t)ref_lvl_even_bad;
    }
    else
    {
        frasm_f1.even_ref = 0;
    }

#ifdef DI_EN_DBG_OUT
    if(((log_level&LOG_PADDING)!=0)||((log_level&LOG_PROCESS)!=0))
    {
        QString log_line;
        log_line.sprintf("[L2B-007] %03u lines (%03u valid) in Frame A odd field buffer", frasm_f1.odd_data_lines, frasm_f1.odd_valid_lines);
        qInfo()<<log_line;
        log_line.sprintf("[L2B-007] %03u lines (%03u valid) in Frame A even field buffer", frasm_f1.even_data_lines, frasm_f1.even_valid_lines);
        qInfo()<<log_line;
        log_line.sprintf("[L2B-007] %03u lines (%03u valid) in Frame B odd field buffer", frasm_f2.odd_data_lines, frasm_f2.odd_valid_lines);
        qInfo()<<log_line;
        log_line.sprintf("[L2B-007] %03u lines (%03u valid) in Frame B even field buffer", frasm_f2.even_data_lines, frasm_f2.even_valid_lines);
        qInfo()<<log_line;
        log_line.sprintf("[L2B-007] Frame A average reference level: %03u/%03u (odd/even)", frasm_f1.odd_ref, frasm_f1.even_ref);
        qInfo()<<log_line;
    }
#endif
}

//------------------------ Try to detect audio resolution from data in the field.
//------------------------ If audio resolution is preset from outside - return that and skip detection.
// Input:
//  [*field] pointer to std::vector of lines from a field
//  [f_size] number of lines in that field (start offset always 0)
// Returns:
//  [SAMPLE_RES_16BIT] if field data seems to contain 16-bit audio
//  [SAMPLE_RES_14BIT] if field data seems to contain 14-bit audio
//  [SAMPLE_RES_UNKNOWN] if unable to determine data resolution
uint8_t STC007DataStitcher::getFieldResolution(std::vector<STC007Line> *field, uint16_t f_size)
{
    uint8_t result;
    uint16_t test_size, res14_count, res16_count;

    //QElapsedTimer dbg_timer;
    test_size = res14_count = res16_count = 0;

    if(preset_audio_res==SAMPLE_RES_14BIT)
    {
#ifdef DI_LOG_AUDRES_VERBOSE
        if((log_level&LOG_PROCESS)!=0)
        {
            qInfo()<<"[L2B-007] Audio resolution is preset by user to 14 bits";
        }
#endif
        // Audio resolution is externally preset, return that value.
        return SAMPLE_RES_14BIT;
    }
    else if(preset_audio_res==SAMPLE_RES_16BIT)
    {
#ifdef DI_LOG_AUDRES_VERBOSE
        if((log_level&LOG_PROCESS)!=0)
        {
            qInfo()<<"[L2B-007] Audio resolution is preset by user to 16 bits";
        }
#endif
        // Audio resolution is externally preset, return that value.
        return SAMPLE_RES_16BIT;
    }

