Fagear/SDVPCMdecoder/stc007datastitcher.cpp
    // Check if provided size exceeds data size in the container.
    if(field->size()<f_size)
    {
        qWarning()<<DBG_ANCHOR<<"[L2B-007] Array index out-of-bound!"<<field->size()<<f_size;
        return SAMPLE_RES_UNKNOWN;
    }

    // Calculate last line number before a field seam.
    if(f_size>STC007DataBlock::MIN_DEINT_DATA)
    {
        test_size = f_size-STC007DataBlock::MIN_DEINT_DATA;
    }
    else
    {
        //qWarning()<<DBG_ANCHOR<<"[L2B-007] Not enough data ("<<f_size<<")!";
        return SAMPLE_RES_UNKNOWN;
    }

    // Perform automatic resolution detection.
    pad_checker.setInput(field);
    pad_checker.setOutput(&padding_block);
    //pad_checker.setLogLevel(STC007Deinterleaver::LOG_PROCESS);
    pad_checker.setLogLevel(0);
    //pad_checker.setIgnoreCRC(ignore_CRC);
    pad_checker.setIgnoreCRC(false);
    pad_checker.setForcedErrorCheck(true);
    // Check only P-code, that's enough. Q-code can cause false "corrections" and "valid" CRCs on 16-bit data.
    pad_checker.setPCorrection(true);
    pad_checker.setQCorrection(false);
    for(uint16_t index=0;index<test_size;index++)
    {
#ifdef DI_LOG_AUDRES_VERBOSE
        if((log_level&LOG_PROCESS)!=0)
        {
            qInfo()<<"[L2B-007] Converting at index"<<index<<"to data block, assuming 14-bit samples...";
        }
#endif
        // First, test in 14-bit mode.
        pad_checker.setResMode(STC007Deinterleaver::RES_MODE_14BIT);
        // Fill up data block, performing de-interleaving.
        pad_checker.processBlock(index);
        // Check data block state.
        //if((padding_block.isBlockValid()!=false)&&(padding_block.canForceCheck()!=false)&&(padding_block.isAlmostSilent()==false))
        if((padding_block.isBlockValid()!=false)&&(padding_block.canForceCheck()!=false)&&(padding_block.isSilent()==false))
        {
            // Count valid 14-bit data blocks (excluding total silence).
            res14_count++;
#ifdef DI_LOG_AUDRES_VERBOSE
            if((log_level&LOG_PROCESS)!=0)
            {
                qInfo()<<"[L2B-007] Valid 14-bit results:"<<res14_count;
            }
#endif
        }
        else
        {
#ifdef DI_LOG_AUDRES_VERBOSE
            if((log_level&LOG_PROCESS)!=0)
            {
                qInfo()<<"[L2B-007] No good 14-bit result this time.";
            }
#endif
            // Check if data is BROKEN.
            if((padding_block.isDataBroken()!=false)&&(res14_count>0))
            {
                // Reduce count of valid blocks for BROKEN ones (wrong resolution should produce many BROKEN blocks).
                res14_count--;
            }
        }
#ifdef DI_LOG_AUDRES_VERBOSE
        if((log_level&LOG_PROCESS)!=0)
        {
            qInfo()<<"[L2B-007] Converting at index"<<index<<"to data block, assuming 16-bit samples...";
        }
#endif
        // Second, test in 16-bit mode.
        pad_checker.setResMode(STC007Deinterleaver::RES_MODE_16BIT);
        // Fill up data block, performing de-interleaving.
        pad_checker.processBlock(index);
        // Check data block state.
        //if((padding_block.isBlockValid()!=false)&&(padding_block.canForceCheck()!=false)&&(padding_block.isAlmostSilent()==false))
        if((padding_block.isBlockValid()!=false)&&(padding_block.canForceCheck()!=false)&&(padding_block.isSilent()==false))
        {
            // Count valid 16-bit data blocks.
            res16_count++;
#ifdef DI_LOG_AUDRES_VERBOSE
            if((log_level&LOG_PROCESS)!=0)
            {
                qInfo()<<"[L2B-007] Valid 16-bit results:"<<res16_count;
            }
#endif
        }
        else
        {
#ifdef DI_LOG_AUDRES_VERBOSE
            if((log_level&LOG_PROCESS)!=0)
            {
                qInfo()<<"[L2B-007] No good 16-bit result this time.";
            }
#endif
            // Check if data is BROKEN.
            if((padding_block.isDataBroken()!=false)&&(res16_count>0))
            {
                // Reduce count of valid blocks for BROKEN ones.
                res16_count--;
            }
        }
    }
    // Restore CRC mode.
    pad_checker.setIgnoreCRC(ignore_CRC);

    //qInfo()<<"Test size:"<<test_size<<", 14 bit:"<<res14_count<<", 16-bit:"<<res16_count;

    // Determine the resolution.
    result = SAMPLE_RES_UNKNOWN;
    if(res14_count>(STC007DataBlock::INTERLEAVE_OFS*2))
    {
        // If data is 16-bit there will be ~ the same count for both.
        // (16-bit is backwards-compatible with 14-bit decoders.)
        test_size = res16_count*128;
        test_size = test_size/res14_count;
        if(test_size>32)
        {
            result = SAMPLE_RES_16BIT;
        }
        else
        {
            result = SAMPLE_RES_14BIT;
        }
    }

#ifdef DI_EN_DBG_OUT
    if(/*((log_level&LOG_PADDING)!=0)&&*/((log_level&LOG_PROCESS)!=0))
    {
        QString log_line;
        log_line = "[L2B-007] Frame ("+QString::number(padding_block.getStartFrame())+") ";
        if((padding_block.getStartLine()%2)==0)
        {
            log_line += "even";
        }
        else
        {
            log_line += "odd";
        }
        log_line += " field resolution: ";
        if(result==SAMPLE_RES_14BIT)
        {
            log_line += "14-bit";
        }
        else if(result==SAMPLE_RES_16BIT)
        {
            log_line += "16-bit";
        }
        else if(result==SAMPLE_RES_UNKNOWN)
        {
            log_line += "UNK";
        }
        if((preset_audio_res==SAMPLE_RES_14BIT)||(preset_audio_res==SAMPLE_RES_16BIT))
        {
            log_line += " (preset)";
        }
        log_line += " (14/16 bit good results: "+QString::number(res14_count)+"/"+QString::number(res16_count)+")";
        qInfo()<<log_line;
    }
#endif
    return result;
}

//------------------------ Determine resulting resolution mode by two other modes in field pair.
// 14S + 14S = 14S
// 16S + 16S = 16S
// 14A + 14A = 14S
// 16A + 16A = 16S
// 14S + 14A = 14S
// 14S + 16A = 16A
// 14S + 16S = 16A
// 14A + 14S = 14A
// 14A + 16A = 16A
// 14A + 16S = 16A
// 16A + 14S = 16A
// 16A + 14A = 16A
// 16A + 16S = 16A
// 16S + 14S = 14A
// 16S + 14A = 16A
// 16S + 16A = 16A
uint8_t STC007DataStitcher::getResolutionModeForSeam(uint8_t in_res_field1, uint8_t in_res_field2)
{
    uint8_t fin_res;
    // Set default resolution mode as auto 16-bit.
    fin_res = STC007Deinterleaver::RES_MODE_16BIT_AUTO;
    if(in_res_field1==in_res_field2)
    {
        fin_res = in_res_field1;
        if(in_res_field1==STC007Deinterleaver::RES_MODE_14BIT_AUTO)
        {
            fin_res = STC007Deinterleaver::RES_MODE_14BIT;
        }
        else if(in_res_field1==STC007Deinterleaver::RES_MODE_16BIT_AUTO)
        {
            fin_res = STC007Deinterleaver::RES_MODE_16BIT;
        }
    }
    else if(in_res_field1==STC007Deinterleaver::RES_MODE_14BIT)
    {
        if(in_res_field2==STC007Deinterleaver::RES_MODE_14BIT_AUTO)
        {
            fin_res = STC007Deinterleaver::RES_MODE_14BIT_AUTO;
        }
    }
    else if(in_res_field1==STC007Deinterleaver::RES_MODE_14BIT_AUTO)
    {
        if(in_res_field2==STC007Deinterleaver::RES_MODE_14BIT)
        {
            fin_res = STC007Deinterleaver::RES_MODE_14BIT_AUTO;
        }
    }
    else if(in_res_field1==STC007Deinterleaver::RES_MODE_16BIT)
    {
        if(in_res_field2==STC007Deinterleaver::RES_MODE_14BIT)
        {
            fin_res = STC007Deinterleaver::RES_MODE_14BIT_AUTO;
        }
    }
    return fin_res;
}

