Fagear/SDVPCMdecoder/stc007datastitcher.cpp
//------------------------ Determine resulting data block resolution by two resolution modes in field pair.
uint8_t STC007DataStitcher::getResolutionForSeam(uint8_t in_res_field1, uint8_t in_res_field2)
{
    uint8_t fin_res;
    fin_res = getResolutionModeForSeam(in_res_field1, in_res_field2);
    if((fin_res==STC007Deinterleaver::RES_MODE_16BIT)||(fin_res==STC007Deinterleaver::RES_MODE_16BIT_AUTO))
    {
        fin_res = STC007DataBlock::RES_16BIT;
    }
    else
    {
        fin_res = STC007DataBlock::RES_14BIT;
    }
    return fin_res;
}

//------------------------ Get resolution of audio samples after [findFieldResolution()] run.
uint8_t STC007DataStitcher::getDataBlockResolution(std::deque<STC007Line> *in_line_buffer, uint16_t line_sh)
{
    if(mode_m2!=false)
    {
        // Force strict 14-bit samples for M2 mode.
        return STC007Deinterleaver::RES_MODE_14BIT;
    }

    if(in_line_buffer==NULL)
    {
        qWarning()<<DBG_ANCHOR<<"[L2B-007] Null pointer for buffer provided, exiting...";
        return STC007Deinterleaver::RES_MODE_14BIT_AUTO;
    }

    if(in_line_buffer->size()<=(size_t)(line_sh+STC007DataBlock::MIN_DEINT_DATA))
    {
        qWarning()<<DBG_ANCHOR<<"[L2B-007] Buffer index out-of-bound, exiting..."<<in_line_buffer->size()<<(line_sh+STC007DataBlock::MIN_DEINT_DATA);
        return STC007Deinterleaver::RES_MODE_14BIT_AUTO;
    }

    uint8_t first_line_ofs, last_line_ofs, first_res, last_res, fin_res;

    first_line_ofs = STC007DataBlock::LINE_L0;
    last_line_ofs = STC007DataBlock::LINE_Q0;
    first_res = last_res = fin_res = STC007Deinterleaver::RES_MODE_14BIT;

    // Check first line of the block.
    if((*in_line_buffer)[first_line_ofs+line_sh].frame_number==frasm_f2.frame_number)
    {
        // First line is from the Frame B.
        if((((*in_line_buffer)[first_line_ofs+line_sh].line_number)%2)==0)
        {
            // First line is from the even field.
            first_res = frasm_f2.even_resolution;
        }
        else
        {
            // First line is from the odd field.
            first_res = frasm_f2.odd_resolution;
        }
    }
    else if((*in_line_buffer)[first_line_ofs+line_sh].frame_number==frasm_f1.frame_number)
    {
        // First line is from the Frame A.
        if((((*in_line_buffer)[first_line_ofs+line_sh].line_number)%2)==0)
        {
            // First line is from the even field.
            first_res = frasm_f1.even_resolution;
        }
        else
        {
            // First line is from the odd field.
            first_res = frasm_f1.odd_resolution;
        }
    }
    else if((*in_line_buffer)[first_line_ofs+line_sh].frame_number==frasm_f0.frame_number)
    {
        // First line is from the last Frame (Frame 0).
        if((((*in_line_buffer)[first_line_ofs+line_sh].line_number)%2)==0)
        {
            // First line is from the even field.
            first_res = frasm_f0.even_resolution;
        }
        else
        {
            // First line is from the odd field.
            first_res = frasm_f0.odd_resolution;
        }
    }
    // Check last line of the block.
    if((*in_line_buffer)[last_line_ofs+line_sh].frame_number==frasm_f2.frame_number)
    {
        // Last line is from the Frame B.
        if((((*in_line_buffer)[last_line_ofs+line_sh].line_number)%2)==0)
        {
            // Last line is from the even field.
            last_res = frasm_f2.even_resolution;
        }
        else
        {
            // Last line is from the odd field.
            last_res = frasm_f2.odd_resolution;
        }
    }
    else if((*in_line_buffer)[last_line_ofs+line_sh].frame_number==frasm_f1.frame_number)
    {
        // Last line is from the Frame A.
        if((((*in_line_buffer)[last_line_ofs+line_sh].line_number)%2)==0)
        {
            // Last line is from the even field.
            last_res = frasm_f1.even_resolution;
        }
        else
        {
            // Last line is from the odd field.
            last_res = frasm_f1.odd_resolution;
        }
    }
    else if((*in_line_buffer)[last_line_ofs+line_sh].frame_number==frasm_f0.frame_number)
    {
        // Last line is from the last Frame (Frame 0).
        if((((*in_line_buffer)[last_line_ofs+line_sh].line_number)%2)==0)
        {
            // Last line is from the even field.
            last_res = frasm_f0.even_resolution;
        }
        else
        {
            // Last line is from the odd field.
            last_res = frasm_f0.odd_resolution;
        }
    }

    // Determine resulting resolution mode.
    fin_res = getResolutionModeForSeam(first_res, last_res);

#ifdef DI_EN_DBG_OUT
    /*if(((log_level&LOG_PADDING)!=0)&&((log_level&LOG_PROCESS)!=0))
    {
        QString log_line;
        log_line = "[L2B-007] Frame ("+QString::number((*in_line_buffer)[STC007DataBlock::LINE_Q0+line_sh].frame_number)+
                   ") line ("+QString::number((*in_line_buffer)[STC007DataBlock::LINE_Q0+line_sh].line_number)+") resolution: ";
        if(fin_res==STC007Deinterleaver::RES_MODE_14BIT)
        {
             log_line += "14-bit";
        }
        else if(fin_res==STC007Deinterleaver::RES_MODE_16BIT)
        {
             log_line += "16-bit";
        }
        else if(fin_res==STC007Deinterleaver::RES_MODE_14BIT_AUTO)
        {
             log_line += "14-bit (auto)";
        }
        else
        {
             log_line += "16-bit (auto)";
        }
        qInfo()<<log_line;
    }*/
#endif
    return fin_res;
}

//------------------------ Try to stitch fields with provided padding, collect stats.
uint8_t STC007DataStitcher::tryPadding(std::vector<STC007Line> *field1, uint16_t f1_size,
                                        std::vector<STC007Line> *field2, uint16_t f2_size,
                                        uint16_t padding,
                                        FieldStitchStats *stitch_stats)
{
    bool suppress_log, run_lock;
    uint8_t ext_di_log_lvl;
    uint8_t unchecked_lim;
    uint16_t line_count, line_num;
    uint16_t valid_burst_count, silence_burst_count, uncheck_burst_count, broken_count;
    uint16_t valid_burst_max, silence_burst_max, uncheck_burst_max, brk_burst_max;
    uint32_t frame_num;
    size_t buf_size;
    // Empty line container.
    STC007Line empty_line;

    suppress_log = !((log_level&LOG_PADDING_BLOCK)!=0);

#ifdef DI_EN_DBG_OUT
    if(((log_level&LOG_PADDING_LINE)!=0)||(suppress_log==false))
    {
        qInfo()<<"[L2B-007] Checking padding ="<<padding;
    }
#endif
    if((field1==NULL)||(field2==NULL))
    {
        qWarning()<<DBG_ANCHOR<<"[L2B-007] Null pointer for buffer provided, exiting...";
        return DS_RET_NO_DATA;
    }

    if((field1->size()<f1_size)||(field2->size()<f2_size))
    {
        qWarning()<<DBG_ANCHOR<<"[L2B-007] Buffer index out-of-bound, exiting..."<<field1->size()<<f1_size<<field2->size()<<f2_size;
        return DS_RET_NO_DATA;
    }

    // Clear the combined fields storage.
    padding_queue.clear();

    // Dump two fields sequently into one array, inserting padding in process.
    // Calculate how many lines to copy.
    if(f1_size>(STC007DataBlock::MIN_DEINT_DATA+STC007DataBlock::INTERLEAVE_OFS/2-padding))
    {
        // Start from defined line from the end of the field.
        line_count = f1_size-(STC007DataBlock::MIN_DEINT_DATA+STC007DataBlock::INTERLEAVE_OFS/2-padding);
    }
    else
    {
        // Copy all.
        line_count = 0;
    }

    // Copy data from field 1.
    for(uint16_t index=line_count;index<f1_size;index++)
    {
        // Fill from the bottom of [field1] to the top.
        padding_queue.push_back((*field1)[index]);
    }
    // Save frame parameters to carry those into padding.
    line_num = (*field1)[f1_size-1].line_number;
    frame_num = (*field1)[f1_size-1].frame_number;
    // Insert padding lines.
    empty_line.coords.setToZero();
    for(uint16_t ind_pad=0;ind_pad<padding;ind_pad++)
    {
        // Set valid frame and line numbers.
        empty_line.frame_number = frame_num;
        line_num = line_num+2;
        empty_line.line_number = line_num;
        padding_queue.push_back(empty_line);
    }
    // Calculate how many lines to copy.
    if(f2_size>(STC007DataBlock::MIN_DEINT_DATA+STC007DataBlock::INTERLEAVE_OFS/2))
    {
        // Copy only defined number of lines.
        line_count = (STC007DataBlock::MIN_DEINT_DATA+STC007DataBlock::INTERLEAVE_OFS/2);
    }
    else
    {
        // Copy all.
        line_count = f2_size;
    }
    // Copy data from field 2.
    for(uint16_t index=0;index<line_count;index++)
    {
        // Fill from the top of [field2] to the bottom.
        padding_queue.push_back((*field2)[index]);
    }

