Fagear/SDVPCMdecoder/stc007datastitcher.cpp
    // Get final buffer size.
    buf_size = padding_queue.size();
    if(buf_size<STC007DataBlock::MIN_DEINT_DATA)
    {
        // Not enough lines to perform deinterleaving.
        return DS_RET_NO_DATA;
    }

#ifdef DI_EN_DBG_OUT
    if((log_level&LOG_PADDING_LINE)!=0)
    {
        // Dump test lines array.
        for(size_t index=0;index<padding_queue.size();index++) {qInfo()<<"[L2B-007]"<<QString::fromStdString(padding_queue[index].dumpContentString());}
    }
#endif

    valid_burst_count = silence_burst_count = uncheck_burst_count = broken_count = 0;
    valid_burst_max = silence_burst_max = uncheck_burst_max = brk_burst_max = 0;

    unchecked_lim = max_unchecked_14b_blocks;
    if(enable_Q_code==false)
    {
        unchecked_lim = max_unchecked_16b_blocks;
    }

    // Set parameters for test conversion.
    ext_di_log_lvl = 0;
    if(((log_level&LOG_PADDING)!=0)&&((log_level&LOG_DEINTERLEAVE)!=0))
    {
        ext_di_log_lvl |= STC007Deinterleaver::LOG_PROCESS;
    }
    if(((log_level&LOG_PADDING)!=0)&&((log_level&LOG_ERROR_CORR)!=0))
    {
        ext_di_log_lvl |= STC007Deinterleaver::LOG_ERROR_CORR;
    }
    pad_checker.setInput(&padding_queue);
    pad_checker.setOutput(&padding_block);
    pad_checker.setLogLevel(ext_di_log_lvl);
    pad_checker.setResMode(getDataBlockResolution(&padding_queue, 0));
    pad_checker.setIgnoreCRC(ignore_CRC);
    pad_checker.setForcedErrorCheck(true);
    pad_checker.setPCorrection(enable_P_code);
    pad_checker.setQCorrection(enable_Q_code);
    pad_checker.setCWDCorrection(false);

    // Run deinterleaving and error-detection on combined and padded buffer.
    buf_size = 0;
    while(1)
    {
        // Fill up data block, performing de-interleaving and error-correction.
        if(pad_checker.processBlock(buf_size)!=STC007Deinterleaver::DI_RET_OK)
        {
            // No data left in the buffer or some other error while de-interleaving.
            // Exit line cycle.
            break;
        }
        // At least cycle run once.
        run_lock = true;

        // Check for valid (and not silent) audio data in the block.
        if((padding_block.isBlockValid()!=false)
            &&(padding_block.isSilent()==false)
            &&(padding_block.canForceCheck()!=false))
        {
            valid_burst_count++;
        }
        else
        {
            if(valid_burst_count>valid_burst_max)
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[L2B-007] Updating 'valid' limit from"<<valid_burst_max<<"to"<<valid_burst_count<<"at pass"<<buf_size;
                }
#endif
                valid_burst_max = valid_burst_count;
            }
        }
#ifdef DI_EN_DBG_OUT
        if(suppress_log==false)
        {
            qInfo()<<"[L2B-007]"<<QString::fromStdString(padding_block.dumpContentString());
        }
#endif
        // Is there too much silence?
        // P-check and Q-check will not have any use on silence.
        if(padding_block.isSilent()!=false)
        {
            // Found block with too much silence.
            silence_burst_count++;
            if(silence_burst_count>=MAX_BURST_SILENCE)
            {
                valid_burst_count = 0;
            }
        }
        else
        {
            // Not silent at the moment.
            if(silence_burst_count>silence_burst_max)
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[L2B-007] Updating 'silence' limit from"<<silence_burst_max<<"to"<<silence_burst_count<<"at pass"<<buf_size;
                }
#endif
                // Update longest burst of silence.
                silence_burst_max = silence_burst_count;
            }
            // Reset counter if burst ended.
            silence_burst_count = 0;
        }
        // Check for "uncheckable" data blocks: invalid, with no P and Q, with Q-corrected samples.
        // Q-correction can "correct" samples from broken data blocks, resulting in loud popping noises.
        // Make sure that there are no too many Q-corrections in a row to make data block validation possible.
        if(((enable_Q_code!=false)&&((padding_block.canForceCheck()==false)||(padding_block.isDataFixedByQ()!=false)))||
          ((enable_Q_code==false)&&(padding_block.isDataFixedByP()!=false)))        // With disabled Q for 14-bit burst of P-corrections can skew padding result.
        {
            // Block can not be checked for validity.
            uncheck_burst_count++;
            // Choose limit according to resolution.
            if(uncheck_burst_count>=unchecked_lim)
            {
                valid_burst_count = 0;
            }
        }
        else
        {
            if(uncheck_burst_count>uncheck_burst_max)
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[L2B-007] Updating 'unchecked' limit from"<<uncheck_burst_max<<"to"<<uncheck_burst_count<<"at pass"<<buf_size;
                }
#endif
                // Update longest burst of unchecked blocks.
                uncheck_burst_max = uncheck_burst_count;
            }
            // Reset counter if burst ended.
            uncheck_burst_count = 0;
        }
        // Check for BROKEN data block.
        if(padding_block.isDataBroken()!=false)
        {
            // Found broken "ladders", stitching is incorrect.
            broken_count++;
            if(broken_count>=MAX_BURST_BROKEN)
            {
                valid_burst_count = 0;
            }
        }
        buf_size++;
    }
    // Clear padding queue.
    padding_queue.clear();

    // Update post-cycle counters if required.
    if(valid_burst_count>valid_burst_max)
    {
#ifdef DI_EN_DBG_OUT
        if(suppress_log==false)
        {
            qInfo()<<"[L2B-007] Updating 'valid' limit from"<<valid_burst_max<<"to"<<valid_burst_count<<"at pass"<<buf_size;
        }
#endif
        valid_burst_max = valid_burst_count;
    }
    if(silence_burst_count>silence_burst_max)
    {
#ifdef DI_EN_DBG_OUT
        if(suppress_log==false)
        {
            qInfo()<<"[L2B-007] Updating 'silence' limit from"<<silence_burst_max<<"to"<<silence_burst_count<<"at pass"<<buf_size;
        }
#endif
        // Update longest burst of silence.
        silence_burst_max = silence_burst_count;
    }
    if(uncheck_burst_count>uncheck_burst_max)
    {
#ifdef DI_EN_DBG_OUT
        if(suppress_log==false)
        {
            qInfo()<<"[L2B-007] Updating 'unchecked' limit from"<<uncheck_burst_max<<"to"<<uncheck_burst_count<<"at pass"<<buf_size;
        }
#endif
        // Update longest burst of unchecked blocks.
        uncheck_burst_max = uncheck_burst_count;
    }

    // Output stats for the seam.
    if((stitch_stats!=NULL)&&(run_lock!=false))
    {
        stitch_stats->index = padding;
        stitch_stats->valid = valid_burst_max;
        stitch_stats->silent = silence_burst_max;
        stitch_stats->unchecked = uncheck_burst_max;
        stitch_stats->broken = broken_count;
    }

    // Check for BROKEN data blocks.
    if(broken_count>=MAX_BURST_BROKEN)
    {
        // BROKEN data.
        return DS_RET_BROKE;
    }
    // Check for too much silence.
    if(silence_burst_max>MAX_BURST_SILENCE)
    {
        // Too much silence.
        return DS_RET_SILENCE;
    }
    if(uncheck_burst_max>unchecked_lim)
    {
        // Too many unchecked.
        return DS_RET_NO_PAD;
    }
    // Check is any good blocks were found.
    if(valid_burst_max==0)
    {
        // No good blocks.
        return DS_RET_NO_PAD;
    }
    // Padding is OK.
    return DS_RET_OK;
}

//------------------------ Find line padding to properly (without parity errors) stitch two fields.
uint8_t STC007DataStitcher::findPadding(std::vector<STC007Line> *field1, uint16_t f1_size,
                                        std::vector<STC007Line> *field2, uint16_t f2_size,
                                        uint8_t in_std, uint8_t in_resolution, uint16_t *padding)
{
    bool suppress_log;
    uint16_t pad, max_padding, min_broken;
    uint8_t unchecked_lim, no_brk_idx, stitch_res;

    stitch_res = DS_RET_NO_PAD;
    suppress_log = !(((log_level&LOG_PADDING)!=0)&&((log_level&LOG_PROCESS)!=0));

    if((field1==NULL)||(field2==NULL)||(padding==NULL))
    {
        qWarning()<<DBG_ANCHOR<<"[L2B-007] Null pointer provided, exiting...";
        return stitch_res;
    }

