Fagear/SDVPCMdecoder/stc007datastitcher.cpp
    pad = f1_size;
    // Assume default padding according to PAL/NTSC standards.
    if(in_std==FrameAsmDescriptor::VID_PAL)
    {
        // There can be more that standard count of total lines per field
        // while much less valid lines after trimming,
        // check for limits to avoid underrun.
        if(pad>LINES_PF_PAL)
        {
            (*padding) = 0;
        }
        else
        {
            (*padding) = LINES_PF_PAL - pad;
        }
    }
    else if(in_std==FrameAsmDescriptor::VID_NTSC)
    {
        if(pad>LINES_PF_NTSC)
        {
            (*padding) = 0;
        }
        else
        {
            (*padding) = LINES_PF_NTSC - pad;
        }
    }
    else
    {
        (*padding) = 0;
    }
#ifdef DI_EN_DBG_OUT
    if(suppress_log==false)
    {
        qInfo()<<"[L2B-007] Fallback padding:"<<(*padding);
    }
#endif

    max_padding = MAX_PADDING_14BIT;
    unchecked_lim = max_unchecked_14b_blocks;
    // Check Q-code availability to set maximum padding distance.
    if((in_resolution==STC007DataBlock::RES_16BIT)||(enable_Q_code==false))
    {
        // Without Q-code maximum padding is half of that of PQ mode.
        max_padding = MAX_PADDING_16BIT;
        unchecked_lim = max_unchecked_16b_blocks;
    }
#ifdef DI_EN_DBG_OUT
    if(suppress_log==false)
    {
        qInfo()<<"[L2B-007] Maximum available padding:"<<max_padding;
    }
#endif

    last_pad_counter = 0xFF;
    // Check if P-code and/or Q-code are available for force-checking.
    if((enable_P_code!=false)||(enable_Q_code!=false))
    {
        // Initialize stats data.
        std::vector<FieldStitchStats> stitch_data;
        stitch_data.resize(max_padding);
        min_broken = 0xFFFF;
        no_brk_idx = 0;

        // Padding cycle, collect stats data.
        for(pad=0;pad<max_padding;pad++)
        {
            // Try to stitch fields with set padding.
            tryPadding(field1, f1_size, field2, f2_size, pad, &stitch_data[pad]);
            // Find minimum broken blocks within all passes.
            if(min_broken>stitch_data[pad].broken)
            {
                // Min minimum.
                min_broken = stitch_data[pad].broken;
                if(min_broken==0)
                {
                    no_brk_idx = pad;
                }
            }
            else if(min_broken==0)
            {
                // Padding with no broken blocks already found.
                if((stitch_data[no_brk_idx].valid>0)&&(stitch_data[no_brk_idx].unchecked<unchecked_lim)&&(stitch_data[pad].broken>0))
                {
                    // Padding with no broken blocks passes checks for number of valid and unchecked blocks.
                    // Current one has more broken blocks, no need to check further.
                    break;
                }
            }
        }

        // Search for minimum number of broken blocks.
        // Sort by number of valid blocks from max to min.
        // Sort by number of unchecked blocks from min to max.
        // Pick first after sort.
        // If its unchecked blocks count is less than allowed - set as detected padding.
        std::sort(stitch_data.begin(), stitch_data.end());

#ifdef DI_EN_DBG_OUT
        if(suppress_log==false)
        {
            qInfo()<<"[L2B-007] Minimal count of BROKEN blocks:"<<min_broken;
            QString index_line, valid_line, silence_line, unchecked_line, broken_line, tmp;
            for(pad=0;pad<max_padding;pad++)
            {
                tmp.sprintf("%02u", stitch_data[pad].index);
                index_line += "|"+tmp;
                tmp.sprintf("%02x", stitch_data[pad].broken);
                broken_line += "|"+tmp;
                tmp.sprintf("%02x", stitch_data[pad].valid);
                valid_line += "|"+tmp;
                tmp.sprintf("%02x", stitch_data[pad].unchecked);
                unchecked_line += "|"+tmp;
                tmp.sprintf("%02x", stitch_data[pad].silent);
                silence_line += "|"+tmp;
            }
            qInfo()<<"[L2B-007] Sorted stats:";
            qInfo()<<"[L2B-007] Padding:  "<<index_line;
            qInfo()<<"[L2B-007] Broken:   "<<broken_line;
            qInfo()<<"[L2B-007] Valid:    "<<valid_line;
            qInfo()<<"[L2B-007] Unchecked:"<<unchecked_line;
            qInfo()<<"[L2B-007] Silent:   "<<silence_line;
        }
#endif

        last_pad_counter = stitch_data[0].broken;
        // Check for silence.
        if(stitch_data[0].silent<MAX_BURST_SILENCE)
        {
            // Not so many silent blocks.
            if(stitch_data[0].unchecked<unchecked_lim)
            {
                // Not too many unchecked blocks.
                if((stitch_data[0].broken<2)&&(stitch_data[0].broken<stitch_data[1].broken))
                {
                    // After sorting first padding has less BROKEN blocks.
                    stitch_res = DS_RET_OK;
                    (*padding) = stitch_data[0].index;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Detected valid padding of"<<stitch_data[0].index<<"by least count of BROKEN blocks";
                    }
#endif
                }
                else if((((int16_t)stitch_data[0].valid-(int16_t)stitch_data[1].valid)>MAX_BURST_UNCH_DELTA)&&(stitch_data[0].broken==0))
                {
                    stitch_res = DS_RET_OK;
                    (*padding) = stitch_data[0].index;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Detected valid padding of"<<stitch_data[0].index<<"by most valid blocks";
                    }
#endif
                }
                /*else if((((int16_t)stitch_data[1].unchecked-(int16_t)stitch_data[0].unchecked)>MAX_BURST_UNCH_DELTA)&&(stitch_data[0].broken==0))
                {
                    stitch_res = DS_RET_OK;
                    (*padding) = stitch_data[0].index;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Detected valid (but suspicious) padding of"<<stitch_data[0].index<<"by least unchecked blocks";
                    }
#endif
                }*/
#ifdef DI_EN_DBG_OUT
                else
                {
                    // First entry after sorting doesn't differ much from the second one.
                    // Valid padding (at the first positiob) should produce vastly different result.
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Unable to find padding, unsufficient valid blocks";
                    }
                }
#endif
            }
            else
            {
                // Too many unchecked blocks.
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[L2B-007] Unable to find padding, too many unchecked blocks";
                }
#endif
                // In case of BROKEN blocks on the seam sorting can screw up and ignore valid blocks.
                // Equal out all BROKEN counters to sort by valid blocks.
                for(pad=0;pad<max_padding;pad++)
                {
                    stitch_data[pad].broken = min_broken;
                    if(stitch_data[pad].unchecked>=unchecked_lim)
                    {
                        stitch_data[pad].broken = 0xFF;
                    }
                }
                // Re-sort stats.
                std::sort(stitch_data.begin(), stitch_data.end());
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    QString index_line, valid_line, silence_line, unchecked_line, tmp;
                    qInfo()<<"[L2B-007] Maybe too many BROKEN blocks on the seam, ignoring BROKEN counter and re-sorting...";
                    for(pad=0;pad<max_padding;pad++)
                    {
                        tmp.sprintf("%02u", stitch_data[pad].index);
                        index_line += "|"+tmp;
                        tmp.sprintf("%02x", stitch_data[pad].valid);
                        valid_line += "|"+tmp;
                        tmp.sprintf("%02x", stitch_data[pad].unchecked);
                        unchecked_line += "|"+tmp;
                        tmp.sprintf("%02x", stitch_data[pad].silent);
                        silence_line += "|"+tmp;
                    }
                    qInfo()<<"[L2B-007] Re-sorted stats:";
                    qInfo()<<"[L2B-007] Padding:  "<<index_line;
                    qInfo()<<"[L2B-007] Valid:    "<<valid_line;
                    qInfo()<<"[L2B-007] Unchecked:"<<unchecked_line;
                    qInfo()<<"[L2B-007] Silent:   "<<silence_line;
                }
#endif
                if(stitch_data[0].unchecked<unchecked_lim)
                {
                    // Not too many unchecked blocks.
                    if(((int16_t)stitch_data[0].valid-(int16_t)stitch_data[1].valid)>MAX_BURST_UNCH_DELTA)
                    {
                        stitch_res = DS_RET_OK;
                        (*padding) = stitch_data[0].index;
#ifdef DI_EN_DBG_OUT
                        if(suppress_log==false)
                        {
                            qInfo()<<"[L2B-007] Detected valid padding of"<<stitch_data[0].index<<"by most valid blocks";
                        }
#endif
                    }
                    /*else if(((int16_t)stitch_data[1].unchecked-(int16_t)stitch_data[0].unchecked)>MAX_BURST_UNCH_DELTA)
                    {
                        stitch_res = DS_RET_OK;
                        (*padding) = stitch_data[0].index;
#ifdef DI_EN_DBG_OUT
                        if(suppress_log==false)
                        {
                            qInfo()<<"[L2B-007] Detected valid (but suspicious) padding of"<<stitch_data[0].index<<"by least unchecked blocks";
                        }
#endif
                    }*/
#ifdef DI_EN_DBG_OUT
                    else
                    {
                        // First entry after sorting doesn't differ much from the second one.
                        // Valid padding (at the first positiob) should produce vastly different result.
                        if(suppress_log==false)
                        {
                            qInfo()<<"[L2B-007] Unable to find padding, unsufficient valid blocks";
                        }
                    }
#endif
                }
#ifdef DI_EN_DBG_OUT
                else
                {
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Unable to find padding, too many unchecked blocks";
                    }
                }
#endif
            }
        }
        else
        {
            // Too many silent blocks.
            stitch_res = DS_RET_SILENCE;
#ifdef DI_EN_DBG_OUT
            if(suppress_log==false)
            {
                qInfo()<<"[L2B-007] Unable to find padding due to silence";
            }
#endif
        }
    }
#ifdef DI_EN_DBG_OUT
    else
    {
        if(suppress_log==false)
        {
            qInfo()<<"[L2B-007] No P and Q codes, no data for padding detection";
        }
    }
#endif

    return stitch_res;
}

//------------------------ Clear field order history.
void STC007DataStitcher::clearFieldOrderStats()
{
    stats_field_order.fill(FrameAsmDescriptor::ORDER_UNK);
}

//------------------------ Add new field order to the list, remove oldest one.
void STC007DataStitcher::updateFieldOrderStats(uint8_t new_order)
{
    // Replace oldest value with the new one.
    stats_field_order.push(new_order);
}

//------------------------ Get most probable field order from stats.
uint8_t STC007DataStitcher::getProbableFieldOrder()
{
    uint8_t count_tff, count_bff;
    count_tff = count_bff = 0;
    // Count good field orders.
    for(uint8_t index=0;index<STATS_DEPTH;index++)
    {
        if(stats_field_order[index]==FrameAsmDescriptor::ORDER_TFF)
        {
            count_tff++;
        }
        else if(stats_field_order[index]==FrameAsmDescriptor::ORDER_BFF)
        {
            count_bff++;
        }
    }
    // Determine field order by statistics.
    if((count_tff>0)||(count_bff>0))
    {
        if(count_tff<count_bff)
        {
#ifdef DI_EN_DBG_OUT
            if((log_level&LOG_FIELD_ASSEMBLY)!=0)
            {
                QString log_line;
                log_line.sprintf("[L2B-007] Good field order by stats is BFF (TFF: %02u, BFF: %02u)", count_tff, count_bff);
                qInfo()<<log_line;
            }
#endif
            return FrameAsmDescriptor::ORDER_BFF;
        }
        else
        {
#ifdef DI_EN_DBG_OUT
            if((log_level&LOG_FIELD_ASSEMBLY)!=0)
            {
                QString log_line;
                log_line.sprintf("[L2B-007] Good field order by stats is TFF (TFF: %02u, BFF: %02u)", count_tff, count_bff);
                qInfo()<<log_line;
            }
#endif
            return FrameAsmDescriptor::ORDER_TFF;
        }
    }
    else
    {
#ifdef DI_EN_DBG_OUT
        if((log_level&LOG_FIELD_ASSEMBLY)!=0)
        {
            QString log_line;
            log_line.sprintf("[L2B-007] Field order not found by stats (TFF: %02u, BFF: %02u)", count_tff, count_bff);
            qInfo()<<log_line;
        }
#endif
        return FrameAsmDescriptor::ORDER_UNK;
    }
}

//------------------------ Clear audio sample resolution history.
void STC007DataStitcher::clearResolutionStats()
{
    stats_resolution.fill(SAMPLE_RES_UNKNOWN);
}

//------------------------ Add new resolution to the list, remove oldest one.
void STC007DataStitcher::updateResolutionStats(uint8_t new_res)
{
    // Replace oldest value with the new one.
    stats_resolution.push(new_res);
}

