Fagear/SDVPCMdecoder/stc007datastitcher.cpp
//------------------------ Get most probable resolution from stats.
uint8_t STC007DataStitcher::getProbableResolution()
{
    uint8_t count_14bit, count_16bit;
    count_14bit = count_16bit = 0;
    // Count good resolution entries.
    for(uint8_t index=0;index<STATS_DEPTH;index++)
    {
        if(stats_resolution[index]==SAMPLE_RES_14BIT)
        {
            count_14bit++;
        }
        if(stats_resolution[index]==SAMPLE_RES_16BIT)
        {
            count_16bit++;
        }
    }
    // Determine resolution by statistics.
    if((count_14bit>0)||(count_16bit>0))
    {
        if(count_14bit<count_16bit)
        {
#ifdef DI_EN_DBG_OUT
            if((log_level&LOG_PROCESS)!=0)
            {
                QString log_line;
                log_line.sprintf("[L2B-007] Good resolution by stats is 16-bit (14-bit: %02u, 16-bit: %02u)", count_14bit, count_16bit);
                qInfo()<<log_line;
            }
#endif
            return SAMPLE_RES_16BIT;
        }
        else
        {
#ifdef DI_EN_DBG_OUT
            if((log_level&LOG_PROCESS)!=0)
            {
                QString log_line;
                log_line.sprintf("[L2B-007] Good resolution by stats is 14-bit (14-bit: %02u, 16-bit: %02u)", count_14bit, count_16bit);
                qInfo()<<log_line;
            }
#endif
            return SAMPLE_RES_14BIT;
        }
    }
    else
    {
#ifdef DI_EN_DBG_OUT
        if((log_level&LOG_PROCESS)!=0)
        {
            QString log_line;
            log_line.sprintf("[L2B-007] Resolution not found by stats (14-bit: %02u, 16-bit: %02u)", count_14bit, count_16bit);
            qInfo()<<log_line;
        }
#endif
        return SAMPLE_RES_UNKNOWN;
    }
}

//------------------------ Detect audio sample resolution in both field for Frame A and for Frame B.
// Input:
//  4x internal field containers for Frame A and Frame B.
// Updates:
//  [frasm_f1] and [frasm_f2] fields [odd_resolution] and [even_resolution].
// Returns:
//  Nothing.
void STC007DataStitcher::detectAudioResolution()
{
    bool suppress_log;
    uint8_t f1o_res, f1e_res, f2o_res, f2e_res;

    suppress_log = !(((log_level&LOG_PADDING)!=0)||((log_level&LOG_PROCESS)!=0));

#ifdef DI_EN_DBG_OUT
    if(suppress_log==false)
    {
        qInfo()<<"[L2B-007] -------------------- Resolution detection...";
    }
#endif

    // Check if M2 sample format is set.
    if(mode_m2==false)
    {
        // Non-M2 format, normal samples.
        // Get audio resolution in the fields (preset or by testing data in the fields).
        f1o_res = getFieldResolution(&frame1_odd, frasm_f1.odd_data_lines);
        f1e_res = getFieldResolution(&frame1_even, frasm_f1.even_data_lines);
        f2o_res = getFieldResolution(&frame2_odd, frasm_f2.odd_data_lines);
        f2e_res = getFieldResolution(&frame2_even, frasm_f2.even_data_lines);
        // Update resolution history if detected or preset.
        if((f1o_res==SAMPLE_RES_14BIT)||(f1o_res==SAMPLE_RES_16BIT))
        {
            updateResolutionStats(f1o_res);
        }
        if((f1e_res==SAMPLE_RES_14BIT)||(f1e_res==SAMPLE_RES_16BIT))
        {
            updateResolutionStats(f1e_res);
        }

        if((f1o_res==SAMPLE_RES_UNKNOWN)&&(f1e_res==SAMPLE_RES_UNKNOWN))
        {
            // No resolution data for both fields of Frame A.
#ifdef DI_EN_DBG_OUT
            if(suppress_log==false)
            {
                qInfo()<<"[L2B-007] No resolution data on both fields of Frame A";
            }
#endif
            if((f2o_res==SAMPLE_RES_UNKNOWN)&&(f2e_res==SAMPLE_RES_UNKNOWN))
            {
                // No resolution data for both fields of Frame B.
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[L2B-007] No resolution data on both fields of Frame B either";
                }
#endif
                // Get stats on resolution.
                f1o_res = getProbableResolution();
                if(f1o_res==SAMPLE_RES_16BIT)
                {
                    // 16-bit by stats.
                    frasm_f1.odd_resolution = frasm_f1.even_resolution = frasm_f2.odd_resolution = frasm_f2.even_resolution = STC007Deinterleaver::RES_MODE_16BIT_AUTO;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] All fields (Frame A and Frame B) are assumed to be 16-bit by stats";
                    }
#endif
                }
                else
                {
                    // If 14-bit or unknown by stats, assume 14-bit.
                    frasm_f1.odd_resolution = frasm_f1.even_resolution = frasm_f2.odd_resolution = frasm_f2.even_resolution = STC007Deinterleaver::RES_MODE_14BIT_AUTO;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        if(f1o_res==SAMPLE_RES_14BIT)
                        {
                            qInfo()<<"[L2B-007] All fields (Frame A and Frame B) are assumed to be 14-bit by stats";
                        }
                        else
                        {
                            qInfo()<<"[L2B-007] All fields (Frame A and Frame B) are assumed to be 14-bit by default, no stats available yet";
                        }
                    }
#endif
                }
            }
            else if(f2o_res==SAMPLE_RES_UNKNOWN)
            {
                // No resolution for odd field of Frame B.
                if(f2e_res==SAMPLE_RES_16BIT)
                {
                    // Frame B even field has 16-bit resolution.
                    frasm_f2.even_resolution = STC007Deinterleaver::RES_MODE_16BIT;
                    frasm_f1.odd_resolution = frasm_f1.even_resolution = frasm_f2.odd_resolution = STC007Deinterleaver::RES_MODE_16BIT_AUTO;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Frame B even field is detected as 16-bit, assume all other fields to be 16-bit";
                    }
#endif
                }
                else
                {
                    // Frame B even field has 14-bit resolution.
                    frasm_f2.even_resolution = STC007Deinterleaver::RES_MODE_14BIT;
                    frasm_f1.odd_resolution = frasm_f1.even_resolution = frasm_f2.odd_resolution = STC007Deinterleaver::RES_MODE_14BIT_AUTO;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Frame B even field is detected as 14-bit, assume all other fields to be 14-bit";
                    }
#endif
                }
            }
            else if(f2e_res==SAMPLE_RES_UNKNOWN)
            {
                // No resolution for even field of Frame B.
                if(f2o_res==SAMPLE_RES_16BIT)
                {
                    // Frame B odd field has 16-bit resolution.
                    frasm_f2.odd_resolution = STC007Deinterleaver::RES_MODE_16BIT;
                    frasm_f1.odd_resolution = frasm_f1.even_resolution = frasm_f2.even_resolution = STC007Deinterleaver::RES_MODE_16BIT_AUTO;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Frame B odd field is detected as 16-bit, assume all other fields to be 16-bit";
                    }
#endif
                }
                else
                {
                    // Frame B odd field has 14-bit resolution.
                    frasm_f2.odd_resolution = STC007Deinterleaver::RES_MODE_14BIT;
                    frasm_f1.odd_resolution = frasm_f1.even_resolution = frasm_f2.even_resolution = STC007Deinterleaver::RES_MODE_14BIT_AUTO;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Frame B odd field is detected as 14-bit, assume all other fields to be 14-bit";
                    }
#endif
                }
            }
            else
            {
                // Resolution detected for both fields of Frame B.
                if((f2o_res==f2e_res)&&(f2o_res==SAMPLE_RES_16BIT))
                {
                    // Both fields of Frame B have 16-bit resolution.
                    frasm_f2.odd_resolution = frasm_f2.even_resolution = STC007Deinterleaver::RES_MODE_16BIT;
                    frasm_f1.odd_resolution = frasm_f1.even_resolution = STC007Deinterleaver::RES_MODE_16BIT_AUTO;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Both fields of Frame B are detected as 16-bit, assume Frame A fields to be 16-bit";
                    }
#endif
                }
                else
                {
                    if(f2o_res==SAMPLE_RES_16BIT)
                    {
                        frasm_f2.odd_resolution = STC007Deinterleaver::RES_MODE_16BIT;
#ifdef DI_EN_DBG_OUT
                        if(suppress_log==false)
                        {
                            qInfo()<<"[L2B-007] Frame B odd field is detected as 16-bit";
                        }
#endif
                    }
                    else
                    {
                        frasm_f2.odd_resolution = STC007Deinterleaver::RES_MODE_14BIT;
#ifdef DI_EN_DBG_OUT
                        if(suppress_log==false)
                        {
                            qInfo()<<"[L2B-007] Frame B odd field is detected as 14-bit";
                        }
#endif
                    }
                    if(f2e_res==SAMPLE_RES_16BIT)
                    {
                        frasm_f2.even_resolution = STC007Deinterleaver::RES_MODE_16BIT;
#ifdef DI_EN_DBG_OUT
                        if(suppress_log==false)
                        {
                            qInfo()<<"[L2B-007] Frame B even field is detected as 16-bit";
                        }
#endif
                    }
                    else
                    {
                        frasm_f2.even_resolution = STC007Deinterleaver::RES_MODE_14BIT;
#ifdef DI_EN_DBG_OUT
                        if(suppress_log==false)
                        {
                            qInfo()<<"[L2B-007] Frame B even field is detected as 14-bit";
                        }
#endif
                    }
                    // Different or 14-bit fields of Frame B, assume 14 bits for Frame A.
                    frasm_f1.odd_resolution = frasm_f1.even_resolution = STC007Deinterleaver::RES_MODE_14BIT_AUTO;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Assume Frame A fields to be 14-bit";
                    }
#endif
                }
            }
        }
        else
        {
            if(f1o_res==SAMPLE_RES_UNKNOWN)
            {
                if(f1e_res==SAMPLE_RES_16BIT)
                {
                    frasm_f1.even_resolution = STC007Deinterleaver::RES_MODE_16BIT;
                    frasm_f1.odd_resolution = STC007Deinterleaver::RES_MODE_16BIT_AUTO;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Frame A even field is detected as 16-bit, assume Frame A odd field to be 16-bit";
                    }
#endif
                }
                else
                {
                    frasm_f1.even_resolution = STC007Deinterleaver::RES_MODE_14BIT;
                    frasm_f1.odd_resolution = STC007Deinterleaver::RES_MODE_14BIT_AUTO;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Frame A even field is detected as 14-bit, assume Frame A odd field to be 14-bit";
                    }
#endif
                }
            }
            else if(f1e_res==SAMPLE_RES_UNKNOWN)
            {
                if(f1o_res==SAMPLE_RES_16BIT)
                {
                    frasm_f1.odd_resolution = STC007Deinterleaver::RES_MODE_16BIT;
                    frasm_f1.even_resolution = STC007Deinterleaver::RES_MODE_16BIT_AUTO;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Frame A odd field is detected as 16-bit, assume Frame A even field to be 16-bit";
                    }
#endif
                }
                else
                {
                    frasm_f1.odd_resolution = STC007Deinterleaver::RES_MODE_14BIT;
                    frasm_f1.even_resolution = STC007Deinterleaver::RES_MODE_14BIT_AUTO;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Frame A odd field is detected as 14-bit, assume Frame A even field to be 14-bit";
                    }
#endif
                }
            }
            else
            {
                if(f1o_res==SAMPLE_RES_16BIT)
                {
                    frasm_f1.odd_resolution = STC007Deinterleaver::RES_MODE_16BIT;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Frame A odd field is detected as 16-bit";
                    }
#endif
                }
                else
                {
                    frasm_f1.odd_resolution = STC007Deinterleaver::RES_MODE_14BIT;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Frame A odd field is detected as 14-bit";
                    }
#endif
                }
                if(f1e_res==SAMPLE_RES_16BIT)
                {
                    frasm_f1.even_resolution = STC007Deinterleaver::RES_MODE_16BIT;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Frame A even field is detected as 16-bit";
                    }
#endif
                }
                else
                {
                    frasm_f1.even_resolution = STC007Deinterleaver::RES_MODE_14BIT;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Frame A even field is detected as 14-bit";
                    }
#endif
                }
            }
            if((f2o_res==SAMPLE_RES_UNKNOWN)&&(f2e_res==SAMPLE_RES_UNKNOWN))
            {
                // No resolution data for both fields of Frame B.
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[L2B-007] No resolution data on both fields of Frame B";
                }
#endif
                // Get stats on resolution.
                f2o_res = getProbableResolution();
                if(f2o_res==SAMPLE_RES_16BIT)
                {
                    // 16-bit by stats.
                    frasm_f2.odd_resolution = frasm_f2.even_resolution = STC007Deinterleaver::RES_MODE_16BIT_AUTO;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Both fields of Frame B are assumed to be 16-bit by stats";
                    }
#endif
                }
                else
                {
                    // If 14-bit or unknown by stats, assume 14-bit.
                    frasm_f2.odd_resolution = frasm_f2.even_resolution = STC007Deinterleaver::RES_MODE_14BIT_AUTO;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Both fields of Frame B are assumed to be 14-bit by stats";
                    }
#endif
                }
            }
            else if(f2o_res==SAMPLE_RES_UNKNOWN)
            {
                if(f2e_res==SAMPLE_RES_16BIT)
                {
                    frasm_f2.even_resolution = STC007Deinterleaver::RES_MODE_16BIT;
                    frasm_f2.odd_resolution = STC007Deinterleaver::RES_MODE_16BIT_AUTO;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Frame B even field is detected as 16-bit, assume Frame B odd field to be 16-bit";
                    }
#endif
                }
                else
                {
                    frasm_f2.even_resolution = STC007Deinterleaver::RES_MODE_14BIT;
                    frasm_f2.odd_resolution = STC007Deinterleaver::RES_MODE_14BIT_AUTO;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Frame B even field is detected as 14-bit, assume Frame B odd field to be 14-bit";
                    }
#endif
                }
            }
            else if(f2e_res==SAMPLE_RES_UNKNOWN)
            {
                if(f2o_res==SAMPLE_RES_16BIT)
                {
                    frasm_f2.odd_resolution = STC007Deinterleaver::RES_MODE_16BIT;
                    frasm_f2.even_resolution = STC007Deinterleaver::RES_MODE_16BIT_AUTO;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Frame B odd field is detected as 16-bit, assume Frame B even field to be 16-bit";
                    }
#endif
                }
                else
                {
                    frasm_f2.odd_resolution = STC007Deinterleaver::RES_MODE_14BIT;
                    frasm_f2.even_resolution = STC007Deinterleaver::RES_MODE_14BIT_AUTO;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Frame B odd field is detected as 14-bit, assume Frame B even field to be 14-bit";
                    }
#endif
                }
            }
            else
            {
                if(f2o_res==SAMPLE_RES_16BIT)
                {
                    frasm_f2.odd_resolution = STC007Deinterleaver::RES_MODE_16BIT;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Frame B odd field is detected as 16-bit";
                    }
#endif
                }
                else
                {
                    frasm_f2.odd_resolution = STC007Deinterleaver::RES_MODE_14BIT;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Frame B odd field is detected as 14-bit";
                    }
#endif
                }
                if(f2e_res==SAMPLE_RES_16BIT)
                {
                    frasm_f2.even_resolution = STC007Deinterleaver::RES_MODE_16BIT;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Frame B even field is detected as 16-bit";
                    }
#endif
                }
                else
                {
                    frasm_f2.even_resolution = STC007Deinterleaver::RES_MODE_14BIT;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Frame B even field is detected as 14-bit";
                    }
#endif
                }
            }
        }
    }
    else
    {
        // M2 sample mode based on 14-bit words.
#ifdef DI_EN_DBG_OUT
        if(suppress_log==false)
        {
            qInfo()<<"[L2B-007] Both fields of Frame A are set to be 14-bit by M2 sample mode";
            qInfo()<<"[L2B-007] Both fields of Frame B are set to be 14-bit by M2 sample mode";
        }
#endif
        frasm_f1.odd_resolution = frasm_f1.even_resolution = STC007Deinterleaver::RES_MODE_14BIT;
        frasm_f2.odd_resolution = frasm_f2.even_resolution = STC007Deinterleaver::RES_MODE_14BIT;
    }

#ifdef DI_EN_DBG_OUT
    if(suppress_log==false)
    {
        QString log_line;
        qInfo()<<"[L2B-007] Summary:";
        log_line = "[L2B-007] Frame A ("+QString::number(frasm_f1.frame_number)+") odd lines: "+QString::number(frasm_f1.odd_data_lines);
        if(frasm_f1.odd_resolution==STC007Deinterleaver::RES_MODE_14BIT)
        {
            log_line += ", 14-bit";
            if(mode_m2!=false)
            {
                log_line += " (for M2 samples)";
            }
        }
        else if(frasm_f1.odd_resolution==STC007Deinterleaver::RES_MODE_16BIT)
        {
            log_line += ", 16-bit";
        }
        else if(frasm_f1.odd_resolution==STC007Deinterleaver::RES_MODE_14BIT_AUTO)
        {
            log_line += ", 14-bit (assumed)";
        }
        else if(frasm_f1.odd_resolution==STC007Deinterleaver::RES_MODE_16BIT_AUTO)
        {
            log_line += ", 16-bit (assumed)";
        }
        else
        {
            log_line += ", resolution UNKNOWN";
        }
        qInfo()<<log_line;
        log_line = "[L2B-007] Frame A ("+QString::number(frasm_f1.frame_number)+") even lines: "+QString::number(frasm_f1.even_data_lines);
        if(frasm_f1.even_resolution==STC007Deinterleaver::RES_MODE_14BIT)
        {
            log_line += ", 14-bit";
            if(mode_m2!=false)
            {
                log_line += " (for M2 samples)";
            }
        }
        else if(frasm_f1.even_resolution==STC007Deinterleaver::RES_MODE_16BIT)
        {
            log_line += ", 16-bit";
        }
        else if(frasm_f1.even_resolution==STC007Deinterleaver::RES_MODE_14BIT_AUTO)
        {
            log_line += ", 14-bit (assumed)";
        }
        else if(frasm_f1.even_resolution==STC007Deinterleaver::RES_MODE_16BIT_AUTO)
        {
            log_line += ", 16-bit (assumed)";
        }
        else
        {
            log_line += ", resolution UNKNOWN";
        }
        qInfo()<<log_line;
        log_line = "[L2B-007] Frame B ("+QString::number(frasm_f2.frame_number)+") odd lines: "+QString::number(frasm_f2.odd_data_lines);
        if(frasm_f2.odd_resolution==STC007Deinterleaver::RES_MODE_14BIT)
        {
            log_line += ", 14-bit";
            if(mode_m2!=false)
            {
                log_line += " (for M2 samples)";
            }
        }
        else if(frasm_f2.odd_resolution==STC007Deinterleaver::RES_MODE_16BIT)
        {
            log_line += ", 16-bit";
        }
        else if(frasm_f2.odd_resolution==STC007Deinterleaver::RES_MODE_14BIT_AUTO)
        {
            log_line += ", 14-bit (assumed)";
        }
        else if(frasm_f2.odd_resolution==STC007Deinterleaver::RES_MODE_16BIT_AUTO)
        {
            log_line += ", 16-bit (assumed)";
        }
        else
        {
            log_line += ", resolution UNKNOWN";
        }
        qInfo()<<log_line;
        log_line = "[L2B-007] Frame B ("+QString::number(frasm_f2.frame_number)+") even lines: "+QString::number(frasm_f2.even_data_lines);
        if(frasm_f2.even_resolution==STC007Deinterleaver::RES_MODE_14BIT)
        {
            log_line += ", 14-bit";
            if(mode_m2!=false)
            {
                log_line += " (for M2 samples)";
            }
        }
        else if(frasm_f2.even_resolution==STC007Deinterleaver::RES_MODE_16BIT)
        {
            log_line += ", 16-bit";
        }
        else if(frasm_f2.even_resolution==STC007Deinterleaver::RES_MODE_14BIT_AUTO)
        {
            log_line += ", 14-bit (assumed)";
        }
        else if(frasm_f2.even_resolution==STC007Deinterleaver::RES_MODE_16BIT_AUTO)
        {
            log_line += ", 16-bit (assumed)";
        }
        else
        {
            log_line += ", resolution UNKNOWN";
        }
        qInfo()<<log_line;
    }
#endif
}

