Fagear/SDVPCMdecoder/stc007datastitcher.cpp
//------------------------ Detect video standard for frame re-assembling.
// Input:
//  Number of data lines per field from [frasm_f1] and [frasm_f2],
//  maximum source line numbers from [f1_max_line] and [f2_max_line].
// Updates:
//  [frasm_f1] and [frasm_f2] fields [video_standard], [vid_std_preset], [field_order], [order_preset] and [order_guessed].
// Returns:
//  Nothing.
void STC007DataStitcher::detectVideoStandard()
{
    bool suppress_log;

    suppress_log = !(((log_level&LOG_PADDING)!=0)||((log_level&LOG_PROCESS)!=0));

#ifdef DI_EN_DBG_OUT
    if(suppress_log==false)
    {
        qInfo()<<"[L2B-007] -------------------- Video standard detection starting...";
    }
#endif

    frasm_f1.video_standard = FrameAsmDescriptor::VID_UNKNOWN;
    frasm_f1.odd_std_lines = frasm_f1.even_std_lines = 0;
    // Check if video standard is preset.
    if(preset_video_mode==FrameAsmDescriptor::VID_UNKNOWN)
    {
        // Video standard is not preset externally.
        frasm_f1.vid_std_preset = false;
        // Next check count of lines with some data in the fields.
        // Note that count may increase above normal due to noise interpreted as PCM with bad CRC.
        // Check if at least one field contains more lines that PAL field could.
        if((frasm_f1.odd_data_lines>LINES_PF_MAX_PAL)||(frasm_f1.even_data_lines>LINES_PF_MAX_PAL)||(frasm_f2.odd_data_lines>LINES_PF_MAX_PAL)||(frasm_f2.even_data_lines>LINES_PF_MAX_PAL))
        {
            // Too many lines with PCM for PAL video.
            frasm_f1.video_standard = FrameAsmDescriptor::VID_UNKNOWN;
#ifdef DI_EN_DBG_OUT
            if(suppress_log==false)
            {
                qInfo()<<"[L2B-007] Unknown video standard (too many lines for PAL)";
            }
#endif
        }
        // Check if at least one field contains more lines that NTSC field could.
        else if((frasm_f1.odd_data_lines>LINES_PF_MAX_NTSC)||(frasm_f1.even_data_lines>LINES_PF_MAX_NTSC)||(frasm_f2.odd_data_lines>LINES_PF_MAX_NTSC)||(frasm_f2.even_data_lines>LINES_PF_MAX_NTSC))
        {
            // Too many lines with PCM for NTSC video, but should fit PAL.
            frasm_f1.video_standard = FrameAsmDescriptor::VID_PAL;
#ifdef DI_EN_DBG_OUT
            if(suppress_log==false)
            {
                qInfo()<<"[L2B-007] Seems to be PAL video (by PCM lines)";
            }
#endif
        }
        else
        {
            // Can not determine between PAL and NTSC by actual PCM line count, try determining by source line number.
            if(f1_max_line<=((LINES_PF_PAL-STC007DataBlock::INTERLEAVE_OFS)*2))
            {
                frasm_f1.video_standard = FrameAsmDescriptor::VID_NTSC;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[L2B-007] Seems to be NTSC video (by frame lines)";
                }
#endif
            }
            else
            {
                frasm_f1.video_standard = FrameAsmDescriptor::VID_PAL;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[L2B-007] Seems to be PAL video (by frame lines ="<<f1_max_line<<")";
                }
#endif
            }
        }
    }
    else
    {
        // Go with externally preset standard.
        frasm_f1.vid_std_preset = true;
        // Save video standard in Frame A trim data.
        frasm_f1.video_standard = preset_video_mode;
#ifdef DI_EN_DBG_OUT
        if(suppress_log==false)
        {
            if(frasm_f1.video_standard==FrameAsmDescriptor::VID_NTSC)
            {
                qInfo()<<"[L2B-007] Video standard preset to: NTSC";
            }
            else if(frasm_f1.video_standard==FrameAsmDescriptor::VID_PAL)
            {
                qInfo()<<"[L2B-007] Video standard preset to: PAL";
            }
            else
            {
                qWarning()<<DBG_ANCHOR<<"[L2B-007] Video standard is not preset: error!";
            }
        }
#endif
    }
    // Check if video standard was set correctly.
    if(frasm_f1.video_standard==FrameAsmDescriptor::VID_UNKNOWN)
    {
        // Try to assume by the previous frame.
        frasm_f1.video_standard = frasm_f0.video_standard;
    }

    // Set number of target/standard lines by the video standard.
    if(frasm_f1.video_standard==FrameAsmDescriptor::VID_NTSC)
    {
        // Both fields to NTSC line count.
        frasm_f1.odd_std_lines = frasm_f1.even_std_lines = LINES_PF_NTSC;
    }
    else if(frasm_f1.video_standard==FrameAsmDescriptor::VID_PAL)
    {
        // Both fields to PAL line count.
        frasm_f1.odd_std_lines = frasm_f1.even_std_lines = LINES_PF_PAL;
    }

    // Preset field order for Frame A and Frame B if required.
    if(preset_field_order==FrameAsmDescriptor::ORDER_TFF)
    {
        // Preset TFF for Frame A and Frame B.
        frasm_f1.presetTFF();
        frasm_f2.presetTFF();
#ifdef DI_EN_DBG_OUT
        if(suppress_log==false)
        {
            qInfo()<<"[L2B-007] Field order preset to: TFF";
        }
#endif
    }
    else if(preset_field_order==FrameAsmDescriptor::ORDER_BFF)
    {
        // Preset BFF for Frame A and Frame B.
        frasm_f1.presetBFF();
        frasm_f2.presetBFF();
#ifdef DI_EN_DBG_OUT
        if(suppress_log==false)
        {
            qInfo()<<"[L2B-007] Field order preset to: BFF";
        }
#endif
    }
    else
    {
        // Field order is not preset.
        // Clear field order data for Frame B.
        frasm_f2.presetOrderClear();
        frasm_f2.setOrderUnknown();
#ifdef DI_EN_DBG_OUT
        if(suppress_log==false)
        {
            qInfo()<<"[L2B-007] Field order is not preset";
        }
#endif
    }
}

//------------------------ Find a way to stitch next 4 fields together,
//------------------------ detect audio resolution (per field), detect video standard, detect field order and padding.
uint8_t STC007DataStitcher::findFieldStitching()
{
    bool suppress_log, suppress_anylog, en_sw_order;
    uint8_t proc_state, stage_count, stitch_resolution, f_res;

