Fagear/SDVPCMdecoder/stc007datastitcher.cpp
    suppress_log = !(((log_level&LOG_PADDING)!=0)||((log_level&LOG_PROCESS)!=0));
    suppress_anylog = !(((log_level&LOG_PADDING)!=0)&&((log_level&LOG_PROCESS)!=0));

    QElapsedTimer dbg_timer;
    dbg_timer.start();

    // Try to detect audio resolution in the fields.
    detectAudioResolution();

    // Try to detect video standard (number of PCM lines in the frame) and set field order.
    detectVideoStandard();

    // Set first stage.
    proc_state = STG_TRY_PREVIOUS;

    dbg_timer.start();

#ifdef DI_EN_DBG_OUT
    if(suppress_log==false)
    {
        qInfo()<<"[L2B-007] -------------------- Padding detection starting...";
    }
#endif
    // Now let's try to detect padding.
    en_sw_order = true;
    stage_count = 0;
    stitch_resolution = STC007DataBlock::RES_14BIT;
    do
    {
        // Count loops.
        stage_count++;

        //qDebug()<<"[DI] State #"<<proc_state;
        dbg_timer.start();

//------------------------ Try to perform the same stitching as on frame before to speed up the process.
        if(proc_state==STG_TRY_PREVIOUS)
        {
            // Preset "go full processing" state.
            proc_state = STG_A_PREPARE;
            // Check trim data (previous frame has the same line count per frame and valid padding).
            if((frasm_f0.odd_data_lines==frasm_f1.odd_data_lines)&&(frasm_f0.even_data_lines==frasm_f1.even_data_lines)
                &&(frasm_f0.inner_padding_ok!=false)&&(frasm_f0.outer_padding_ok!=false))
            {
                // Check if Frame A field order is preset externally in [detectVideoStandard()]
                // and if preset order is the same as for previous frame with valid padding.
                if((frasm_f1.isOrderPreset()==false)||(frasm_f0.field_order==frasm_f1.field_order))
                {
                    // Reset frame trim data.
                    frasm_f1.inner_silence = frasm_f1.outer_silence = frasm_f2.inner_silence = frasm_f2.outer_silence = true;
                    //frasm_f2.setOrderUnknown();
                    frasm_f2.inner_padding_ok = frasm_f2.outer_padding_ok = false;
                    frasm_f2.inner_padding = frasm_f2.outer_padding = 0;
                    // Check if there is enough data in fields of Frame A.
                    if((frasm_f1.odd_data_lines<MIN_FILL_LINES_PF)&&(frasm_f1.even_data_lines<MIN_FILL_LINES_PF))
                    {
                        // Not enough usefull lines, it will be impossible to compile data blocks.
                        // Unable to detect Frame A field padding and A-B padding.
                        frasm_f1.setOrderUnknown();
                        frasm_f1.inner_padding_ok = frasm_f1.outer_padding_ok = false;
                        frasm_f1.inner_padding = frasm_f1.outer_padding = 0;
#ifdef DI_EN_DBG_OUT
                        if(suppress_anylog==false)
                        {
                            qInfo()<<"[L2B-007](EASY) Not enough usefull lines in Frame A, padding unknown, skipping...";
                        }
#endif
                        // Nothing usefull can be done with Frame A.
                        proc_state = STG_PAD_NO_GOOD;
                    }
                    else
                    {
                        // Preset "bad" result of padding.
                        f_res = DS_RET_NO_PAD;
                        // Try to make frame field stitching, using previous data.
                        if(frasm_f0.isOrderTFF()!=false)
                        {
                            // Previous frame was stitched using TFF field order.
#ifdef DI_EN_DBG_OUT
                            if(suppress_anylog==false)
                            {
                                qInfo()<<"[L2B-007](EASY) Try to stitch Frame A fields in TFF order using padding"<<frasm_f0.inner_padding;
                            }
#endif
                            // Try to stitch Frame A in the same way.
                            f_res = tryPadding(&frame1_odd, frasm_f1.odd_data_lines, &frame1_even, frasm_f1.even_data_lines, frasm_f0.inner_padding);
                        }
                        else if(frasm_f0.isOrderBFF()!=false)
                        {
                            // Previous frame was stitched using BFF field order.
#ifdef DI_EN_DBG_OUT
                            if(suppress_anylog==false)
                            {
                                qInfo()<<"[L2B-007](EASY) Try to stitch Frame A fields in BFF order using padding"<<frasm_f0.inner_padding;
                            }
#endif
                            // Try to stitch Frame A in the same way.
                            f_res = tryPadding(&frame1_even, frasm_f1.even_data_lines, &frame1_odd, frasm_f1.odd_data_lines, frasm_f0.inner_padding);
                        }
#ifdef DI_EN_DBG_OUT
                        else
                        {
                            // Somehow field order was not set for previous frame... should not happen.
                            if(suppress_anylog==false)
                            {
                                qInfo()<<"[L2B-007](EASY) Previous frame has bad stitching, unable to stitch current one!";
                            }
                        }
#endif
                        // If frame field stitching is ok...
                        if(f_res==DS_RET_OK)
                        {
                            // Save current frame stitching info.
                            frasm_f1.updateVidStdSoft(frasm_f0.video_standard);
                            frasm_f1.field_order = frasm_f0.field_order;
                            frasm_f1.inner_padding = frasm_f0.inner_padding;
                            frasm_f1.inner_padding_ok = true;
                            // Preset "no silence" for padding.
                            frasm_f1.inner_silence = false;
                            // Try to get interframe stitching.
                            if(frasm_f1.isOrderTFF()!=false)
                            {
                                // Save counter for TFF.
                                frasm_f1.tff_cnt = last_pad_counter;
#ifdef DI_EN_DBG_OUT
                                if(suppress_anylog==false)
                                {
                                    qInfo()<<"[L2B-007](EASY) Frame A field order: TFF, inner padding:"<<frasm_f1.inner_padding;
                                }
#endif
                                proc_state = STG_TRY_TFF_TO_TFF;
                            }
                            else
                            {
                                // Save counter for BFF.
                                frasm_f1.bff_cnt = last_pad_counter;
#ifdef DI_EN_DBG_OUT
                                if(suppress_anylog==false)
                                {
                                    qInfo()<<"[L2B-007](EASY) Frame A field order: BFF, inner padding:"<<frasm_f1.inner_padding;
                                }
#endif
                                proc_state = STG_TRY_BFF_TO_BFF;
                            }
                        }
#ifdef DI_EN_DBG_OUT
                        else
                        {
                            // Failed to stitch fields by previous frame settings, skip easy stitching (mode is preset above).
                            if(suppress_anylog==false)
                            {
                                qInfo()<<"[L2B-007](EASY) Failed to stitch in easy-mode (by previous frame). Switching to hard-mode stitching...";
                            }
                        }
#endif
                    }
                }
#ifdef DI_EN_DBG_OUT
                else
                {
                    // Previous frame stitching was for different field order than preset for Frame A.
                    // Skip easy stitching (mode is preset above).
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007](EASY) Previous frame was stitched with different field order than preset, going hard-mode stitching...";
                    }
                }
#endif
            }
#ifdef DI_EN_DBG_OUT
            else
            {
                // Frame trim data mismatch, skip easy stitching (mode is preset above).
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007](EASY) Previous frame trimming is invalid for easy-mode, going hard-mode stitching...";
                }
            }
#endif
        }
//------------------------ EASY stitching on inter-frame padding is done, try to EASY stitch frame A to B (TFF).
        else if(proc_state==STG_TRY_TFF_TO_TFF)
        {
            // Preset "bad" result.
            f_res = DS_RET_NO_PAD;
            if(frasm_f2.odd_data_lines>=MIN_FILL_LINES_PF)
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007](EASY) Try to stitch frames A-B, assuming TFF-TFF and using padding"<<frasm_f0.outer_padding;
                }
#endif
                f_res = tryPadding(&frame1_even, frasm_f1.even_data_lines, &frame2_odd, frasm_f2.odd_data_lines, frasm_f0.outer_padding);
            }
#ifdef DI_EN_DBG_OUT
            else
            {
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007](EASY) Not enough usefull lines in odd field of Frame B.";
                }
            }
#endif
            // If frame field stitching is ok...
            if(f_res==DS_RET_OK)
            {
                // Save current frame stitching info.
                frasm_f1.outer_padding = frasm_f0.outer_padding;
                frasm_f1.outer_padding_ok = true;
                frasm_f2.setOrderTFF();
                // Preset "no silence" for padding.
                frasm_f1.outer_silence = false;
                // Save video mode.
                //updateVideoStandard(frasm_f1.video_standard);
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007](EASY) Frames A-B TFF-TFF padding:"<<frasm_f1.outer_padding;
                }
#endif
                // Work is done.
                proc_state = STG_PAD_OK;
            }
            else
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007](EASY) Unable to get A-B stitching in easy-mode (by previous frame). Switching to hard-mode stitching...";
                }
#endif
                proc_state = STG_AB_TFF_TO_TFF;
                // Deny switching to another field combination.
                en_sw_order = false;
            }
        }
//------------------------ EASY stitching on inter-frame padding is done, try to EASY stitch frame A to B (BFF).
        else if(proc_state==STG_TRY_BFF_TO_BFF)
        {
            // Preset "bad" result.
            f_res = DS_RET_NO_PAD;
            if(frasm_f2.even_data_lines>=MIN_FILL_LINES_PF)
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007](EASY) Try to stitch frames A-B, assuming BFF-BFF and using padding"<<frasm_f0.outer_padding;
                }
#endif
                f_res = tryPadding(&frame1_odd, frasm_f1.odd_data_lines, &frame2_even, frasm_f2.even_data_lines, frasm_f0.outer_padding);
            }
#ifdef DI_EN_DBG_OUT
            else
            {
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007](EASY) Not enough usefull lines in even field of Frame B.";
                }
            }
#endif
            // If frame field stitching is ok...
            if(f_res==DS_RET_OK)
            {
                // Save current frame stitching info.
                frasm_f1.outer_padding = frasm_f0.outer_padding;
                frasm_f1.outer_padding_ok = true;
                frasm_f2.setOrderBFF();
                // Preset "no silence" for padding.
                frasm_f1.outer_silence = false;
                // Save video mode.
                //updateVideoStandard(frasm_f1.video_standard);
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007](EASY) Frames A-B BFF-BFF padding:"<<frasm_f1.outer_padding;
                }
#endif
                // Work is done.
                proc_state = STG_PAD_OK;
            }
            else
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007](EASY) Unable to get A-B stitching in easy-mode (by previous frame). Switching to hard-mode stitching...";
                }
#endif
                proc_state = STG_AB_BFF_TO_BFF;
                // Deny switching to another combination.
                en_sw_order = false;
            }
        }
//------------------------ Prepare normal (full) Frame A padding.
        else if(proc_state==STG_A_PREPARE)
        {
            frasm_f1.inner_padding_ok = frasm_f1.outer_padding_ok = false;
            frasm_f1.inner_padding = frasm_f1.outer_padding = 0;
            frasm_f1.tff_cnt = frasm_f1.bff_cnt = 0;
            // Check if there is enough data in fields of Frame A.
            if((frasm_f1.odd_data_lines<MIN_FILL_LINES_PF)&&(frasm_f1.even_data_lines<MIN_FILL_LINES_PF))
            {
                // Not enough usefull lines, it will be impossible to compile data blocks.
                // Unable to detect Frame A field padding and A-B padding.
                if(frasm_f1.isOrderPreset()==false)
                {
                    frasm_f1.setOrderUnknown();
                }
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007] Not enough usefull lines in Frame A, padding unknown, skipping...";
                }
#endif
                // Nothing usefull can be done with Frame A.
                proc_state = STG_PAD_NO_GOOD;
            }
            else if(frasm_f1.even_data_lines<MIN_FILL_LINES_PF)
            {
                // Not enough usefull lines in even field.
                // Unable to detect Frame A field padding,
                // but maybe A-B will work...
                // Check if frame was already successfully stitched with previous one by odd field.
                if(frasm_f1.isOrderTFF()!=false)
                {
                    // Odd field was already set to be stitched with previous frame, unable to make it 'second' field.
                    frasm_f1.outer_padding_ok = false;
                    frasm_f1.outer_padding = 0;
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Not enough usefull lines in even field of Frame A, but odd field was already stitched, skipping...";
                    }
#endif
                    // Nothing usefull can be done with Frame A.
                    proc_state = STG_PAD_NO_GOOD;
                }
                else
                {
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Not enough usefull lines in even field of Frame A, try to detect A-B BFF-BFF...";
                    }
#endif
                    // Try to detect A-B padding, assuming Frame A and Frame B both BFF.
                    proc_state = STG_AB_BFF_TO_BFF;
                    // Deny switching to another combination.
                    en_sw_order = false;
                }
            }
            else if(frasm_f1.odd_data_lines<MIN_FILL_LINES_PF)
            {
                // Not enough usefull lines in odd field.
                // Unable to detect Frame A field padding,
                // but maybe A-B will work...
                //frasm_f1.inner_padding = 0;
                //frasm_f1.inner_padding_ok = false;
                // Check if frame was already successfully stitched with previous one by even field.
                if(frasm_f1.isOrderBFF()!=false)
                {
                    // Even field was already set to be stitched with previous frame, unable to make it 'second' field.
                    frasm_f1.outer_padding_ok = false;
                    frasm_f1.outer_padding = 0;
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Not enough usefull lines in odd field of Frame A, but even field was already stitched, skipping...";
                    }
#endif
                    // Nothing usefull can be done with Frame A, check "next Frame A".
                    proc_state = STG_PAD_NO_GOOD;
                }
                else
                {
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Not enough usefull lines in odd field of Frame A, try to detect A-B TFF-TFF...";
                    }
#endif
                    // Try to detect A-B padding, assuming Frame A and Frame B both TFF.
                    proc_state = STG_AB_TFF_TO_TFF;
                    // Deny switching to another combination.
                    en_sw_order = false;
                }
            }
            else
            {
                // There are enough lines in Frame A.
                // Check if frame was already successfully stitched with previous one.
                if(frasm_f1.isOrderBFF()!=false)
                {
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Frame A field order preset to BFF, try to detect field padding...";
                    }
#endif
                    // Try to detect Frame A field padding, with BFF order.
                    proc_state = STG_A_PAD_BFF;
                    // Deny switching to another field combination.
                    en_sw_order = false;
                }
                else if(frasm_f1.isOrderTFF()!=false)
                {
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Frame A field order preset to TFF, try to detect field padding...";
                    }
#endif
                    // Try to detect Frame A field padding, with TFF order.
                    proc_state = STG_A_PAD_TFF;
                    // Deny switching to another field combination.
                    en_sw_order = false;
                }
                else
                {
                    // No stitching with previous frame.
                    // Guesstimate starting field order.
                    f_res = getProbableFieldOrder();
                    if(f_res==FrameAsmDescriptor::ORDER_TFF)
                    {
#ifdef DI_EN_DBG_OUT
                        if(suppress_anylog==false)
                        {
                            qInfo()<<"[L2B-007] Frame A field order is not preset, but stats says TFF...";
                        }
#endif
                        proc_state = STG_A_PAD_TFF;
                    }
                    else if(f_res==FrameAsmDescriptor::ORDER_BFF)
                    {
#ifdef DI_EN_DBG_OUT
                        if(suppress_anylog==false)
                        {
                            qInfo()<<"[L2B-007] Frame A field order is not preset, but stats says BFF...";
                        }
#endif
                        proc_state = STG_A_PAD_BFF;
                    }
                    else
                    {
#ifdef DI_EN_DBG_OUT
                        if(suppress_anylog==false)
                        {
                            qInfo()<<"[L2B-007] Frame A field order is not preset, defaulting to TFF...";
                        }
#endif
                        proc_state = STG_A_PAD_TFF;
                    }
                    // Allow switching to another field combination.
                    en_sw_order = true;
                }
            }
        }
//------------------------ Process Frame A padding (TFF).
        else if(proc_state==STG_A_PAD_TFF)
        {
            // Try to detect Frame A field padding, assuming TFF order.
#ifdef DI_EN_DBG_OUT
            if(suppress_anylog==false)
            {
                qInfo()<<"[L2B-007] Try to detect Frame A field padding assuming TFF...";
            }
#endif
            // Reset padding.
            frasm_f1.inner_padding = 0;
            // Get resolution for the seam.
            stitch_resolution = getResolutionForSeam(frasm_f1.odd_resolution, frasm_f1.even_resolution);

            // TODO: find new way to determine seam resolution.
            //f_res = findPadding(&frame1_odd, frasm_f1.odd_data_lines, &frame1_even, frasm_f1.even_data_lines, guess_vid, STC007DataBlock::RES_14BIT, &(frasm_f1.inner_padding));
            //f_res = findPadding(&frame1_odd, frasm_f1.odd_data_lines, &frame1_even, frasm_f1.even_data_lines, guess_vid, STC007DataBlock::RES_16BIT, &(frasm_f1.inner_padding));

