Fagear/SDVPCMdecoder/stc007datastitcher.cpp
            // Get padding result.
            f_res = findPadding(&frame1_odd, frasm_f1.odd_data_lines, &frame1_even, frasm_f1.even_data_lines, frasm_f1.video_standard, stitch_resolution, &(frasm_f1.inner_padding));
            // Save counter for TFF.
            frasm_f1.tff_cnt = last_pad_counter;
            // Preset "no silence" for padding.
            frasm_f1.inner_silence = false;
            if(f_res==DS_RET_OK)
            {
                // Padding detected successfully.
                frasm_f1.setOrderTFF();
                frasm_f1.inner_padding_ok = true;
                // Save video mode.
                //updateVideoStandard(guess_vid);
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007] Frame A field order: TFF, inner padding:"<<frasm_f1.inner_padding;
                }
#endif
                // Try to detect A-B padding, assuming the same TFF order.
                proc_state = STG_AB_TFF_TO_TFF;
                // Deny switching to another combination.
                en_sw_order = false;
            }
            else if(f_res==DS_RET_SILENCE)
            {
                // Can not detect padding due to silence, need to try later.
                frasm_f1.inner_silence = true;
                frasm_f1.outer_silence = true;
                frasm_f1.inner_padding_ok = false;
                frasm_f1.inner_padding = 0;
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007] Unable to detect inner padding and field order of Frame A due to silence";
                }
#endif
                // Nothing usefull can be done with Frame A.
                proc_state = STG_PAD_SILENCE;
            }
            else
            {
                frasm_f1.inner_padding = 0;
                // Check if frame was already successfully stitched with previous one in TFF mode.
                if(frasm_f1.isOrderTFF()!=false)
                {
                    // Frame A is preset to be TFF, can not try to stitch in BFF mode, field padding not found.
                    frasm_f1.inner_padding_ok = false;
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Failed to find field padding for Frame A, but field order preset to TFF, try to detect A-B TFF-TFF...";
                    }
#endif
                    // Try to detect A-B padding, assuming the same TFF order.
                    proc_state = STG_AB_TFF_TO_TFF;
                    // Deny switching to another combination.
                    en_sw_order = false;
                }
                else if(en_sw_order!=false)
                {
                    // If not TFF, try to detect in BFF mode.
                    proc_state = STG_A_PAD_BFF;
                    // Deny switching to another combination.
                    en_sw_order = false;
                }
                else
                {
                    // Not TFF, not BFF... WTF?!
                    proc_state = STG_AB_UNK_PREPARE;
                }
            }
        }
//------------------------ Process Frame A padding (BFF).
        else if(proc_state==STG_A_PAD_BFF)
        {
            // Try to detect Frame A field padding, assuming BFF order.
#ifdef DI_EN_DBG_OUT
            if(suppress_anylog==false)
            {
                qInfo()<<"[L2B-007] Try detecting Frame A field padding assuming BFF...";
            }
#endif
            // Reset padding.
            frasm_f1.inner_padding = 0;
            // Get resolution for the seam.
            stitch_resolution = getResolutionForSeam(frasm_f1.even_resolution, frasm_f1.odd_resolution);

            // TODO: find new way to determine seam resolution.
            //f_res = findPadding(&frame1_even, frasm_f1.even_data_lines, &frame1_odd, frasm_f1.even_data_lines, guess_vid, STC007DataBlock::RES_14BIT, &(frasm_f1.inner_padding));
            //f_res = findPadding(&frame1_even, frasm_f1.even_data_lines, &frame1_odd, frasm_f1.even_data_lines, guess_vid, STC007DataBlock::RES_16BIT, &(frasm_f1.inner_padding));

            // Get padding result.
            f_res = findPadding(&frame1_even, frasm_f1.even_data_lines, &frame1_odd, frasm_f1.odd_data_lines, frasm_f1.video_standard, stitch_resolution, &(frasm_f1.inner_padding));
            // Save padding passes count for BFF.
            frasm_f1.bff_cnt = last_pad_counter;
            // Preset "no silence" for padding.
            frasm_f1.inner_silence = false;
            if(f_res==DS_RET_OK)
            {
                // Padding detected successfully.
                frasm_f1.setOrderBFF();
                frasm_f1.inner_padding_ok = true;
                // Save video mode.
                //updateVideoStandard(guess_vid);
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007] Frame A field order: BFF, inner padding:"<<frasm_f1.inner_padding;
                }
#endif
                // Try to detect A-B padding, assuming same BFF order.
                proc_state = STG_AB_BFF_TO_BFF;
                // Deny switching to another combination.
                en_sw_order = false;
            }
            else if(f_res==DS_RET_SILENCE)
            {
                // Can not detect padding due to silence, need to try later.
                frasm_f1.inner_silence = true;
                frasm_f1.outer_silence = true;
                frasm_f1.inner_padding_ok = false;
                frasm_f1.inner_padding = 0;
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007] Unable to detect padding and field order of Frame A due to silence";
                }
#endif
                // Nothing usefull can be done with Frame A.
                proc_state = STG_PAD_SILENCE;
            }
            else
            {
                frasm_f1.inner_padding = 0;
                // Check if frame was already successfully stitched with previous one in BFF mode.
                if(frasm_f1.isOrderBFF()!=false)
                {
                    // Frame A is preset to be BFF, can not try to stitch in TFF mode, field padding not found.
                    frasm_f1.inner_padding_ok = false;
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Failed to find field padding for Frame A, but field order preset to BFF, try to detect A-B BFF-BFF...";
                    }
#endif
                    // Try to detect A-B padding, assuming same BFF order.
                    proc_state = STG_AB_BFF_TO_BFF;
                    // Deny switching to another combination.
                    en_sw_order = false;
                }
                else if(en_sw_order!=false)
                {
                    // If not BFF, try to detect in TFF mode.
                    proc_state = STG_A_PAD_TFF;
                    // Deny switching to another combination.
                    en_sw_order = false;
                }
                else
                {
                    // Not TFF, not BFF... WTF?!
                    proc_state = STG_AB_UNK_PREPARE;
                }
            }
        }
//------------------------ No valid inter-frame Frame A stitching, try A-B stitching.
        else if(proc_state==STG_AB_UNK_PREPARE)
        {
            // Frame A padding is not detected, still try to detect A-B padding.
            frasm_f1.inner_padding = 0;
            frasm_f1.inner_padding_ok = false;
            frasm_f1.setOrderUnknown();
            // Try to detect Frame A field padding from last good stats.
            f_res = getProbableFieldOrder();
            if(f_res==FrameAsmDescriptor::ORDER_TFF)
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007] Can not detect padding for Frame A, assume TFF by stats.";
                }
#endif
                // Still try to stitch frames, start from TFF-TFF.
                proc_state = STG_AB_TFF_TO_TFF;
                // Allow switching to another combination.
                en_sw_order = true;
            }
            else if(f_res==FrameAsmDescriptor::ORDER_BFF)
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007] Can not detect padding for Frame A, assume BFF by stats.";
                }
#endif
                // Still try to stitch frames, start from BFF-BFF.
                proc_state = STG_AB_BFF_TO_BFF;
                // Allow switching to another combination.
                en_sw_order = true;
            }
            else
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007] Can not detect padding for Frame A, assume TFF...";
                }
#endif
                // Still try to stitch frames, start from TFF-TFF.
                proc_state = STG_AB_TFF_TO_TFF;
                // Allow switching to another combination.
                en_sw_order = true;
            }
        }
//------------------------ Processing A-B padding (TFF to TFF).
        else if(proc_state==STG_AB_TFF_TO_TFF)
        {
            // Check if Frame B has enough usefull lines to stitch.
            if((frasm_f2.odd_data_lines<MIN_FILL_LINES_PF)&&(frasm_f2.even_data_lines<MIN_FILL_LINES_PF))
            {
                // Not enough usefull lines, it will be impossible to compile data blocks.
                // Unable to detect Frame B field padding and A-B padding.
                frasm_f1.outer_padding = 0;
                frasm_f1.outer_padding_ok = false;
                frasm_f2.inner_padding_ok = false;
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007] Not enough usefull lines in Frame B, A-B padding unknown.";
                }
#endif
                proc_state = STG_PAD_NO_GOOD;
            }
            else if(frasm_f2.odd_data_lines<MIN_FILL_LINES_PF)
            {
                // Not enough usefull lines in odd field.
                if(frasm_f1.isOrderPreset()==false)
                {
                    // Field order for Frame A and B are not preset.
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Not enough usefull lines in odd field of Frame B, try to detect A-B TFF-BFF...";
                    }
#endif
                    // Try with another field of Frame B.
                    proc_state = STG_AB_TFF_TO_BFF;
                }
                else
                {
                    // Frame A (and Frame B should be as well) order is preset to TFF,
                    // impossible to stitch with BFF order.
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Not enough usefull lines in odd field of Frame B, field order preset to TFF, padding unknown.";
                    }
#endif
                    frasm_f1.outer_padding = 0;
                    frasm_f1.outer_padding_ok = false;
                    frasm_f2.inner_padding_ok = false;
                    proc_state = STG_PAD_NO_GOOD;
                }
            }
            else
            {
                // Enough usefull lines in odd field of Frame B.
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007] Try detecting A-B padding, assuming TFF-TFF...";
                }
#endif
                // Get resolution for the seam.
                stitch_resolution = getResolutionForSeam(frasm_f1.even_resolution, frasm_f2.odd_resolution);
                // Try to detect padding between TFF-TFF frames.
                f_res = findPadding(&frame1_even, frasm_f1.even_data_lines, &frame2_odd, frasm_f2.odd_data_lines, frasm_f1.video_standard, stitch_resolution, &(frasm_f1.outer_padding));
                // Preset "no silence" for padding.
                frasm_f1.outer_silence = false;
                if(f_res==DS_RET_OK)
                {
                    // Padding detected successfully.
                    frasm_f1.outer_padding_ok = true;
                    frasm_f2.setOrderTFF();
                    // Work is done.
                    proc_state = STG_PAD_OK;
                    if(frasm_f1.isOrderSet()==false)
                    {
#ifdef DI_EN_DBG_OUT
                        if(suppress_anylog==false)
                        {
                            qInfo()<<"[L2B-007] Frames A-B TFF-TFF padding:"<<frasm_f1.outer_padding;
                        }
#endif
                        // If Frame A field order was not set yet - update it.
                        frasm_f1.setOrderTFF();
                    }
                    else if(frasm_f1.isOrderBFF()!=false)
                    {
                        // If Frame A field is set to opposite setting - invalidate A-B padding.
                        frasm_f1.outer_padding_ok = false;
                        //frasm_f2.setOrderUnknown();
#ifdef DI_EN_DBG_OUT
                        if(suppress_anylog==false)
                        {
                            qInfo()<<"[L2B-007] Frames A-B TFF-TFF padding detected, but Frame A is preset as BFF, ignoring.";
                        }
#endif
                        // Conflicting field orders.
                        proc_state = STG_PAD_NO_GOOD;
                    }
                }
                else if(f_res==DS_RET_SILENCE)
                {
                    // Can not detect padding due to silence, need to try later.
                    frasm_f1.outer_silence = true;
                    frasm_f1.outer_padding = 0;
                    frasm_f1.outer_padding_ok = false;
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Unable to detect A-B padding due to silence";
                    }
#endif
                    proc_state = STG_PAD_SILENCE;
                }
                else
                {
                    // Did not find padding between frames.
                    // Check Frame B line count.
                    if(frasm_f2.even_data_lines<MIN_FILL_LINES_PF)
                    {
                        // Not enough usefull lines in even field, impossible to detect padding.
                        frasm_f1.outer_padding = 0;
                        frasm_f1.outer_padding_ok = false;
                        frasm_f2.inner_padding_ok = false;
#ifdef DI_EN_DBG_OUT
                        if(suppress_anylog==false)
                        {
                            qInfo()<<"[L2B-007] A-B TFF-TFF didn't work. Not enough usefull lines in even field of Frame B, padding unknown.";
                        }
#endif
                        proc_state = STG_PAD_NO_GOOD;
                    }
                    else
                    {
                        // Enough usefull lines in even field of frame B.
                        if(frasm_f1.isOrderPreset()==false)
                        {
                            // Field order for Frame A and B are not preset.
#ifdef DI_EN_DBG_OUT
                            if(suppress_anylog==false)
                            {
                                qInfo()<<"[L2B-007] A-B TFF-TFF didn't work. Switching to TFF-BFF...";
                            }
#endif
                            // Try TFF - BFF.
                            proc_state = STG_AB_TFF_TO_BFF;
                        }
                        else
                        {
                            // Frame A (and Frame B should be as well) order is preset to TFF,
                            // impossible to stitch with BFF order.
#ifdef DI_EN_DBG_OUT
                            if(suppress_anylog==false)
                            {
                                qInfo()<<"[L2B-007] A-B TFF-TFF didn't work. Field order preset to TFF, padding unknown.";
                            }
#endif
                            frasm_f1.outer_padding = 0;
                            frasm_f1.outer_padding_ok = false;
                            proc_state = STG_PAD_NO_GOOD;
                        }
                    }
                }
            }
        }
//------------------------ Processing A-B padding (BFF to BFF).
        else if(proc_state==STG_AB_BFF_TO_BFF)
        {
            // Check if Frame B has enough usefull lines to stitch.
            if((frasm_f2.odd_data_lines<MIN_FILL_LINES_PF)&&(frasm_f2.even_data_lines<MIN_FILL_LINES_PF))
            {
                // Not enough usefull lines, it will be impossible to compile data blocks.
                // Unable to detect Frame B field padding and A-B padding.
                frasm_f1.outer_padding = 0;
                frasm_f1.outer_padding_ok = false;
                frasm_f2.inner_padding_ok = false;
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007] Not enough usefull lines in Frame B, A-B padding unknown.";
                }
#endif
                proc_state = STG_PAD_NO_GOOD;
            }
            else if(frasm_f2.even_data_lines<MIN_FILL_LINES_PF)
            {
                // Not enough usefull lines in even field.
                if(frasm_f1.isOrderPreset()==false)
                {
                    // Field order for Frame A and B are not preset.
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Not enough usefull lines in even field of Frame B, try to detect A-B BFF-TFF...";
                    }
#endif
                    // Try with another field of Frame B.
                    proc_state = STG_AB_BFF_TO_TFF;
                }
                else
                {
                    // Frame A (and Frame B should be as well) order is preset to BFF,
                    // impossible to stitch with TFF order.
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Not enough usefull lines in even field of Frame B, field order preset to BFF, padding unknown.";
                    }
#endif
                    frasm_f1.outer_padding = 0;
                    frasm_f1.outer_padding_ok = false;
                    frasm_f2.inner_padding_ok = false;
                    proc_state = STG_PAD_NO_GOOD;
                }
            }
            else
            {
                // Enough usefull lines in even field of frame B.
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007] Try detecting A-B padding, assuming BFF-BFF...";
                }
#endif
                // Get resolution for the seam.
                stitch_resolution = getResolutionForSeam(frasm_f1.odd_resolution, frasm_f2.even_resolution);
                // Try to detect padding between BFF-BFF frames.
                f_res = findPadding(&frame1_odd, frasm_f1.odd_data_lines, &frame2_even, frasm_f2.even_data_lines, frasm_f1.video_standard, stitch_resolution, &(frasm_f1.outer_padding));
                // Preset "no silence" for padding.
                frasm_f1.outer_silence = false;
                if(f_res==DS_RET_OK)
                {
                    // Padding detected successfully.
                    frasm_f1.outer_padding_ok = true;
                    frasm_f2.setOrderBFF();
                    // Work is done.
                    proc_state = STG_PAD_OK;
                    if(frasm_f1.isOrderSet()==false)
                    {
#ifdef DI_EN_DBG_OUT
                        if(suppress_anylog==false)
                        {
                            qInfo()<<"[L2B-007] Frames A-B BFF-BFF padding:"<<frasm_f1.outer_padding;
                        }
#endif
                        // If Frame A field order was not set yet - update it.
                        frasm_f1.setOrderBFF();
                    }
                    else if(frasm_f1.isOrderTFF()!=false)
                    {
                        // If Frame A field is set to opposite setting - invalidate A-B padding.
                        frasm_f1.outer_padding_ok = false;
#ifdef DI_EN_DBG_OUT
                        if(suppress_anylog==false)
                        {
                            qInfo()<<"[L2B-007] Frames A-B BFF-BFF padding detected, but Frame A is preset as TFF, ignoring.";
                        }
#endif
                        // Conflicting field orders.
                        proc_state = STG_PAD_NO_GOOD;
                    }
                }
                else if(f_res==DS_RET_SILENCE)
                {
                    // Can not detect padding due to silence, need to try later.
                    frasm_f1.outer_silence = true;
                    frasm_f1.outer_padding = 0;
                    frasm_f1.outer_padding_ok = false;
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Unable to detect A-B padding due to silence";
                    }
#endif
                    proc_state = STG_PAD_SILENCE;
                }
                else
                {
                    // Did not find padding between frames.
                    // Check Frame B line count.
                    if(frasm_f2.odd_data_lines<MIN_FILL_LINES_PF)
                    {
                        // Not enough usefull lines in odd field, impossible to detect padding.
                        frasm_f1.outer_padding = 0;
                        frasm_f1.outer_padding_ok = false;
                        frasm_f2.inner_padding_ok = false;
#ifdef DI_EN_DBG_OUT
                        if(suppress_anylog==false)
                        {
                            qInfo()<<"[L2B-007] A-B BFF-BFF didn't work. Not enough usefull lines in odd field of Frame B, padding unknown.";
                        }
#endif
                        proc_state = STG_PAD_NO_GOOD;
                    }
                    else
                    {
                        // Enough usefull lines in odd field of frame B.
                        if(frasm_f1.isOrderPreset()==false)
                        {
                            // Field order for Frame A and B are not preset.
#ifdef DI_EN_DBG_OUT
                            if(suppress_anylog==false)
                            {
                                qInfo()<<"[L2B-007] A-B BFF-BFF didn't work. Switching to BFF-TFF...";
                            }
#endif
                            // Try BFF - TFF.
                            proc_state = STG_AB_BFF_TO_TFF;
                        }
                        else
                        {
                            // Frame A (and Frame B should be as well) order is preset to BFF,
                            // impossible to stitch with TFF order.
#ifdef DI_EN_DBG_OUT
                            if(suppress_anylog==false)
                            {
                                qInfo()<<"[L2B-007] A-B BFF-BFF didn't work. Field order preset to BFF, padding unknown.";
                            }
#endif
                            frasm_f1.outer_padding = 0;
                            frasm_f1.outer_padding_ok = false;
                            proc_state = STG_PAD_NO_GOOD;
                        }
                    }
                }
            }
        }
//------------------------ Processing A-B padding (TFF to BFF).
        else if(proc_state==STG_AB_TFF_TO_BFF)
        {
