Fagear/SDVPCMdecoder/stc007datastitcher.cpp
#ifdef DI_EN_DBG_OUT
            if(suppress_anylog==false)
            {
                qInfo()<<"[L2B-007] Try detecting A-B padding, assuming TFF-BFF...";
            }
#endif
            // Get resolution for the seam.
            stitch_resolution = getResolutionForSeam(frasm_f1.even_resolution, frasm_f2.even_resolution);
            // Try to detect padding between TFF-BFF frames.
            f_res = findPadding(&frame1_even, frasm_f1.even_data_lines, &frame2_even, frasm_f2.even_data_lines, frasm_f1.video_standard, stitch_resolution, &(frasm_f1.outer_padding));
            // Preset "no silence" for padding.
            frasm_f1.outer_silence = false;
            if(f_res==DS_RET_OK)
            {
                // Padding detected successfully.
                frasm_f1.outer_padding_ok = true;
                frasm_f2.setOrderBFF();
                // Work is done.
                proc_state = STG_PAD_OK;
                if(frasm_f1.isOrderSet()==false)
                {
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Frames A-B TFF-BFF padding:"<<frasm_f1.outer_padding;
                    }
#endif
                    // If Frame A field order was not set yet - update it.
                    frasm_f1.setOrderTFF();
                }
                else if(frasm_f1.isOrderBFF()!=false)
                {
                    // If Frame A field is set to opposite setting - invalidate A-B padding.
                    frasm_f1.outer_padding_ok = false;
                    //frasm_f2.setOrderUnknown();
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Frames A-B TFF-BFF padding detected, but Frame A is preset as BFF, ignoring.";
                    }
#endif
                    // Conflicting field orders.
                    proc_state = STG_PAD_NO_GOOD;
                }
            }
            else if(f_res==DS_RET_SILENCE)
            {
                // Can not detect padding due to silence, need to try later.
                frasm_f1.outer_silence = true;
                frasm_f1.outer_padding = 0;
                frasm_f1.outer_padding_ok = false;
                frasm_f2.inner_padding_ok = false;
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007] Unable to detect A-B padding due to silence";
                }
#endif
                proc_state = STG_PAD_SILENCE;
            }
            else
            {
                // Did not find padding between frames.
                frasm_f1.outer_padding = 0;
                frasm_f1.outer_padding_ok = false;
                frasm_f2.inner_padding_ok = false;
                // Check if Frame A is preset to be TFF.
                if((en_sw_order!=false)&&(frasm_f1.even_data_lines>=MIN_FILL_LINES_PF))
                {
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] A-B TFF-BFF didn't work. Switching to BFF-BFF...";
                    }
#endif
                    // Try BFF - BFF.
                    proc_state = STG_AB_BFF_TO_BFF;
                    en_sw_order = false;
                }
                else
                {
                    // Nothing found for Frame A and A-B.
                    proc_state = STG_PAD_NO_GOOD;
                }
            }
        }
//------------------------ Processing A-B padding (BFF to TFF).
        else if(proc_state==STG_AB_BFF_TO_TFF)
        {
#ifdef DI_EN_DBG_OUT
            if(suppress_anylog==false)
            {
                qInfo()<<"[L2B-007] Try detecting A-B padding, assuming BFF-TFF...";
            }
#endif
            // Get resolution for the seam.
            stitch_resolution = getResolutionForSeam(frasm_f1.odd_resolution, frasm_f2.odd_resolution);
            // Try to detect padding between BFF-TFF frames.
            f_res = findPadding(&frame1_odd, frasm_f1.odd_data_lines, &frame2_odd, frasm_f2.odd_data_lines, frasm_f1.video_standard, stitch_resolution, &(frasm_f1.outer_padding));
            // Preset "no silence" for padding.
            frasm_f1.outer_silence = false;
            if(f_res==DS_RET_OK)
            {
                // Padding detected successfully.
                frasm_f1.outer_padding_ok = true;
                frasm_f2.setOrderTFF();
                // Work is done.
                proc_state = STG_PAD_OK;
                if(frasm_f1.isOrderSet()==false)
                {
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Frames A-B BFF-TFF padding:"<<frasm_f1.outer_padding;
                    }
#endif
                    // If Frame A field order was not set yet - update it.
                    frasm_f1.setOrderBFF();
                }
                else if(frasm_f1.isOrderTFF()!=false)
                {
                    // If Frame A field is set to opposite setting - invalidate A-B padding.
                    frasm_f1.outer_padding_ok = false;
                    //frasm_f2.setOrderUnknown();
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Frames A-B BFF-TFF padding detected, but Frame A is preset as TFF, ignoring.";
                    }
#endif
                    // Conflicting field orders.
                    proc_state = STG_PAD_NO_GOOD;
                }
            }
            else if(f_res==DS_RET_SILENCE)
            {
                // Can not detect padding due to silence, need to try later.
                frasm_f1.outer_silence = true;
                frasm_f1.outer_padding = 0;
                frasm_f1.outer_padding_ok = false;
                frasm_f2.inner_padding_ok = false;
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007] Unable to detect A-B padding due to silence";
                }
#endif
                proc_state = STG_PAD_SILENCE;
            }
            else
            {
                // Did not find padding between frames.
                frasm_f1.outer_padding = 0;
                frasm_f1.outer_padding_ok = false;
                frasm_f2.inner_padding_ok = false;
                // Check if Frame A is preset to be BFF.
                if((en_sw_order!=false)&&(frasm_f1.even_data_lines>=MIN_FILL_LINES_PF))
                {
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] A-B BFF-TFF didn't work. Switching to TFF-TFF...";
                    }
#endif
                    // Try TFF - TFF.
                    proc_state = STG_AB_TFF_TO_TFF;
                    en_sw_order = false;
                }
                else
                {
                    // Nothing found for Frame A and A-B.
                    proc_state = STG_PAD_NO_GOOD;
                }
            }
        }
//------------------------ General states.
//------------------------ Padding is done successfully.
        else if(proc_state==STG_PAD_OK)
        {
            // Field order and paddings are found successfully.
#ifdef DI_EN_DBG_OUT
            if(suppress_anylog==false)
            {
                qInfo()<<"[L2B-007] Frame padding detected successfully.";
            }
#endif
            // Exit stage cycle.
            break;
        }
//------------------------ Unable to detect padding due to silence.
        else if(proc_state==STG_PAD_SILENCE)
        {
            // Padding can not be found on silence.
#ifdef DI_EN_DBG_OUT
            if(suppress_anylog==false)
            {
                qInfo()<<"[L2B-007] Unable to detect frame padding due to silence!";
            }
#endif
            // Exit stage cycle.
            break;
        }
//------------------------ Failed to detect padding.
        else if(proc_state==STG_PAD_NO_GOOD)
        {
            // Padding was not found.
#ifdef DI_EN_DBG_OUT
            if(suppress_anylog==false)
            {
                qInfo()<<"[L2B-007] Unable to detect valid frame padding!";
            }
#endif
            // Exit stage cycle.
            break;
        }
        //qDebug()<<"[DI] Stage"<<stage_count<<"time:"<<dbg_timer.nsecsElapsed();

        // Check for looping.
        if(stage_count>STG_PAD_MAX)
        {
#ifdef DI_EN_DBG_OUT
            qWarning()<<DBG_ANCHOR<<"[L2B-007] Inf. loop detected, breaking...";
#endif
            return DS_RET_NO_PAD;
        }
    }
    while(1);   // Stages cycle.

#ifdef DI_EN_DBG_OUT
    if(suppress_log==false)
    {
        QString log_line;
        qInfo()<<"[L2B-007] ----------- Padding results:";
        log_line = "[L2B-007] Frame A padding counters: TFF="+QString::number(frasm_f1.tff_cnt)+", BFF="+QString::number(frasm_f1.bff_cnt);
        qInfo()<<log_line;
        log_line = "[L2B-007] Frame A ("+QString::number(frasm_f1.frame_number)+") field padding: ";
        if(frasm_f1.inner_padding_ok!=false)
        {
            log_line += "OK (";
        }
        else if(frasm_f1.inner_silence!=false)
        {
            log_line += "Silence (";
        }
        else
        {
            log_line += "Fail (";
        }
        log_line += QString::number(frasm_f1.inner_padding)+"), field order: ";
        if(frasm_f1.isOrderTFF()!=false)
        {
            log_line += "TFF";
            if(frasm_f1.isOrderPreset()!=false)
            {
                log_line += " (preset)";
            }
        }
        else if(frasm_f1.isOrderBFF()!=false)
        {
            log_line += "BFF";
            if(frasm_f1.isOrderPreset()!=false)
            {
                log_line += " (preset)";
            }
        }
        else
        {
            log_line += "Unknown";
        }
        qInfo()<<log_line;
        log_line = "[L2B-007] Frames A-B padding: ";
        if(frasm_f1.outer_padding_ok!=false)
        {
            log_line += "OK (";
        }
        else if(frasm_f1.outer_silence!=false)
        {
            log_line += "Silence (";
        }
        else
        {
            log_line += "Fail (";
        }
        log_line += QString::number(frasm_f1.outer_padding)+")";
        qInfo()<<log_line;
        log_line = "[L2B-007] Frame B ("+QString::number(frasm_f2.frame_number)+") field order: ";
        if(frasm_f2.isOrderTFF()!=false)
        {
            log_line += "TFF";
            if(frasm_f2.isOrderPreset()!=false)
            {
                log_line += " (preset)";
            }
        }
        else if(frasm_f2.isOrderBFF()!=false)
        {
            log_line += "BFF";
            if(frasm_f2.isOrderPreset()!=false)
            {
                log_line += " (preset)";
            }
        }
        else
        {
            log_line += "not set";
        }
        qInfo()<<log_line;
    }
#endif

    if(proc_state==STG_PAD_OK)
    {
        return DS_RET_OK;
    }
    else if(proc_state==STG_PAD_SILENCE)
    {
        return DS_RET_SILENCE;
    }
    else
    {
        return DS_RET_NO_PAD;
    }
}

