Fagear/SDVPCMdecoder/stc007datastitcher.cpp
//------------------------ Get field order for frame assembly.
uint8_t STC007DataStitcher::getAssemblyFieldOrder()
{
    bool suppress_log;
    uint8_t last_good_order, cur_field_order;

    suppress_log = ((log_level&LOG_FIELD_ASSEMBLY)==0);
    cur_field_order = FrameAsmDescriptor::ORDER_UNK;

    // Check if field order is detected.
    if(frasm_f1.isOrderSet()!=false)
    {
        // Save known good field order.
        cur_field_order = frasm_f1.field_order;
        if(frasm_f1.isOrderPreset()==false)
        {
            // Update "last good" field order.
            updateFieldOrderStats(cur_field_order);
        }
    }
    else
    {
#ifdef DI_EN_DBG_OUT
        if(suppress_log==false)
        {
            qInfo()<<"[L2B-007] Field order is not detected!";
        }
#endif
        // Field order is not set.
        // Check field order for next frame.
        if((frasm_f2.isOrderPreset()!=false)&&(frasm_f2.isOrderSet()!=false))
        {
            // Set it by next frame, which has field order preset.
            cur_field_order = frasm_f2.field_order;
#ifdef DI_EN_DBG_OUT
            if(suppress_log==false)
            {
                qInfo()<<"[L2B-007] Setting field order by next frame ("<<frasm_f2.frame_number<<")";
            }
#endif
        }
        // Check field order for previous frame.
        else if((frasm_f0.isOrderSet()!=false)&&(frasm_f0.outer_padding_ok!=false))
        {
            // Set it by previous frame, which has field order set and has valid padding with current frame.
            cur_field_order = frasm_f0.field_order;
#ifdef DI_EN_DBG_OUT
            if(suppress_log==false)
            {
                qInfo()<<"[L2B-007] Setting field order by previous frame ("<<frasm_f0.frame_number<<")";
            }
#endif
        }
    }

    // Check if field order was determined by FrameAsmSTC007 data.
    if((cur_field_order!=FrameAsmDescriptor::ORDER_TFF)&&(cur_field_order!=FrameAsmDescriptor::ORDER_BFF))
    {
        // Field order not set yet.
        // Try to get field order by stats (history of last good orders).
        last_good_order = getProbableFieldOrder();
        // Check if there was successfull field order detected before.
        if((last_good_order==FrameAsmDescriptor::ORDER_TFF)||(last_good_order==FrameAsmDescriptor::ORDER_BFF))
        {
            // There is previous good field order.
            cur_field_order = last_good_order;
#ifdef DI_EN_DBG_OUT
            if(last_good_order==FrameAsmDescriptor::ORDER_BFF)
            {
                if(suppress_log==false)
                {
                    qInfo()<<"[L2B-007] Setting field order by previous good to BFF";
                }
            }
            else
            {
                if(suppress_log==false)
                {
                    qInfo()<<"[L2B-007] Setting field order by previous good to TFF";
                }
            }
#endif
        }
        else
        {
            // Still no field order...
            // Check padding counters.
            if(frasm_f1.tff_cnt<frasm_f1.bff_cnt)
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    QString log_line;
                    log_line.sprintf("[L2B-007] Setting field order by counter to TFF (TFF=%u, BFF=%u)", frasm_f1.tff_cnt, frasm_f1.bff_cnt);
                    qInfo()<<log_line;
                }
#endif
                cur_field_order = FrameAsmDescriptor::ORDER_TFF;
            }
            else if(frasm_f1.tff_cnt>frasm_f1.bff_cnt)
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    QString log_line;
                    log_line.sprintf("[L2B-007] Setting field order by counter to BFF (TFF=%u, BFF=%u)", frasm_f1.tff_cnt, frasm_f1.bff_cnt);
                    qInfo()<<log_line;
                }
#endif
                cur_field_order = FrameAsmDescriptor::ORDER_BFF;
            }
            else
            {
                // Field order is still not set, choose by default.
                cur_field_order = FLD_ORDER_DEFAULT;
#ifdef DI_EN_DBG_OUT
                if((uint8_t)FLD_ORDER_DEFAULT==(uint8_t)FrameAsmDescriptor::ORDER_BFF)
                {
                    // Default is set to BFF, add lines from even field.
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Setting field order by default to BFF";
                    }
                }
                else
                {
                    // Default is set to TFF, add lines from even field.
                    if(suppress_log==false)
                    {
                        qInfo()<<"[L2B-007] Setting field order by default to TFF";
                    }
                }
#endif
            }
        }
    }

    // Field order must be set at this point.
    if(frasm_f1.isOrderSet()==false)
    {
        // Field order was not properly detected, but was assumed and guessed.
        // Set guessed value for stats (will not be used for frame assembly).
        frasm_f1.field_order = cur_field_order;
        frasm_f1.setOrderGuessed(true);
    }
    return cur_field_order;
}

//------------------------ Get first line number for first field to fill.
uint16_t STC007DataStitcher::getFirstFieldLineNum(uint8_t in_order)
{
    if(in_order==FrameAsmDescriptor::ORDER_TFF)
    {
        return 1;
    }
    else
    {
        return 2;
    }
}

//------------------------ Get first line number for second field to fill.
uint16_t STC007DataStitcher::getSecondFieldLineNum(uint8_t in_order)
{
    if(in_order==FrameAsmDescriptor::ORDER_TFF)
    {
        return 2;
    }
    else
    {
        return 1;
    }
}

//------------------------ Fill output line buffer with lines from provided field buffer.
uint16_t STC007DataStitcher::addLinesFromField(std::vector<STC007Line> *field_buf, uint16_t ind_start, uint16_t count, uint16_t *last_line_num)
{
    bool suppress_log;
    uint16_t lines_cnt;
    lines_cnt = 0;

#ifdef DI_EN_DBG_OUT
    uint16_t min_line_num, max_line_num;
    max_line_num = 0;
    min_line_num = 0xFFFF;
#endif

    suppress_log = !(((log_level&LOG_FIELD_ASSEMBLY)!=0)||((log_level&LOG_PROCESS)!=0));

    // Check array limits.
    if((field_buf->size()>=ind_start)&&(field_buf->size()>=(ind_start+count)))
    {
        // Check if there is anything to copy.
        if(count!=0)
        {
            for(uint16_t index=ind_start;index<(ind_start+count);index++)
            {
                // Copy PCM line into queue.
                conv_queue.push_back((*field_buf)[index]);
                if(last_line_num!=NULL)
                {
                    // Save its line number.
                    (*last_line_num) = (*field_buf)[index].line_number;
                    // Advance line number by 2 (skip a field).
                    (*last_line_num) = (*last_line_num)+2;
                }
#ifdef DI_EN_DBG_OUT
                if(min_line_num>(*field_buf)[index].line_number)
                {
                    min_line_num = (*field_buf)[index].line_number;
                }
                if(max_line_num<(*field_buf)[index].line_number)
                {
                    max_line_num = (*field_buf)[index].line_number;
                }
#endif
                // Count number of added lines.
                lines_cnt++;
            }
#ifdef DI_EN_DBG_OUT
            if(suppress_log==false)
            {
                qInfo()<<"[L2B-007]"<<lines_cnt<<"lines from field ("<<ind_start<<"..."<<(ind_start+count-1)<<"), #("<<min_line_num<<"..."<<max_line_num<<") inserted into queue";
            }
#endif
        }
#ifdef DI_EN_DBG_OUT
        else
        {
            if(suppress_log==false)
            {
                qInfo()<<"[L2B-007] No lines from field inserted";
            }
        }
#endif
    }
    else
    {
        qWarning()<<DBG_ANCHOR<<"[L2B-007] Array access out of bounds! Total:"<<field_buf->size()<<", start index:"<<ind_start<<", stop index:"<<(ind_start+count);
    }
    return lines_cnt;
}

//------------------------ Fill output line buffer with empty lines.
uint16_t STC007DataStitcher::addFieldPadding(uint32_t in_frame, uint16_t line_cnt, uint16_t *last_line_num)
{
    bool suppress_log;
    uint16_t lines_cnt;
    lines_cnt = 0;

#ifdef DI_EN_DBG_OUT
    uint16_t min_line_num, max_line_num;
    max_line_num = 0;
    min_line_num = 0xFFFF;
#endif

    suppress_log = !(((log_level&LOG_FIELD_ASSEMBLY)!=0)||((log_level&LOG_PROCESS)!=0));

    if(line_cnt==0)
    {
        return lines_cnt;
    }
    for(uint16_t index=0;index<line_cnt;index++)
    {
        STC007Line empty_line;
        // Set values for empty padding line.
        empty_line.frame_number = in_frame;
        if(last_line_num!=NULL)
        {
            empty_line.line_number = (*last_line_num);
            // Advance line number by 2 (skip a field).
            (*last_line_num) = (*last_line_num)+2;
        }
#ifdef DI_EN_DBG_OUT
        if(min_line_num>empty_line.line_number)
        {
            min_line_num = empty_line.line_number;
        }
        if(max_line_num<empty_line.line_number)
        {
            max_line_num = empty_line.line_number;
        }
#endif
        // Push padding line into queue.
        conv_queue.push_back(empty_line);
        lines_cnt++;
    }
#ifdef DI_EN_DBG_OUT
    if(suppress_log==false)
    {
        qInfo()<<"[L2B-007]"<<lines_cnt<<"padding lines #("<<min_line_num<<"..."<<max_line_num<<") inserted into queue";
    }
#endif
    return lines_cnt;
}

//------------------------ Should data block not be reported for bad samples and not be visualized?
bool STC007DataStitcher::isBlockNoReport(STC007DataBlock *in_block)
{
    if(((file_start!=false)&&(in_block->getStartFrame()==frasm_f0.frame_number))
        ||((file_end!=false)&&(in_block->getStopFrame()==frasm_f2.frame_number)))
    {
        return true;
    }
    else
    {
        return false;
    }
}

//------------------------ Fill in one frame into queue for conversion from field buffers, inserting padding.
void STC007DataStitcher::fillFrameForOutput()
{
    bool suppress_log, suppress_anylog;
    uint8_t cur_field_order;
    uint16_t field_1_cnt, field_2_cnt;
    std::vector<STC007Line> *p_field_1, *p_field_2;

