Fagear/SDVPCMdecoder/stc007datastitcher.cpp
    suppress_log = ((log_level&LOG_FIELD_ASSEMBLY)==0);
    suppress_anylog = (((log_level&LOG_PROCESS)==0)&&((log_level&LOG_FIELD_ASSEMBLY)==0));

    cur_field_order = FrameAsmDescriptor::ORDER_UNK;
    field_1_cnt = field_2_cnt = 0;
    p_field_1 = p_field_2 = NULL;

#ifdef DI_EN_DBG_OUT
    if(suppress_anylog==false)
    {
        qInfo()<<"[L2B-007] -------------------- Frame reassembling starting...";
    }
#endif

    // Determine field order for current frame assembly.
    cur_field_order = getAssemblyFieldOrder();

    // Select field data to add lines from.
    if(cur_field_order==FrameAsmDescriptor::ORDER_TFF)
    {
        // Field order is set to TFF.
        // First field = odd, second = even.
        field_1_cnt = frasm_f1.odd_data_lines;
        field_2_cnt = frasm_f1.even_data_lines;
        p_field_1 = &frame1_odd;
        p_field_2 = &frame1_even;
        if(frasm_f0.isOrderSet()!=false)
        {
            if(frasm_f0.isOrderTFF()==false)
            {
                frasm_f0.outer_padding_ok = false;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[L2B-007] Selected field order conflicts with previous frame field order!";
                }
#endif
            }
        }
    }
    else
    {
        // Field order is set to BFF.
        // First field = even, second = odd.
        field_1_cnt = frasm_f1.even_data_lines;
        field_2_cnt = frasm_f1.odd_data_lines;
        p_field_1 = &frame1_even;
        p_field_2 = &frame1_odd;
        if(frasm_f0.isOrderSet()!=false)
        {
            if(frasm_f0.isOrderBFF()==false)
            {
                frasm_f0.outer_padding_ok = false;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    qInfo()<<"[L2B-007] Selected field order conflicts with previous frame field order!";
                }
#endif
            }
        }
    }

    // Get target line count by video standard.
    int16_t target_lines_per_field;
    if(frasm_f1.video_standard==FrameAsmDescriptor::VID_PAL)
    {
        target_lines_per_field = LINES_PF_PAL;
    }
    else if(frasm_f1.video_standard==FrameAsmDescriptor::VID_NTSC)
    {
        target_lines_per_field = LINES_PF_NTSC;
    }
    else
    {
        // Pick default standard.
        target_lines_per_field = LINES_PF_DEFAULT;
    }

#ifdef QT_VERSION
    if(field_1_cnt>target_lines_per_field)
    {
        qWarning()<<DBG_ANCHOR<<"[L2B-007] Field 1 size over the target!"<<frasm_f1.frame_number<<field_1_cnt<<target_lines_per_field;
    }
    if(field_2_cnt>target_lines_per_field)
    {
        qWarning()<<DBG_ANCHOR<<"[L2B-007] Field 2 size over the target!"<<frasm_f1.frame_number<<field_2_cnt<<target_lines_per_field;
    }
#endif

    // Crude fix to avoid frame overflow.
    if(field_1_cnt>target_lines_per_field)
    {
        field_1_cnt = target_lines_per_field;
    }
    if(field_2_cnt>target_lines_per_field)
    {
        field_2_cnt = target_lines_per_field;
    }

    // Determine if there is a need to enable top-line insertion due to uneven line count.
    bool insert_top_line = false;
    insert_top_line = fix_cut_above;

    // Choose a way to assemble a frame.
    uint16_t last_line, lines_to_fill, added_inner, added_outer, added_lines_cnt;
    last_line = lines_to_fill = added_inner = added_outer = added_lines_cnt = 0;

    // Check if leading lines should be added at the start of new file.
    if(file_start!=false)
    {
        uint8_t add_count;
#ifdef DI_EN_DBG_OUT
        if(suppress_anylog==false)
        {
            qInfo()<<"[L2B-007] File just started, adding leading padding...";
        }
#endif
        // Set previous frame number to 0 (number of the first frame in the file should be "1").
        frasm_f0.frame_number = 0;
        // Set previous frame resolution.
        if(cur_field_order==FrameAsmDescriptor::ORDER_TFF)
        {
            frasm_f0.even_resolution = frasm_f0.odd_resolution = frasm_f1.odd_resolution;
        }
        else
        {
            frasm_f0.even_resolution = frasm_f0.odd_resolution = frasm_f1.even_resolution;
        }
        // Set line number.
        if(frasm_f1.video_standard==FrameAsmDescriptor::VID_PAL)
        {
            last_line = LINES_PF_PAL;
        }
        else
        {
            last_line = LINES_PF_NTSC;
        }
        // Calculate padding to put [LINE_R2] sample at the top, no need to pad up to P and Q words.
        add_count = STC007DataBlock::LINE_R2;
        last_line = (last_line*2)-(add_count*2);
        // Add leading padding.
        addFieldPadding(0, add_count, &last_line);
        // Reset line number for normal frame assembly.
        last_line = 0;
    }

    // Check "anchors" for data.
    // Previous frame linked to current frame: anchor A.
    // Field of the current frame are linked: anchor B.
    // Сurrent frame linked to next frame: anchor C.
    if(frasm_f0.outer_padding_ok!=false)
    {
        // Anchor A is present.
        if(frasm_f1.inner_padding_ok!=false)
        {
            // Anchor A and anchor B are present.
            if(frasm_f1.outer_padding_ok!=false)
            {
                // Anchor A and anchor B and anchor C are present.
                // ABC
                // Calculate total number of lines for frame assembly.
                lines_to_fill = field_1_cnt+field_2_cnt+frasm_f1.inner_padding+frasm_f1.outer_padding;
                // Check line count according to video standard.
                if((target_lines_per_field*2)==lines_to_fill)
                {
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Data anchors: ABC, path: frame size is correct";
                    }
#endif
                    // Reset line number.
                    last_line = getFirstFieldLineNum(cur_field_order);
                    // Add lines from first field (full field).
                    added_lines_cnt += addLinesFromField(p_field_1, 0, field_1_cnt, &last_line);
                    // Add field-to-field padding.
                    added_inner = addFieldPadding(frasm_f1.frame_number, frasm_f1.inner_padding, &last_line);
                    added_lines_cnt += added_inner;
                    // Reset line number.
                    last_line = getSecondFieldLineNum(cur_field_order);
                    // Add lines from second field (full field).
                    added_lines_cnt += addLinesFromField(p_field_2, 0, field_2_cnt, &last_line);
                    // Add frame-to-frame padding.
                    added_outer = addFieldPadding(frasm_f1.frame_number, frasm_f1.outer_padding, &last_line);
                    added_lines_cnt += added_outer;
                }
                else if((target_lines_per_field*2)>lines_to_fill)
                {
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Data anchors: ABC, path: not enough lines";
                    }
#endif
                    // Calculate number of padding lines to fill full frame.
                    lines_to_fill = (target_lines_per_field*2)-lines_to_fill;
                    // Reset line number.
                    last_line = getFirstFieldLineNum(cur_field_order);
                    // Add lines from first field (full field).
                    added_lines_cnt += addLinesFromField(p_field_1, 0, field_1_cnt, &last_line);
                    // Add field-to-field padding.
                    added_inner = addFieldPadding(frasm_f1.frame_number, frasm_f1.inner_padding, &last_line);
                    added_lines_cnt += added_inner;
                    // Reset line number.
                    last_line = getSecondFieldLineNum(cur_field_order);
                    // Add lines from second field (full field).
                    added_lines_cnt += addLinesFromField(p_field_2, 0, field_2_cnt, &last_line);
                    // Add frame-to-frame padding.
                    added_outer = addFieldPadding(frasm_f1.frame_number, frasm_f1.outer_padding, &last_line);
                    // Add padding up to frame standard.
                    added_outer += addFieldPadding(frasm_f1.frame_number, lines_to_fill, &last_line);
                    added_lines_cnt += added_outer;
                    // Need to invalidate bottom seam.
                    frasm_f1.outer_padding_ok = false;
                    frasm_f2.setOrderUnknown();
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Frames A-B ("<<frasm_f1.frame_number<<"-"<<frasm_f2.frame_number<<") seam invalidated!";
                    }
#endif
                }
                else
                {
                    // Re-calculate total number of lines for frame assembly (drop outer padding).
                    lines_to_fill = field_1_cnt+field_2_cnt+frasm_f1.inner_padding;
                    if((target_lines_per_field*2)>=lines_to_fill)
                    {
#ifdef DI_EN_DBG_OUT
                        if(suppress_anylog==false)
                        {
                            qInfo()<<"[L2B-007] Data anchors: ABC, path: too many lines, cutting padding";
                        }
#endif
                        // Calculate number of padding lines to fill full frame.
                        lines_to_fill = (target_lines_per_field*2)-lines_to_fill;
                        // Reset line number.
                        last_line = getFirstFieldLineNum(cur_field_order);
                        // Add lines from first field (full field).
                        added_lines_cnt += addLinesFromField(p_field_1, 0, field_1_cnt, &last_line);
                        // Add field-to-field padding.
                        added_inner = addFieldPadding(frasm_f1.frame_number, frasm_f1.inner_padding, &last_line);
                        added_lines_cnt += added_inner;
                        // Reset line number.
                        last_line = getSecondFieldLineNum(cur_field_order);
                        // Add lines from second field (full field).
                        added_lines_cnt += addLinesFromField(p_field_2, 0, field_2_cnt, &last_line);
                        // Add padding up to frame standard.
                        added_outer = addFieldPadding(frasm_f1.frame_number, lines_to_fill, &last_line);
                        added_lines_cnt += added_outer;
                    }
                    else
                    {
#ifdef DI_EN_DBG_OUT
                        if(suppress_anylog==false)
                        {
                            qInfo()<<"[L2B-007] Data anchors: ABC, path: too many lines, cutting second field";
                        }
#endif
                        // Calculate number of excess lines that should be cut.
                        lines_to_fill = lines_to_fill-(target_lines_per_field*2);
                        // Reset line number.
                        last_line = getFirstFieldLineNum(cur_field_order);
                        // Add lines from first field (full field).
                        added_lines_cnt += addLinesFromField(p_field_1, 0, field_1_cnt, &last_line);
                        // Add field-to-field padding.
                        added_inner = addFieldPadding(frasm_f1.frame_number, frasm_f1.inner_padding, &last_line);
                        added_lines_cnt += added_inner;
                        // Reset line number.
                        last_line = getSecondFieldLineNum(cur_field_order);
                        // Add lines from second field (cut data from the end).
                        added_lines_cnt += addLinesFromField(p_field_2, 0, (field_2_cnt-lines_to_fill), &last_line);
                    }
                    // Need to invalidate bottom seam.
                    frasm_f1.outer_padding_ok = false;
                    frasm_f2.setOrderUnknown();
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Frames A-B ("<<frasm_f1.frame_number<<"-"<<frasm_f2.frame_number<<") seam invalidated!";
                    }
#endif
                }
            }
            else
            {
                // Anchor A and anchor B present.
                // No anchor C.
                // AB
                // Calculate total number of lines for frame assembly.
                lines_to_fill = field_1_cnt+field_2_cnt+frasm_f1.inner_padding;
                // Check line count according to video standard.
                if((target_lines_per_field*2)>=lines_to_fill)
                {
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Data anchors: AB, path: adding padding";
                    }
#endif
                    // Calculate number of padding lines to fill full frame.
                    lines_to_fill = (target_lines_per_field*2)-lines_to_fill;
                    // Reset line number.
                    last_line = getFirstFieldLineNum(cur_field_order);
                    // Add lines from first field (full field).
                    added_lines_cnt = addLinesFromField(p_field_1, 0, field_1_cnt, &last_line);
                    // Add field-to-field padding.
                    added_inner = addFieldPadding(frasm_f1.frame_number, frasm_f1.inner_padding, &last_line);
                    added_lines_cnt += added_inner;
                    // Reset line number.
                    last_line = getSecondFieldLineNum(cur_field_order);
                    // Add lines from second field (full field).
                    added_lines_cnt += addLinesFromField(p_field_2, 0, field_2_cnt, &last_line);
                    // Add padding up to frame standard.
                    added_outer = addFieldPadding(frasm_f1.frame_number, lines_to_fill, &last_line);
                    added_lines_cnt += added_outer;
                }
                else
                {
#ifdef DI_EN_DBG_OUT
                    if(suppress_anylog==false)
                    {
                        qInfo()<<"[L2B-007] Data anchors: AB, path: too many lines, cutting second field";
                    }
#endif
                    // Calculate number of excess lines that should be cut.
                    lines_to_fill = lines_to_fill-(target_lines_per_field*2);
                    // Reset line number.
                    last_line = getFirstFieldLineNum(cur_field_order);
                    // Add lines from first field (full field).
                    added_lines_cnt = addLinesFromField(p_field_1, 0, field_1_cnt, &last_line);
                    // Add field-to-field padding.
                    added_inner = addFieldPadding(frasm_f1.frame_number, frasm_f1.inner_padding, &last_line);
                    added_lines_cnt += added_inner;
                    // Reset line number.
                    last_line = getSecondFieldLineNum(cur_field_order);
                    // Add lines from second field (cut data from the end).
                    added_lines_cnt += addLinesFromField(p_field_2, 0, (field_2_cnt-lines_to_fill), &last_line);
                }
            }
        }
        else if(frasm_f1.outer_padding_ok!=false)
        {
            // Anchor A and anchor C present.
            // No anchor B.
            // AC
            // Calculate total number of lines for frame assembly.
            lines_to_fill = field_1_cnt+field_2_cnt+frasm_f1.outer_padding;
            // Check line count according to video standard.
            if((target_lines_per_field*2)>=lines_to_fill)
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007] Data anchors: AC, path: adding padding";
                }
#endif
                // Calculate number of padding lines to fill full frame.
                lines_to_fill = (target_lines_per_field*2)-lines_to_fill;
                // Reset line number.
                last_line = getFirstFieldLineNum(cur_field_order);
                // Add lines from first field (full field).
                added_lines_cnt = addLinesFromField(p_field_1, 0, field_1_cnt, &last_line);
                // Add padding up to frame standard.
                added_inner = addFieldPadding(frasm_f1.frame_number, lines_to_fill, &last_line);
                added_lines_cnt += added_inner;
                // Reset line number.
                last_line = getSecondFieldLineNum(cur_field_order);
                // Add lines from second field (full field).
                added_lines_cnt += addLinesFromField(p_field_2, 0, field_2_cnt, &last_line);
                // Add frame-to-frame padding.
                added_outer = addFieldPadding(frasm_f1.frame_number, frasm_f1.outer_padding, &last_line);
                added_lines_cnt += added_outer;
            }
            else
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007] Data anchors: AC, path: too many lines, cutting second field";
                }
#endif
                // Calculate number of excess lines that should be cut.
                lines_to_fill = lines_to_fill-(target_lines_per_field*2);
                // Reset line number.
                last_line = getFirstFieldLineNum(cur_field_order);
                // Add lines from first field (full field).
                added_lines_cnt = addLinesFromField(p_field_1, 0, field_1_cnt, &last_line);
                // Reset line number.
                last_line = getSecondFieldLineNum(cur_field_order);
                // Add lines from second field (cut data from the start).
                added_lines_cnt += addLinesFromField(p_field_2, lines_to_fill, (field_2_cnt-lines_to_fill), &last_line);
                // Add frame-to-frame padding.
                added_outer = addFieldPadding(frasm_f1.frame_number, frasm_f1.outer_padding, &last_line);
                added_lines_cnt += added_outer;
            }
        }
        else
        {
            // Anchor A present.
            // No anchor B and anchor C.
            // A
            // Calculate total number of lines for frame assembly.
            lines_to_fill = field_1_cnt+field_2_cnt;
            // Check line count according to video standard.
            if((target_lines_per_field*2)>=lines_to_fill)
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007] Data anchors: A, path: adding padding";
                }
#endif
                // Reset line number.
                last_line = getFirstFieldLineNum(cur_field_order);
                // Add lines from first field (full field).
                added_lines_cnt = addLinesFromField(p_field_1, 0, field_1_cnt, &last_line);
                // Add padding up to field standard.
                added_inner = addFieldPadding(frasm_f1.frame_number, (target_lines_per_field-field_1_cnt), &last_line);
                added_lines_cnt += added_inner;
                // Reset line number.
                last_line = getSecondFieldLineNum(cur_field_order);
                // Add lines from second field (full field).
                added_lines_cnt += addLinesFromField(p_field_2, 0, field_2_cnt, &last_line);
                // Add padding up to field standard.
                added_outer = addFieldPadding(frasm_f1.frame_number, (target_lines_per_field-field_2_cnt), &last_line);
                added_lines_cnt += added_outer;
            }
            else
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007] Data anchors: A, path: too many lines, cutting second field";
                }
#endif
                // Calculate number of excess lines that should be cut.
                lines_to_fill = lines_to_fill-(target_lines_per_field*2);
                // Reset line number.
                last_line = getFirstFieldLineNum(cur_field_order);
                // Add lines from first field (full field).
                added_lines_cnt = addLinesFromField(p_field_1, 0, field_1_cnt, &last_line);
                // Reset line number.
                last_line = getSecondFieldLineNum(cur_field_order);
                // Add lines from second field (cut data from the end).
                added_lines_cnt += addLinesFromField(p_field_2, 0, (field_2_cnt-lines_to_fill), &last_line);
            }
        }
    }
    // No anchor A.
    else if(frasm_f1.inner_padding_ok!=false)
    {
        // Anchor B is present.
        if(frasm_f1.outer_padding_ok!=false)
        {
            // Anchor B and anchor C are present.
            // No anchor A.
            // BC
            // Calculate total number of lines for frame assembly.
            lines_to_fill = field_1_cnt+field_2_cnt+frasm_f1.inner_padding+frasm_f1.outer_padding;
            // Check line count according to video standard.
            if((target_lines_per_field*2)>=lines_to_fill)
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    if((target_lines_per_field*2)==lines_to_fill)
                    {
                        qInfo()<<"[L2B-007] Data anchors: BC, path: frame size is correct";
                    }
                    else
                    {
                        qInfo()<<"[L2B-007] Data anchors: BC, path: adding padding";
                    }
                }
#endif
                // Calculate number of padding lines to fill full frame.
                lines_to_fill = (target_lines_per_field*2)-lines_to_fill;
                // Reset line number.
                last_line = getFirstFieldLineNum(cur_field_order);
                // Add padding up to frame standard.
                added_inner = addFieldPadding(frasm_f1.frame_number, lines_to_fill, &last_line);
                // Add lines from first field (full field).
                added_lines_cnt = addLinesFromField(p_field_1, 0, field_1_cnt, &last_line);
                // Add field-to-field padding.
                added_inner += addFieldPadding(frasm_f1.frame_number, frasm_f1.inner_padding, &last_line);
                added_lines_cnt += added_inner;
                // Reset line number.
                last_line = getSecondFieldLineNum(cur_field_order);
                // Add lines from second field (full field).
                added_lines_cnt += addLinesFromField(p_field_2, 0, field_2_cnt, &last_line);
                // Add frame-to-frame padding.
                added_outer = addFieldPadding(frasm_f1.frame_number, frasm_f1.outer_padding, &last_line);
                added_lines_cnt += added_outer;
            }
            else
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007] Data anchors: BC, path: too many lines, cutting first field";
                }
#endif
                // Calculate number of excess lines that should be cut.
                lines_to_fill = lines_to_fill-(target_lines_per_field*2);
                // Reset line number.
                last_line = getFirstFieldLineNum(cur_field_order);
                // Add lines from first field (cut data from the start).
                added_lines_cnt += addLinesFromField(p_field_1, lines_to_fill, (field_1_cnt-lines_to_fill), &last_line);
                // Add field-to-field padding.
                added_inner = addFieldPadding(frasm_f1.frame_number, frasm_f1.inner_padding, &last_line);
                added_lines_cnt += added_inner;
                // Reset line number.
                last_line = getSecondFieldLineNum(cur_field_order);
