Fagear/SDVPCMdecoder/stc007datastitcher.cpp
                // Add lines from second field (full field).
                added_lines_cnt += addLinesFromField(p_field_2, 0, field_2_cnt, &last_line);
                // Add frame-to-frame padding.
                added_outer = addFieldPadding(frasm_f1.frame_number, frasm_f1.outer_padding, &last_line);
                added_lines_cnt += added_outer;
            }
        }
        else
        {
            // Anchor B present.
            // No anchor A and anchor C.
            // B
            // Calculate total number of lines for frame assembly.
            lines_to_fill = field_1_cnt+field_2_cnt+frasm_f1.inner_padding;
            // Check line count according to video standard.
            if((target_lines_per_field*2)>=lines_to_fill)
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007] Data anchors: B, path: adding padding";
                }
#endif
                // Calculate number of padding lines to fill full frame.
                lines_to_fill = (target_lines_per_field*2)-lines_to_fill;
                // Reset line number.
                last_line = getFirstFieldLineNum(cur_field_order);
                // Add lines from first field (full field).
                added_lines_cnt = addLinesFromField(p_field_1, 0, field_1_cnt, &last_line);
                // Add field-to-field padding.
                added_inner = addFieldPadding(frasm_f1.frame_number, frasm_f1.inner_padding, &last_line);
                added_lines_cnt += added_inner;
                // Reset line number.
                last_line = getSecondFieldLineNum(cur_field_order);
                // Add lines from second field (full field).
                added_lines_cnt += addLinesFromField(p_field_2, 0, field_2_cnt, &last_line);
                // Add padding up to frame standard.
                added_outer = addFieldPadding(frasm_f1.frame_number, lines_to_fill, &last_line);
                added_lines_cnt += added_outer;
            }
            else
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_anylog==false)
                {
                    qInfo()<<"[L2B-007] Data anchors: B, path: too many lines, cutting second field";
                }
#endif
                // Calculate number of excess lines that should be cut.
                lines_to_fill = lines_to_fill-(target_lines_per_field*2);
                // Reset line number.
                last_line = getFirstFieldLineNum(cur_field_order);
                // Add lines from first field (full field).
                added_lines_cnt = addLinesFromField(p_field_1, 0, field_1_cnt, &last_line);
                // Add field-to-field padding.
                added_inner = addFieldPadding(frasm_f1.frame_number, frasm_f1.inner_padding, &last_line);
                added_lines_cnt += added_inner;
                // Reset line number.
                last_line = getSecondFieldLineNum(cur_field_order);
                // Add lines from second field (cut data from the end).
                added_lines_cnt += addLinesFromField(p_field_2, 0, (field_2_cnt-lines_to_fill), &last_line);
            }
        }
    }
    else if(frasm_f1.outer_padding_ok!=false)
    {
        // Anchor C present.
        // No anchor A and anchor B.
        // C
        // Calculate total number of lines for frame assembly.
        lines_to_fill = field_1_cnt+field_2_cnt+frasm_f1.outer_padding;
        // Check line count according to video standard.
        if((target_lines_per_field*2)>=lines_to_fill)
        {
#ifdef DI_EN_DBG_OUT
            if(suppress_anylog==false)
            {
                qInfo()<<"[L2B-007] Data anchors: C, path: adding padding";
            }
#endif
            // Calculate number of padding lines to fill full frame.
            lines_to_fill = (target_lines_per_field*2)-lines_to_fill;
            // Reset line number.
            last_line = getFirstFieldLineNum(cur_field_order);
            // Add lines from first field (full field).
            added_lines_cnt = addLinesFromField(p_field_1, 0, field_1_cnt, &last_line);
            // Add padding up to frame standard.
            added_inner = addFieldPadding(frasm_f1.frame_number, lines_to_fill, &last_line);
            added_lines_cnt += added_inner;
            // Reset line number.
            last_line = getSecondFieldLineNum(cur_field_order);
            // Add lines from second field (full field).
            added_lines_cnt += addLinesFromField(p_field_2, 0, field_2_cnt, &last_line);
            // Add frame-to-frame padding.
            added_outer = addFieldPadding(frasm_f1.frame_number, frasm_f1.outer_padding, &last_line);
            added_lines_cnt += added_outer;
        }
        else
        {
#ifdef DI_EN_DBG_OUT
            if(suppress_anylog==false)
            {
                qInfo()<<"[L2B-007] Data anchors: C, path: too many lines, cutting first field";
            }
#endif
            // Calculate number of excess lines that should be cut.
            lines_to_fill = lines_to_fill-(target_lines_per_field*2);
            // Reset line number.
            last_line = getFirstFieldLineNum(cur_field_order);
            // Add lines from first field (cut data from the end).
            added_lines_cnt = addLinesFromField(p_field_1, 0, (field_1_cnt-lines_to_fill), &last_line);
            // Reset line number.
            last_line = getSecondFieldLineNum(cur_field_order);
            // Add lines from second field (full field).
            added_lines_cnt += addLinesFromField(p_field_2, 0, field_2_cnt, &last_line);
            // Add frame-to-frame padding.
            added_outer = addFieldPadding(frasm_f1.frame_number, frasm_f1.outer_padding, &last_line);
            added_lines_cnt += added_outer;
        }
    }
    else
    {
        // No data anchors.
        // Calculate total number of lines for frame assembly.
        lines_to_fill = field_1_cnt+field_2_cnt;
        // Check line count according to video standard.
        if((target_lines_per_field*2)>=lines_to_fill)
        {
#ifdef DI_EN_DBG_OUT
            if(suppress_anylog==false)
            {
                qInfo()<<"[L2B-007] Data anchors: NONE, path: adding padding";
            }
#endif
            // Reset line number.
            last_line = getFirstFieldLineNum(cur_field_order);
            if((insert_top_line!=false)&&(field_1_cnt>0)&&(field_2_cnt>0))
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    if(insert_top_line!=false)
                    {
                        qInfo()<<"[L2B-007] One line shitfer enabled";
                    }
                }
#endif
                // Need to add line above one field to fix noise.
                if(cur_field_order==FrameAsmDescriptor::ORDER_BFF)
                {
                    added_outer = addFieldPadding(frasm_f1.frame_number, 1, &last_line);
                    // Add lines from first field (full field).
                    added_lines_cnt = addLinesFromField(p_field_1, 0, field_1_cnt, &last_line);
                    // Make next padding calculation one line less.
                    field_1_cnt++;
                    // Add padding up to field standard.
                    added_inner = addFieldPadding(frasm_f1.frame_number, (target_lines_per_field-field_1_cnt), &last_line);
                    added_lines_cnt += added_inner;
                    // Reset line number.
                    last_line = getSecondFieldLineNum(cur_field_order);
                    // Add lines from second field (full field).
                    added_lines_cnt += addLinesFromField(p_field_2, 0, field_2_cnt, &last_line);
                    // Add padding up to field standard.
                    added_outer += addFieldPadding(frasm_f1.frame_number, (target_lines_per_field-field_2_cnt), &last_line);
                    added_lines_cnt += added_outer;
                }
                else
                {
                    // Add lines from first field (full field).
                    added_lines_cnt = addLinesFromField(p_field_1, 0, field_1_cnt, &last_line);
                    // Add padding up to field standard (plus one line into next field to move next field data one line down).
                    added_inner = addFieldPadding(frasm_f1.frame_number, (target_lines_per_field-field_1_cnt+1), &last_line);
                    added_lines_cnt += added_inner;
                    // Reset line number.
                    last_line = getSecondFieldLineNum(cur_field_order);
                    // Add lines from second field (full field).
                    added_lines_cnt += addLinesFromField(p_field_2, 0, field_2_cnt, &last_line);
                    // Make next padding calculation one line less.
                    field_2_cnt++;
                    // Add padding up to field standard.
                    added_outer = addFieldPadding(frasm_f1.frame_number, (target_lines_per_field-field_2_cnt), &last_line);
                    added_lines_cnt += added_outer;
                }
            }
            else
            {
                // Add lines from first field (full field).
                added_lines_cnt = addLinesFromField(p_field_1, 0, field_1_cnt, &last_line);
                // Add padding up to field standard.
                added_inner = addFieldPadding(frasm_f1.frame_number, (target_lines_per_field-field_1_cnt), &last_line);
                added_lines_cnt += added_inner;
                // Reset line number.
                last_line = getSecondFieldLineNum(cur_field_order);
                // Add lines from second field (full field).
                added_lines_cnt += addLinesFromField(p_field_2, 0, field_2_cnt, &last_line);
                // Add padding up to field standard.
                added_outer = addFieldPadding(frasm_f1.frame_number, (target_lines_per_field-field_2_cnt), &last_line);
                added_lines_cnt += added_outer;
            }
        }
        else
        {
#ifdef DI_EN_DBG_OUT
            if(suppress_anylog==false)
            {
                qInfo()<<"[L2B-007] Data anchors: NONE, path: too many lines";
            }
#endif
            // Reset line number.
            last_line = getFirstFieldLineNum(cur_field_order);
            // Check if current frame field fits within standard limits.
            if(field_1_cnt<target_lines_per_field)
            {
                // Add lines from first field (full field).
                added_lines_cnt = addLinesFromField(p_field_1, 0, field_1_cnt, &last_line);
                // Add padding up to field standard.
                added_inner = addFieldPadding(frasm_f1.frame_number, (target_lines_per_field-field_1_cnt), &last_line);
                added_lines_cnt += added_inner;
            }
            else
            {
                // Add lines from first field (cut data from the end up to standard).
                added_lines_cnt = addLinesFromField(p_field_1, 0, target_lines_per_field, &last_line);
            }
            // Reset line number.
            last_line = getSecondFieldLineNum(cur_field_order);
            if(field_2_cnt<target_lines_per_field)
            {
                // Add lines from second field (full field).
                added_lines_cnt += addLinesFromField(p_field_2, 0, field_2_cnt, &last_line);
                // Add padding up to field standard.
                added_outer = addFieldPadding(frasm_f1.frame_number, (target_lines_per_field-field_2_cnt), &last_line);
                added_lines_cnt += added_outer;
            }
            else
            {
                // Add lines from second field (cut data from the end up to standard).
                added_lines_cnt += addLinesFromField(p_field_2, 0, target_lines_per_field, &last_line);
            }
        }
    }

    // Check if trailing lines should be added at the end of the file.
    if(file_end!=false)
    {
        uint8_t add_count;
#ifdef DI_EN_DBG_OUT
        if(suppress_anylog==false)
        {
            qInfo()<<"[L2B-007] File ended, adding trailing padding...";
        }
#endif
        // Set line number.
        last_line = 1;
        // Calculate padding.
        add_count = STC007DataBlock::MIN_DEINT_DATA;
        // Add trailing padding.
        addFieldPadding(frasm_f2.frame_number, add_count, &last_line);
    }

    // Store actual padding (in case if padding was not detected).
    frasm_f1.inner_padding = added_inner;
    frasm_f1.outer_padding = added_outer;

#ifdef DI_EN_DBG_OUT
    if(suppress_anylog==false)
    {
        if((target_lines_per_field!=0)&&((target_lines_per_field*2)!=added_lines_cnt))
        {
            qInfo()<<"[L2B-007] Addded"<<added_lines_cnt<<"lines per frame (WRONG COUNT, should be"<<(target_lines_per_field*2)<<")";
        }
        else
        {
            qInfo()<<"[L2B-007] Addded"<<added_lines_cnt<<"lines per frame";
        }
    }
#endif
}

//------------------------ Temporarily add lines from the field of the next frame to assist full-frame CWD.
bool STC007DataStitcher::fillNextFieldForCWD()
{
    bool suppress_log, lines_added;
    uint16_t field_cnt, last_line, added_lines_cnt;
    std::vector<STC007Line> *p_field;

