Fagear/SDVPCMdecoder/stc007datastitcher.cpp
    lines_added = false;
    suppress_log = ((log_level&LOG_FIELD_ASSEMBLY)==0);

    // Check stitching with the next frame.
    if(frasm_f1.outer_padding_ok!=false)
    {
        // Stitching with the next frame is valid.
        if(frasm_f1.isOrderSet()!=false)
        {
            // Field order is detected for current frame.
            last_line = getFirstFieldLineNum(frasm_f1.field_order);
            if(frasm_f1.isOrderTFF()!=false)
            {
                // Fill top field from the next frame to fit bottom field of the current frame.
                p_field = &frame2_odd;
                field_cnt = frasm_f2.odd_data_lines;
            }
            else
            {
                // Fill bottom field from the next frame to fit top field of the current frame.
                p_field = &frame2_even;
                field_cnt = frasm_f2.even_data_lines;
            }
            if(field_cnt>STC007DataBlock::MIN_DEINT_DATA)
            {
                // No need to fill full field, only cross-frame interleave part.
                field_cnt = STC007DataBlock::MIN_DEINT_DATA;
            }
            // Add lines from selected field.
            added_lines_cnt = addLinesFromField(p_field, 0, field_cnt, &last_line);
#ifdef DI_EN_DBG_OUT
            if(suppress_log==false)
            {
                qInfo()<<"[L2B-007] Added"<<added_lines_cnt<<"lines from the next frame's field to perform CWD";
            }
#endif
            lines_added = true;
        }
    }

    return lines_added;
}

//------------------------ Remove temporarily added lines from the deinterleave buffer after CWD is done.
void STC007DataStitcher::removeNextFieldAfterCWD()
{
    uint16_t remove_cnt;
    remove_cnt = 0;
    while(conv_queue.back().frame_number==frasm_f2.frame_number)
    {
        // Remove lines from the next frame.
        conv_queue.pop_back();
        remove_cnt++;
    }
#ifdef DI_EN_DBG_OUT
    if((log_level&LOG_FIELD_ASSEMBLY)!=0)
    {
        qInfo()<<"[L2B-007] Removed"<<remove_cnt<<"temporary lines from the next frame's field";
    }
#endif
}

//------------------------ Scan ahead for BROKEN data blocks and mask false-positive PCM lines.
uint16_t STC007DataStitcher::patchBrokenLines(std::deque<STC007Line> *in_queue)
{
    bool suppress_log;
    uint8_t broken_max;
    uint16_t buf_size, buf_offset, line_offset, fix_count;
    std::array<uint16_t, (LINES_PER_PAL_FIELD*3)> broken_stat;
    STC007DataBlock pcm_block;

    suppress_log = !((log_level&LOG_FIELD_ASSEMBLY)!=0);
    suppress_log = false;

    // Set parameters for converter.
    lines_to_block.setInput(in_queue);
    lines_to_block.setOutput(&pcm_block);
    lines_to_block.setIgnoreCRC(ignore_CRC);
    lines_to_block.setForcedErrorCheck(!ignore_CRC);
    lines_to_block.setPCorrection(enable_P_code);
    lines_to_block.setQCorrection(enable_Q_code);
    lines_to_block.setCWDCorrection(false);
    lines_to_block.setResMode(getDataBlockResolution(in_queue, 0));

    fix_count = buf_offset = 0;
    broken_max = 0;
    broken_stat.fill(0);
    buf_size = in_queue->size();

    // Dump buffered data into converter.
    while(buf_offset<(buf_size-STC007DataBlock::MIN_DEINT_DATA))
    {
        // Reset data block structure.
        pcm_block.clear();

        // Fill up data block, performing de-interleaving, convert lines to data blocks.
        if(lines_to_block.processBlock(buf_offset)!=STC007Deinterleaver::DI_RET_OK)
        {
            break;
        }

        // Perform BROKEN data detection.
        if(pcm_block.isDataBroken()!=false)
        {
            // Every source line can be false positive.
            // Put number of source lines into stats.
            line_offset = (buf_offset+STC007DataBlock::LINE_L0);
            if((*in_queue)[line_offset].isCRCValid()!=false)
            {
                broken_stat[line_offset]++;
                if(broken_stat[line_offset]>broken_max)
                {
                    broken_max = broken_stat[line_offset];
                }
            }
            line_offset = (buf_offset+STC007DataBlock::LINE_R0);
            if((*in_queue)[line_offset].isCRCValid()!=false)
            {
                broken_stat[line_offset]++;
                if(broken_stat[line_offset]>broken_max)
                {
                    broken_max = broken_stat[line_offset];
                }
            }
            line_offset = (buf_offset+STC007DataBlock::LINE_L1);
            if((*in_queue)[line_offset].isCRCValid()!=false)
            {
                broken_stat[line_offset]++;
                if(broken_stat[line_offset]>broken_max)
                {
                    broken_max = broken_stat[line_offset];
                }
            }
            line_offset = (buf_offset+STC007DataBlock::LINE_R1);
            if((*in_queue)[line_offset].isCRCValid()!=false)
            {
                broken_stat[line_offset]++;
                if(broken_stat[line_offset]>broken_max)
                {
                    broken_max = broken_stat[line_offset];
                }
            }
            line_offset = (buf_offset+STC007DataBlock::LINE_L2);
            if((*in_queue)[line_offset].isCRCValid()!=false)
            {
                broken_stat[line_offset]++;
                if(broken_stat[line_offset]>broken_max)
                {
                    broken_max = broken_stat[line_offset];
                }
            }
            line_offset = (buf_offset+STC007DataBlock::LINE_R2);
            if((*in_queue)[line_offset].isCRCValid()!=false)
            {
                broken_stat[line_offset]++;
                if(broken_stat[line_offset]>broken_max)
                {
                    broken_max = broken_stat[line_offset];
                }
            }
            line_offset = (buf_offset+STC007DataBlock::LINE_P0);
            if((*in_queue)[line_offset].isCRCValid()!=false)
            {
                broken_stat[line_offset]++;
                if(broken_stat[line_offset]>broken_max)
                {
                    broken_max = broken_stat[line_offset];
                }
            }
            line_offset = (buf_offset+STC007DataBlock::LINE_Q0);
            if((*in_queue)[line_offset].isCRCValid()!=false)
            {
                broken_stat[line_offset]++;
                if(broken_stat[line_offset]>broken_max)
                {
                    broken_max = broken_stat[line_offset];
                }
            }
            fix_count++;
#ifdef DI_EN_DBG_OUT
            if(suppress_log==false)
            {
                QString log_line;
                log_line.sprintf("[L2B-007] Broken block [%03u] from frames [%03u:%03u], valid [%03u,%03u,%03u,%03u,%03u,%03u,%03u,%03u], lines [%03u,%03u,%03u,%03u,%03u,%03u,%03u,%03u], offsets [%03u,%03u,%03u,%03u,%03u,%03u,%03u,%03u], count [%03u,%03u,%03u,%03u,%03u,%03u,%03u,%03u]",
                                 fix_count,
                                 pcm_block.getStartFrame(), pcm_block.getStopFrame(),
                                 (*in_queue)[(buf_offset+STC007DataBlock::LINE_L0)].isCRCValid(),
                                 (*in_queue)[(buf_offset+STC007DataBlock::LINE_R0)].isCRCValid(),
                                 (*in_queue)[(buf_offset+STC007DataBlock::LINE_L1)].isCRCValid(),
                                 (*in_queue)[(buf_offset+STC007DataBlock::LINE_R1)].isCRCValid(),
                                 (*in_queue)[(buf_offset+STC007DataBlock::LINE_L2)].isCRCValid(),
                                 (*in_queue)[(buf_offset+STC007DataBlock::LINE_R2)].isCRCValid(),
                                 (*in_queue)[(buf_offset+STC007DataBlock::LINE_P0)].isCRCValid(),
                                 (*in_queue)[(buf_offset+STC007DataBlock::LINE_Q0)].isCRCValid(),
                                 (*in_queue)[(buf_offset+STC007DataBlock::LINE_L0)].line_number,
                                 (*in_queue)[(buf_offset+STC007DataBlock::LINE_R0)].line_number,
                                 (*in_queue)[(buf_offset+STC007DataBlock::LINE_L1)].line_number,
                                 (*in_queue)[(buf_offset+STC007DataBlock::LINE_R1)].line_number,
                                 (*in_queue)[(buf_offset+STC007DataBlock::LINE_L2)].line_number,
                                 (*in_queue)[(buf_offset+STC007DataBlock::LINE_R2)].line_number,
                                 (*in_queue)[(buf_offset+STC007DataBlock::LINE_P0)].line_number,
                                 (*in_queue)[(buf_offset+STC007DataBlock::LINE_Q0)].line_number,
                                 (buf_offset+STC007DataBlock::LINE_L0),
                                 (buf_offset+STC007DataBlock::LINE_R0),
                                 (buf_offset+STC007DataBlock::LINE_L1),
                                 (buf_offset+STC007DataBlock::LINE_R1),
                                 (buf_offset+STC007DataBlock::LINE_L2),
                                 (buf_offset+STC007DataBlock::LINE_R2),
                                 (buf_offset+STC007DataBlock::LINE_P0),
                                 (buf_offset+STC007DataBlock::LINE_Q0),
                                 broken_stat[buf_offset+STC007DataBlock::LINE_L0],
                                 broken_stat[buf_offset+STC007DataBlock::LINE_R0],
                                 broken_stat[buf_offset+STC007DataBlock::LINE_L1],
                                 broken_stat[buf_offset+STC007DataBlock::LINE_R1],
                                 broken_stat[buf_offset+STC007DataBlock::LINE_L2],
                                 broken_stat[buf_offset+STC007DataBlock::LINE_R2],
                                 broken_stat[buf_offset+STC007DataBlock::LINE_P0],
                                 broken_stat[buf_offset+STC007DataBlock::LINE_Q0]);
                qInfo()<<log_line;
            }
#endif
        }
        // Go to the next line in the buffer.
        buf_offset++;
    }
    // Check if there is enough broken block encounters per line.
    if(broken_max>2)
    {
        std::vector<uint16_t> filt_stat;
        for(buf_offset=0;buf_offset<(LINES_PER_PAL_FIELD*3);buf_offset++)
        {
            if((broken_stat[buf_offset]==broken_max)&&((*in_queue)[buf_offset].isCRCValid()!=false))
            {
                filt_stat.push_back(buf_offset);
            }
        }
        if((filt_stat.size()>0)&&(filt_stat.size()<STC007DataBlock::INTERLEAVE_OFS))
        {
#ifdef DI_EN_DBG_OUT
            if(suppress_log==false)
            {
                qInfo()<<"[L2B-007] Lines with BROKEN blocks:";
                QString index_line, frame_line, line_line, broken_line, tmp;
                for(buf_offset=0;buf_offset<filt_stat.size();buf_offset++)
                {
                    tmp.sprintf("%03u", filt_stat[buf_offset]);
                    index_line += "|"+tmp;
                    tmp.sprintf("%03u", in_queue->at(filt_stat[buf_offset]).frame_number);
                    frame_line += "|"+tmp;
                    tmp.sprintf("%03u", in_queue->at(filt_stat[buf_offset]).line_number);
                    line_line += "|"+tmp;
                    tmp.sprintf("%03u", broken_stat[filt_stat[buf_offset]]);
                    broken_line += "|"+tmp;
                }
                qInfo()<<"[L2B-007] Lines, causing BROKEN blocks:";
                qInfo()<<"[L2B-007] Offset: "<<index_line;
                qInfo()<<"[L2B-007] Frame:  "<<frame_line;
                qInfo()<<"[L2B-007] Line:   "<<line_line;
                qInfo()<<"[L2B-007] Broken: "<<broken_line;
            }
#endif
            /*for(buf_offset=0;buf_offset<filt_stat.size();buf_offset++)
            {
                (*in_queue)[filt_stat[buf_offset]].setSilent();
                (*in_queue)[filt_stat[buf_offset]].setInvalidCRC();
                (*in_queue)[filt_stat[buf_offset]].setForcedBad();
            }*/
        }
    }

