Fagear/SDVPCMdecoder/stc007datastitcher.cpp
    return 0;
}

//------------------------ Scan ahead for BROKEN data blocks and mask false-positive PCM lines.
uint16_t STC007DataStitcher::patchBrokenLinesOld(std::deque<STC007Line> *in_queue)
{
    bool suppress_log;
    uint8_t brk_count;
    uint16_t buf_size, buf_offset;
    uint16_t fix_count, brk_ofs, trg_line_ofs;
    STC007DataBlock pcm_block;

    suppress_log = !((log_level&LOG_FIELD_ASSEMBLY)!=0);
    //suppress_log = false;

    // Set parameters for converter.
    lines_to_block.setInput(in_queue);
    lines_to_block.setOutput(&pcm_block);
    lines_to_block.setIgnoreCRC(ignore_CRC);
    lines_to_block.setForcedErrorCheck(!ignore_CRC);
    lines_to_block.setPCorrection(enable_P_code);
    lines_to_block.setQCorrection(enable_Q_code);
    lines_to_block.setCWDCorrection(false);
    lines_to_block.setResMode(getDataBlockResolution(in_queue, 0));

    fix_count = buf_offset = 0;
    buf_size = in_queue->size();

    // Dump buffered data into converter.
    while(buf_offset<(buf_size-STC007DataBlock::MIN_DEINT_DATA))
    {
        // Reset data block structure.
        pcm_block.clear();

        // Fill up data block, performing de-interleaving, convert lines to data blocks.
        if(lines_to_block.processBlock(buf_offset)!=STC007Deinterleaver::DI_RET_OK)
        {
            break;
        }

        // Perform BROKEN data detection.
        if(pcm_block.isDataBroken()!=false)
        {
            brk_count = 1;
            if((enable_Q_code!=false)
               &&(pcm_block.getResolution()==STC007DataBlock::RES_14BIT)
               &&(pcm_block.isWordLineCRCOk(STC007DataBlock::WORD_Q0)!=false))
            {
                // Pick PCM line with Q-code.
                trg_line_ofs = buf_offset+STC007DataBlock::MIN_DEINT_DATA;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    QString log_line;
                    log_line.sprintf("[L2B-007] Detected BROKEN data block with line offset %u [%03u-%03u...%03u-%03u] problem seems to be in PCM line [%03u-%03u] for Q-word",
                                     buf_offset,
                                     (*in_queue)[buf_offset].frame_number,
                                     (*in_queue)[buf_offset].line_number,
                                     pcm_block.getStopFrame(),
                                     pcm_block.getStopLine(),
                                     (*in_queue)[trg_line_ofs].frame_number,
                                     (*in_queue)[trg_line_ofs].line_number);
                    qInfo()<<log_line;
                }
#endif
            }
            else
            {
                // Pick PCM line with P-code.
                trg_line_ofs = buf_offset+STC007DataBlock::MIN_DEINT_DATA-STC007DataBlock::INTERLEAVE_OFS;
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    QString log_line;
                    log_line.sprintf("[L2B-007] Detected BROKEN data block with line offset %u [%03u-%03u...%03u-%03u] problem seems to be in PCM line [%03u-%03u] for P-word",
                                     buf_offset,
                                     (*in_queue)[buf_offset].frame_number,
                                     (*in_queue)[buf_offset].line_number,
                                     pcm_block.getStopFrame(),
                                     pcm_block.getStopLine(),
                                     (*in_queue)[trg_line_ofs].frame_number,
                                     (*in_queue)[trg_line_ofs].line_number);
                    qInfo()<<log_line;
                }
#endif
            }

            brk_ofs = buf_offset;
            // Cycle through all data blocks that will come next, containing the same PCM line.
            for(uint8_t iwork=0;iwork<(STC007DataBlock::WORD_CNT-1);iwork++)
            {
                // Take line coordinate of the word source and get coordinate of the next data block, using the same line for next word up.
                brk_ofs += STC007DataBlock::INTERLEAVE_OFS;
                // Check that that block is within buffer limits.
                if(brk_ofs<buf_size)
                {
                    // Assemble and check next data block with the same PCM line.
                    pcm_block.clear();
                    lines_to_block.processBlock(brk_ofs);
                    if(pcm_block.isDataBroken()!=false)
                    {
                        // Data in the block is BROKEN.
#ifdef DI_EN_DBG_OUT
                        if(suppress_log==false)
                        {
                            QString log_line;
                            log_line.sprintf("[L2B-007] Block at line offset %u [%03u-%03u...%03u-%03u]: BROKEN as well",
                                             brk_ofs,
                                             pcm_block.getStartFrame(),
                                             pcm_block.getStartLine(),
                                             pcm_block.getStopFrame(),
                                             pcm_block.getStopLine());
                            qInfo()<<log_line;
                        }
#endif
                        // Increase block counter.
                        brk_count++;
                    }
                    else if(pcm_block.isBlockValid()!=false)
                    {
                        // Data block is valid...
                        if(pcm_block.canForceCheck()==false)
                        {
                            // ...but data can not be force-checked, so it can be BROKEN.
#ifdef DI_EN_DBG_OUT
                            if(suppress_log==false)
                            {
                                QString log_line;
                                log_line.sprintf("[L2B-007] Block at line offset %u [%03u-%03u...%03u-%03u]: not checkable, suspicious",
                                                 brk_ofs,
                                                 pcm_block.getStartFrame(),
                                                 pcm_block.getStartLine(),
                                                 pcm_block.getStopFrame(),
                                                 pcm_block.getStopLine());
                                qInfo()<<log_line;
                            }
#endif
                            // Increase block counter.
                            brk_count++;
                        }
#ifdef DI_EN_DBG_OUT
                        else if(pcm_block.isSilent()!=false)
                        {
                            // ...but all samples are silent.
                            if(suppress_log==false)
                            {
                                QString log_line;
                                log_line.sprintf("[L2B-007] Block at line offset %u [%03u-%03u...%03u-%03u]: silent, suspicious",
                                                 brk_ofs,
                                                 pcm_block.getStartFrame(),
                                                 pcm_block.getStartLine(),
                                                 pcm_block.getStopFrame(),
                                                 pcm_block.getStopLine());
                                qInfo()<<log_line;
                            }
                        }
                        else
                        {
                            if(suppress_log==false)
                            {
                                QString log_line;
                                log_line.sprintf("[L2B-007] Block at line offset %u [%03u-%03u...%03u-%03u]: OK",
                                                 brk_ofs,
                                                 pcm_block.getStartFrame(),
                                                 pcm_block.getStartLine(),
                                                 pcm_block.getStopFrame(),
                                                 pcm_block.getStopLine());
                                qInfo()<<log_line;
                            }
                        }
#endif
                    }
                    else
                    {
                        // Data block is invalid.
#ifdef DI_EN_DBG_OUT
                        if(suppress_log==false)
                        {
                            QString log_line;
                            log_line.sprintf("[L2B-007] Block at line offset %u [%03u-%03u...%03u-%03u]: invalid (%u errors)",
                                             brk_ofs,
                                             pcm_block.getStartFrame(),
                                             pcm_block.getStartLine(),
                                             pcm_block.getStopFrame(),
                                             pcm_block.getStopLine(),
                                             pcm_block.getErrorsTotalSource());
                            qInfo()<<log_line;
                        }
#endif
                        // Increase block counter.
                        brk_count++;
                    }
                }
                else
                {
                    // Buffer is depleted.
                    break;
                }
            }

            // Check counter against the limit.
            if(brk_count>=6)
            {
#ifdef DI_EN_DBG_OUT
                if(suppress_log==false)
                {
                    QString log_line;
                    log_line.sprintf("[L2B-007] Number of affected blocks with presumably BROKEN line: %01u",
                                     brk_count);
                    log_line.sprintf("[L2B-007] Forcing line [%03u-%03u] BAD",
                                     (*in_queue)[trg_line_ofs].frame_number,
                                     (*in_queue)[trg_line_ofs].line_number);
                    qInfo()<<log_line;
                }
#endif
                // Force PCM line bad.
                (*in_queue)[trg_line_ofs].setInvalidCRC();
                (*in_queue)[trg_line_ofs].setForcedBad();
                fix_count++;
            }
        }
        // Go to the next line in the buffer.
        buf_offset++;
    }

#ifdef DI_EN_DBG_OUT
    if(suppress_log==false)
    {
        if(fix_count>0)
        {
            qInfo()<<"[L2B-007] Patched"<<fix_count<<"false-positive lines";
        }
    }
#endif

