Fagear/SDVPCMdecoder/stc007datastitcher.cpp
    return fix_count;
}

//------------------------ Perform Cross-Word Decoding, propagating fixed samples back to the PCM lines.
uint16_t STC007DataStitcher::performCWD(std::deque<STC007Line> *in_queue)
{
    bool suppress_log;
    uint8_t max_fixable;
    uint16_t buf_size, buf_ofs, line_ofs, line_fix_cnt;
    uint16_t old_word, old_bitword, old_src_crc, old_clc_crc, word_patch_cnt;
    STC007DataBlock pcm_block;

    //return;

    suppress_log = !((log_level&LOG_FIELD_ASSEMBLY)!=0);
    //suppress_log = false;

    // Set parameters for converter.
    lines_to_block.setInput(in_queue);
    lines_to_block.setOutput(&pcm_block);
    //lines_to_block.setLogLevel(STC007Deinterleaver::LOG_PROCESS|STC007Deinterleaver::LOG_ERROR_CORR);
    lines_to_block.setIgnoreCRC(ignore_CRC);
    lines_to_block.setForcedErrorCheck(!ignore_CRC);
    lines_to_block.setPCorrection(enable_P_code);
    lines_to_block.setQCorrection(enable_Q_code);
    lines_to_block.setCWDCorrection(true);
    lines_to_block.setResMode(getDataBlockResolution(in_queue, 0));

    line_fix_cnt = word_patch_cnt = buf_ofs = 0;
    buf_size = in_queue->size();

    // Dump buffered data into converter.
    while(buf_ofs<(buf_size-STC007DataBlock::MIN_DEINT_DATA))
    {
        // Reset data block structure.
        pcm_block.clear();

        // Fill up data block, performing de-interleaving, convert lines to data blocks.
        if(lines_to_block.processBlock(buf_ofs)!=STC007Deinterleaver::DI_RET_OK)
        {
            // Exit cycle when not enough data left.
            break;
        }

        // Determine if Q-word can be fixed in current mode.
        if((enable_Q_code==false)||(pcm_block.getResolution()==STC007DataBlock::RES_16BIT))
        {
            // Q-code can not be fixed, skip checking it.
            max_fixable = STC007DataBlock::WORD_P0;
        }
        else
        {
            max_fixable = STC007DataBlock::WORD_Q0;
        }

        // Check if data block is valid and samples were fixed.
        if((pcm_block.isBlockValid()!=false)&&(pcm_block.isDataFixed()!=false))
        {
            //qInfo()<<QString::fromStdString(pcm_block.dumpContentString());
            // Cycle through all fixable words.
            for(uint8_t word_idx=STC007DataBlock::WORD_L0;word_idx<=max_fixable;word_idx++)
            {
                // Check if CRC of the word was bad.
                if(pcm_block.isWordLineCRCOk(word_idx)==false)
                {
                    // Calculate source PCM line offset in the buffer for the fixed sample.
                    line_ofs = buf_ofs+word_idx*STC007DataBlock::INTERLEAVE_OFS;
#ifdef DI_EN_DBG_OUT
                    if(suppress_log==false)
                    {
                        QString log_line;
                        log_line.sprintf("[L2B-007] Block [%03u-%03u...%03u-%03u] has fixed sample #[%u] from line [%03u-%03u]",
                                         pcm_block.getStartFrame(),
                                         pcm_block.getStartLine(),
                                         pcm_block.getStopFrame(),
                                         pcm_block.getStopLine(),
                                         word_idx,
                                         (*in_queue)[line_ofs].frame_number,
                                         (*in_queue)[line_ofs].line_number);
                        qInfo()<<log_line;
                    }
#endif
                    // Check if source PCM line is not a filler one and has an invalid CRC in the first place.
                    //if(((*in_queue)[line_ofs].isCRCValidIgnoreForced()==false)&&((*in_queue)[line_ofs].getSourceCRC()!=(0xFFFF&(~STC007Line::CRC_SILENT))))
                    if(((*in_queue)[line_ofs].isCRCValidIgnoreForced()==false)
                       &&((*in_queue)[line_ofs].coords.areValid()!=false)
                       &&((*in_queue)[line_ofs].isForcedBad()==false)
                       &&((*in_queue)[line_ofs].frame_number!=frasm_f2.frame_number))
                    {
                        // Check audio sample resolution.
                        if(pcm_block.getResolution()==STC007DataBlock::RES_14BIT)
                        {
                            // Propagate back corrections for 14-bit mode.
                            // Save old word content and old CRC for comparison.
                            old_word = (*in_queue)[line_ofs].getWord(word_idx);
                            old_src_crc = (*in_queue)[line_ofs].getSourceCRC();
                            old_clc_crc = (*in_queue)[line_ofs].getCalculatedCRC();
                            // Dump PCM line before patching.
                            //qInfo()<<QString::fromStdString((*in_queue)[line_ofs].dumpContentString());
                            // Check if "fixed" word differs from the old value.
                            if(old_word!=pcm_block.getWord(word_idx))
                            {
                                // Put fixed word back into the PCM line in the queue.
                                (*in_queue)[line_ofs].setWord(word_idx, pcm_block.getWord(word_idx), (*in_queue)[line_ofs].isWordCRCOk(word_idx));
                                // Re-calculate line CRC.
                                (*in_queue)[line_ofs].calcCRC();
                                // Set word as fixed.
                                (*in_queue)[line_ofs].setFixed(word_idx);
                                // Count number of words that were fixed.
                                word_patch_cnt++;
                                // Check if PCM line CRC stayed invalid.
                                if((*in_queue)[line_ofs].isCRCValidIgnoreForced()!=false)
                                {
                                    // CRC became valid!
                                    for(uint8_t word=STC007Line::WORD_L_SH0;word<=STC007Line::WORD_CRCC_SH0;word++)
                                    {
                                        // Set all of the word CRC flags in the line as valid.
                                        (*in_queue)[line_ofs].setFixed(word);
                                    }
                                    // Count number of fixed PCM lines.
                                    line_fix_cnt++;
#ifdef DI_EN_DBG_OUT
                                    if(suppress_log==false)
                                    {
                                        QString log_line;
                                        log_line.sprintf("[L2B-007] Replaced #[%u] word [0x%04x] with [0x%04x] in PCM line, PCM line [%03u-%03u] now has valid CRC [0x%04x] (was [0x%04x])!!!",
                                                         word_idx,
                                                         old_word,
                                                         pcm_block.getWord(word_idx),
                                                         (*in_queue)[line_ofs].frame_number,
                                                         (*in_queue)[line_ofs].line_number,
                                                         (*in_queue)[line_ofs].getCalculatedCRC(),
                                                         old_clc_crc);
                                        qInfo()<<log_line;
                                    }
#endif
                                }
#ifdef DI_EN_DBG_OUT
                                else
                                {
                                    // Not all words in the line are fixed yet.
                                    if(suppress_log==false)
                                    {
                                        QString log_line;
                                        log_line.sprintf("[L2B-007] Replaced #[%u] word [0x%04x] with [0x%04x] in PCM line, bad CRC [0x%04x] remained bad as [0x%04x]",
                                                         word_idx,
                                                         old_word,
                                                         pcm_block.getWord(word_idx),
                                                         old_clc_crc,
                                                         (*in_queue)[line_ofs].getCalculatedCRC());
                                        qInfo()<<log_line;
                                    }
                                }
#endif
                            }
                            else
                            {
                                // Word stayed the same (was the same from the source).
                                // Set word as fixed.
                                (*in_queue)[line_ofs].setFixed(word_idx);
                                // Count number of words that were fixed.
                                word_patch_cnt++;
#ifdef DI_EN_DBG_OUT
                                if(suppress_log==false)
                                {
                                    QString log_line;
                                    log_line.sprintf("[L2B-007] Updated #[%u] word [0x%04x] in PCM line [%03u-%03u] to be valid",
                                                     word_idx,
                                                     old_word,
                                                     (*in_queue)[line_ofs].frame_number,
                                                     (*in_queue)[line_ofs].line_number);
                                    qInfo()<<log_line;
                                }
#endif
                            }
                            // Re-check line CRC.
                            if((*in_queue)[line_ofs].isCRCValidIgnoreForced()==false)
                            {
                                // CRC stayed invalid.
                                bool all_fixed;
                                all_fixed = true;
                                // Check if all words are already fixed but CRC is still bad.
                                for(uint8_t word=STC007Line::WORD_L_SH0;word<=STC007Line::WORD_Q_SH336;word++)
                                {
                                    if((*in_queue)[line_ofs].isWordValid(word)==false)
                                    {
                                        // There are still invalid words.
                                        all_fixed = false;
                                        break;
                                    }
                                }
                                if(all_fixed!=false)
                                {
                                    // All words are fixed, but CRC is still invalid.
                                    // This must be dropout on the CRC word itself.
                                    // Re-calculate line CRC.
                                    (*in_queue)[line_ofs].calcCRC();
                                    // Replace CRC with fixed re-calculated one.
                                    (*in_queue)[line_ofs].setSourceCRC((*in_queue)[line_ofs].getCalculatedCRC());
                                    (*in_queue)[line_ofs].setFixed(STC007Line::WORD_CRCC_SH0);
                                    // Count number of fixed PCM lines.
                                    line_fix_cnt++;
#ifdef DI_EN_DBG_OUT
                                    if(suppress_log==false)
                                    {
                                        QString log_line;
                                        log_line.sprintf("[L2B-007] Replaced CRC word in PCM line, PCM line [%03u-%03u] now has valid CRC [0x%04x] (was [0x%04x])!!!",
                                                         (*in_queue)[line_ofs].frame_number,
                                                         (*in_queue)[line_ofs].line_number,
                                                         (*in_queue)[line_ofs].getSourceCRC(),
                                                         old_src_crc);
                                        qInfo()<<log_line;
                                    }
#endif
                                }
                            }
                        }
                        else
                        {
                            // Propagate back corrections for 16-bit mode.
                            uint16_t new_word, new_bitword;
                            // Save old word content and old CRC for comparison.
                            old_word = (*in_queue)[line_ofs].getWord(word_idx);
                            old_bitword = (*in_queue)[line_ofs].getWord(STC007DataBlock::WORD_Q0);
                            old_src_crc = (*in_queue)[line_ofs].getSourceCRC();
                            old_clc_crc = (*in_queue)[line_ofs].getCalculatedCRC();
                            // Split 16-bit word from data block into 14+2 bit parts.
                            new_word = pcm_block.getWord(word_idx);
                            new_bitword = new_word&STC007DataBlock::F1_S_MASK;      // 2-bit LSB part for S-word in place of Q-word.
                            new_word = (new_word>>STC007DataBlock::F1_WORD_OFS);    // 14-bit MSB part.
                            // Move LSB bits.
                            if(word_idx==STC007DataBlock::WORD_P0)
                            {
                                new_bitword = (new_bitword<<STC007DataBlock::F1_S_P0_OFS);
                                old_bitword = old_bitword&(STC007DataBlock::F1_S_MASK<<STC007DataBlock::F1_S_P0_OFS);
                            }
                            else if(word_idx==STC007DataBlock::WORD_R2)
                            {
                                new_bitword = (new_bitword<<STC007DataBlock::F1_S_R2_OFS);
                                old_bitword = old_bitword&(STC007DataBlock::F1_S_MASK<<STC007DataBlock::F1_S_R2_OFS);
                            }
                            else if(word_idx==STC007DataBlock::WORD_L2)
                            {
                                new_bitword = (new_bitword<<STC007DataBlock::F1_S_L2_OFS);
                                old_bitword = old_bitword&(STC007DataBlock::F1_S_MASK<<STC007DataBlock::F1_S_L2_OFS);
                            }
                            else if(word_idx==STC007DataBlock::WORD_R1)
                            {
                                new_bitword = (new_bitword<<STC007DataBlock::F1_S_R1_OFS);
                                old_bitword = old_bitword&(STC007DataBlock::F1_S_MASK<<STC007DataBlock::F1_S_R1_OFS);
                            }
                            else if(word_idx==STC007DataBlock::WORD_L1)
                            {
                                new_bitword = (new_bitword<<STC007DataBlock::F1_S_L1_OFS);
                                old_bitword = old_bitword&(STC007DataBlock::F1_S_MASK<<STC007DataBlock::F1_S_L1_OFS);
                            }
                            else if(word_idx==STC007DataBlock::WORD_R0)
                            {
                                new_bitword = (new_bitword<<STC007DataBlock::F1_S_R0_OFS);
                                old_bitword = old_bitword&(STC007DataBlock::F1_S_MASK<<STC007DataBlock::F1_S_R0_OFS);
                            }
                            else if(word_idx==STC007DataBlock::WORD_L0)
                            {
                                new_bitword = (new_bitword<<STC007DataBlock::F1_S_L0_OFS);
                                old_bitword = old_bitword&(STC007DataBlock::F1_S_MASK<<STC007DataBlock::F1_S_L0_OFS);
                            }
#ifdef DI_EN_DBG_OUT
                            if(suppress_log==false)
                            {
                                QString log_line;
                                log_line.sprintf("[L2B-007] Old word [0x%04x]+[0x%04x], new word [0x%04x]+[0x%04x]",
                                                 old_word, old_bitword, new_word, new_bitword);
                                qInfo()<<log_line;
                            }
#endif
                            // Check if "fixed" word differs from the old value.
                            if(old_word!=new_word)
                            {
                                // Put fixed word back into the PCM line.
                                (*in_queue)[line_ofs].setWord(word_idx, new_word, (*in_queue)[line_ofs].isWordCRCOk(word_idx));
                                // Re-calculate line CRC.
                                (*in_queue)[line_ofs].calcCRC();
                                // Set word as fixed.
                                (*in_queue)[line_ofs].setFixed(word_idx);
                                // Count number of words that were fixed.
                                word_patch_cnt++;
                                // Check if PCM line CRC stayed invalid.
                                if((*in_queue)[line_ofs].isCRCValidIgnoreForced()!=false)
                                {
                                    // CRC became valid!
                                    for(uint8_t word=STC007Line::WORD_L_SH0;word<=STC007Line::WORD_CRCC_SH0;word++)
                                    {
                                        // Set all of the word CRC flags in the line as valid.
                                        (*in_queue)[line_ofs].setFixed(word);
                                    }
                                    // Count number of fixed PCM lines.
                                    line_fix_cnt++;
#ifdef DI_EN_DBG_OUT
                                    if(suppress_log==false)
                                    {
                                        QString log_line;
                                        log_line.sprintf("[L2B-007] Replaced #[%u] word [0x%04x] with [0x%04x] in PCM line, PCM line [%03u-%03u] now has valid CRC [0x%04x] (was [0x%04x])!!!",
                                                         word_idx,
                                                         old_word,
                                                         new_word,
                                                         (*in_queue)[line_ofs].frame_number,
                                                         (*in_queue)[line_ofs].line_number,
                                                         (*in_queue)[line_ofs].getCalculatedCRC(),
                                                         old_clc_crc);
                                        qInfo()<<log_line;
                                    }
#endif
                                }
#ifdef DI_EN_DBG_OUT
                                else
                                {
                                    // CRC stayed invalid.
                                    if(suppress_log==false)
                                    {
                                        QString log_line;
                                        log_line.sprintf("[L2B-007] Replaced #[%u] word [0x%04x] with [0x%04x] in PCM line, bad CRC [0x%04x] remained bad as [0x%04x]",
                                                         word_idx,
                                                         old_word,
                                                         new_word,
                                                         old_src_crc,
                                                         (*in_queue)[line_ofs].getCalculatedCRC());
                                        qInfo()<<log_line;
                                    }
                                }
#endif
                            }
                            // Check if previous correction was successfull.
                            if((*in_queue)[line_ofs].isCRCValidIgnoreForced()==false)
                            {
                                // Line is still invalid.
                                // Update "old CRC".
                                old_src_crc = (*in_queue)[line_ofs].getSourceCRC();
                                // Check if "fixed" S-word differs from the old value.
                                if(old_bitword!=new_bitword)
                                {
                                    // Get old state of S-word.
                                    old_word = old_bitword = (*in_queue)[line_ofs].getWord(STC007DataBlock::WORD_Q0);
                                    // Mask affected bits.
                                    if(word_idx==STC007DataBlock::WORD_P0)
                                    {
                                        old_bitword = old_bitword&(~(STC007DataBlock::F1_S_MASK<<STC007DataBlock::F1_S_P0_OFS));
                                    }
                                    else if(word_idx==STC007DataBlock::WORD_R2)
                                    {
                                        old_bitword = old_bitword&(~(STC007DataBlock::F1_S_MASK<<STC007DataBlock::F1_S_R2_OFS));
                                    }
                                    else if(word_idx==STC007DataBlock::WORD_L2)
                                    {
                                        old_bitword = old_bitword&(~(STC007DataBlock::F1_S_MASK<<STC007DataBlock::F1_S_L2_OFS));
                                    }
                                    else if(word_idx==STC007DataBlock::WORD_R1)
                                    {
                                        old_bitword = old_bitword&(~(STC007DataBlock::F1_S_MASK<<STC007DataBlock::F1_S_R1_OFS));
                                    }
                                    else if(word_idx==STC007DataBlock::WORD_L1)
                                    {
                                        old_bitword = old_bitword&(~(STC007DataBlock::F1_S_MASK<<STC007DataBlock::F1_S_L1_OFS));
                                    }
                                    else if(word_idx==STC007DataBlock::WORD_R0)
                                    {
                                        old_bitword = old_bitword&(~(STC007DataBlock::F1_S_MASK<<STC007DataBlock::F1_S_R0_OFS));
                                    }
                                    else if(word_idx==STC007DataBlock::WORD_L0)
                                    {
                                        old_bitword = old_bitword&(~(STC007DataBlock::F1_S_MASK<<STC007DataBlock::F1_S_L0_OFS));
                                    }
                                    // Put fixed word back into the PCM line.
                                    (*in_queue)[line_ofs].setWord(STC007DataBlock::WORD_Q0, (old_bitword|new_bitword), (*in_queue)[line_ofs].isWordCRCOk(STC007DataBlock::WORD_Q0));
                                    // Re-calculate line CRC.
                                    (*in_queue)[line_ofs].calcCRC();
                                    // Check if PCM line CRC stayed invalid.
                                    if((*in_queue)[line_ofs].isCRCValidIgnoreForced()!=false)
                                    {
                                        // CRC became valid!
                                        for(uint8_t word=STC007Line::WORD_L_SH0;word<=STC007Line::WORD_CRCC_SH0;word++)
                                        {
                                            // Set all of the word CRC flags in the line as valid.
                                            (*in_queue)[line_ofs].setFixed(word);
                                        }
                                        // Count number of fixed PCM lines.
                                        line_fix_cnt++;
#ifdef DI_EN_DBG_OUT
                                        if(suppress_log==false)
                                        {
                                            QString log_line;
