Fagear/SDVPCMdecoder/stc007datastitcher.cpp
                                            log_line.sprintf("[L2B-007] Replaced #[%u] word [0x%04x] with [0x%04x] in PCM line, PCM line [%03u-%03u] now has valid CRC [0x%04x] (was [0x%04x])!!!",
                                                             STC007DataBlock::WORD_Q0,
                                                             old_word,
                                                             (*in_queue)[line_ofs].getWord(STC007DataBlock::WORD_Q0),
                                                             (*in_queue)[line_ofs].frame_number,
                                                             (*in_queue)[line_ofs].line_number,
                                                             (*in_queue)[line_ofs].getCalculatedCRC(),
                                                             old_src_crc);
                                            qInfo()<<log_line;
                                        }
#endif
                                    }
#ifdef DI_EN_DBG_OUT
                                    else
                                    {
                                        // CRC stayed invalid.
                                        if(suppress_log==false)
                                        {
                                            QString log_line;
                                            log_line.sprintf("[L2B-007] Replaced #[%u] word [0x%04x] with [0x%04x] in PCM line, bad CRC [0x%04x] remained bad as [0x%04x]",
                                                             STC007DataBlock::WORD_Q0,
                                                             old_word,
                                                             (*in_queue)[line_ofs].getWord(STC007DataBlock::WORD_Q0),
                                                             old_src_crc,
                                                             (*in_queue)[line_ofs].getCalculatedCRC());
                                            qInfo()<<log_line;
                                        }
                                    }
#endif
                                }
                            }
                        }
                    }
                    else
                    {
                        if((*in_queue)[line_ofs].isCRCValid()!=false)
                        {
                            if(pcm_block.getResolution()==STC007DataBlock::RES_14BIT)
                            {
                                old_word = (*in_queue)[line_ofs].getWord(word_idx);
                                if(old_word!=pcm_block.getWord(word_idx))
                                {
                                    (*in_queue)[line_ofs].setForcedBad();
#ifdef DI_EN_DBG_OUT
                                    if(suppress_log==false)
                                    {
                                        QString log_line;
                                        log_line.sprintf("[L2B-007] Valid word mismatch [0x%04x]<>[0x%04x] in PCM line [%04u:%03u]!",
                                                         old_word,
                                                         (*in_queue)[line_ofs].getWord(word_idx),
                                                         (*in_queue)[line_ofs].frame_number,
                                                         (*in_queue)[line_ofs].line_number);
                                        qInfo()<<log_line;
                                    }
#endif
                                    //qWarning()<<DBG_ANCHOR<<"[L2B-007] CWD propagation valid word mismatch!";
                                }
                            }
                        }
#ifdef DI_EN_DBG_OUT
                        if(suppress_log==false)
                        {
                            if((*in_queue)[line_ofs].isForcedBad()!=false)
                            {
                                qInfo()<<"[L2B-007] PCM line is forced to be BAD, skipping";
                            }
                            else if((*in_queue)[line_ofs].isCRCValidIgnoreForced()!=false)
                            {
                                qInfo()<<"[L2B-007] PCM line has good CRC and doesn't need to be fixed";
                            }
                            else if((*in_queue)[line_ofs].frame_number==frasm_f2.frame_number)
                            {
                                qInfo()<<"[L2B-007] PCM line is from the next frame, that line will be re-filled, skipping";
                            }
                            else
                            {
                                qInfo()<<"[L2B-007] PCM line is filler, that should not be fixed";
                            }
                        }
#endif
                    }
                    // Dump PCM line after patching.
                    //qInfo()<<QString::fromStdString((*in_queue)[line_ofs].dumpContentString());
                    //qInfo()<<"-----------------------------------------------";
                }
            }
        }

        // Go to the next line in the buffer.
        buf_ofs++;
    }

#ifdef DI_EN_DBG_OUT
    if(suppress_log==false)
    {
        if(word_patch_cnt>0)
        {
            qInfo()<<"[L2B-007] Words fixed:"<<word_patch_cnt;
        }
        if(line_fix_cnt>0)
        {
            qInfo()<<"[L2B-007] PCM lines fixed:"<<line_fix_cnt;
        }
    }
#endif

    return line_fix_cnt;
}

//------------------------ Perform predictive BROKEN block detection and Cross-Word Decoding.
void STC007DataStitcher::prescanFrame()
{
    bool suppress_log, next_frame_add;
    uint16_t runs, fix_count, fix_per_run;

    next_frame_add = false;
    suppress_log = ((log_level&LOG_FIELD_ASSEMBLY)==0);

    // Detect BROKEN data blocks and trace down false valid PCM lines.
    //patchBrokenLines(&conv_queue);

    if(enable_CWD!=false)
    {
        // Temporary fill a field from the next frame to complete bottom data blocks.
        next_frame_add = fillNextFieldForCWD();
        fix_count = runs = 0;
        do
        {
            // "Repair" some PCM lines using Cross-Word Decoding.
            fix_per_run = performCWD(&conv_queue);
            if(fix_per_run>0) runs++;
            fix_count += fix_per_run;
        }
        while(fix_per_run!=0);
#ifdef DI_EN_DBG_OUT
        if(suppress_log==false)
        {
            if(fix_count>0)
            {
                qInfo()<<"[L2B-007] CWD fixed"<<fix_count<<"lines in"<<runs<<"iterations";
            }
        }
#endif
        if(next_frame_add!=false)
        {
            // Remove temporary lines.
            removeNextFieldAfterCWD();
        }

#ifdef DI_EN_DBG_OUT
        if(suppress_log==false)
        //if(fix_count>0)
        {
            qInfo()<<"[L2B-007] CWD queue:";
            for(uint16_t i=0;i<conv_queue.size();i++)
            {
                qInfo()<<QString::fromStdString(conv_queue[i].dumpContentString());
            }
        }
#endif
    }
}

//------------------------ Set data block sample rate.
void STC007DataStitcher::setBlockSampleRate(STC007DataBlock *in_block)
{
    // Check if sample rate is preset.
    if((preset_sample_rate==PCMSamplePair::SAMPLE_RATE_44100)||(preset_sample_rate==PCMSamplePair::SAMPLE_RATE_44056))
    {
        // Apply preset sample rate.
        in_block->sample_rate = preset_sample_rate;
    }
    else
    {
        // Choose sample rate from video standard.
        if(frasm_f1.video_standard==FrameAsmDescriptor::VID_PAL)
        {
            in_block->sample_rate = PCMSamplePair::SAMPLE_RATE_44100;
        }
        else if(frasm_f1.video_standard==FrameAsmDescriptor::VID_NTSC)
        {
            in_block->sample_rate = PCMSamplePair::SAMPLE_RATE_44056;
        }
        else
        {
            // Video standard is not set, set the default one.
            in_block->sample_rate = PCMSamplePair::SAMPLE_RATE_44100;
        }
    }
}

//------------------------ Output service tag "New file started".
void STC007DataStitcher::outputFileStart()
{
    size_t queue_size;
    if((out_samples==NULL)||(mtx_samples==NULL))
    {
        qWarning()<<DBG_ANCHOR<<"[L2B-007] Empty pointer provided, service tag discarded!";
    }
    else
    {
        PCMSamplePair service_pair;
        service_pair.setServNewFile(file_name);
        while(1)
        {
            // Try to put service tag into the queue.
            mtx_samples->lock();
            queue_size = (out_samples->size()+1);
            if(queue_size<(MAX_SAMPLEPAIR_QUEUE_SIZE-1))
            {
                // Put service pair in the output queue.
                out_samples->push_back(service_pair);
                mtx_samples->unlock();
#ifdef DI_EN_DBG_OUT
                if((log_level&LOG_PROCESS)!=0)
                {
                    qInfo()<<"[L2B-007] Service tag 'NEW FILE' written.";
                }
#endif
                break;
            }
            else
            {
                mtx_samples->unlock();
                QThread::msleep(20);
            }
        }
        file_time.start();
    }
}

