Fagear/SDVPCMdecoder/stc007datastitcher.cpp
//------------------------ Output one sample pair from the data block into output queue.
void STC007DataStitcher::outputSamplePair(STC007DataBlock *in_block, uint8_t idx_left, uint8_t idx_right)
{
    int16_t sample_left, sample_right;
    bool block_state, word_left_state, word_right_state;
    bool word_left_fixed, word_right_fixed;
    PCMSamplePair sample_pair;
    // Set emphasis state of the samples.
    sample_pair.setEmphasis(in_block->hasEmphasis());
    // Set sample rate.
    sample_pair.setSampleRate(in_block->sample_rate);
    if(in_block->isDataBroken()==false)
    {
        // Set validity of the whole block and the samples.
        block_state = in_block->isBlockValid();
        if(block_state==false)
        {
            word_left_fixed = word_right_fixed = false;
        }
        else
        {
            word_left_fixed = in_block->isWordLineCRCOk(idx_left);
            word_right_fixed = in_block->isWordLineCRCOk(idx_right);
        }
        word_left_state = in_block->isWordValid(idx_left);
        word_right_state = in_block->isWordValid(idx_right);
    }
    else
    {
        // Data block deemed to be "BROKEN", no data can be taken as valid.
        block_state = false;
        word_left_state = word_right_state = false;
        word_left_fixed = word_right_fixed = false;
    }
    // Set data to [PCMSamplePair] object.
    sample_left = in_block->getSample(idx_left);
    sample_right = in_block->getSample(idx_right);
    // Copy samples into the [PCMSamplePair] object.
    sample_pair.setSamplePair(sample_left, sample_right,
                              block_state, block_state,
                              word_left_state, word_right_state,
                              word_left_fixed, word_right_fixed);
    // Put sample pair in the output queue.
    // [mtx_samples] should be locked already!
    out_samples->push_back(sample_pair);
}

//------------------------ Output PCM data block into output queue (blocking).
void STC007DataStitcher::outputDataBlock(STC007DataBlock *in_block)
{
    size_t queue_size;
    bool size_lock;
    size_lock = false;
    if((out_samples==NULL)||(mtx_samples==NULL))
    {
        qWarning()<<DBG_ANCHOR<<"[L2B-007] Empty pointer provided, result discarded!";
    }
    else
    {
        while(1)
        {
            // Try to put processed data block into the queue.
            mtx_samples->lock();
            queue_size = (out_samples->size()+1);
            if(queue_size<(MAX_SAMPLEPAIR_QUEUE_SIZE-3))
            {
                // Output L0+R0 samples.
                outputSamplePair(in_block, STC007DataBlock::WORD_L0, STC007DataBlock::WORD_R0);
                // Output L1+R1 samples.
                outputSamplePair(in_block, STC007DataBlock::WORD_L1, STC007DataBlock::WORD_R1);
                // Output L2+R2 samples.
                outputSamplePair(in_block, STC007DataBlock::WORD_L2, STC007DataBlock::WORD_R2);
                mtx_samples->unlock();

                if(size_lock!=false)
                {
                    size_lock = false;
#ifdef DI_EN_DBG_OUT
                    if((log_level&LOG_PROCESS)!=0)
                    {
                        qInfo()<<"[L2B-007] Output PCM data blocks queue has some space, continuing...";
                    }
#endif
                }
                break;
            }
            else
            {
                mtx_samples->unlock();
                if(size_lock==false)
                {
                    size_lock = true;
#ifdef DI_EN_DBG_OUT
                    if((log_level&LOG_PROCESS)!=0)
                    {
                        qInfo()<<"[L2B-007] Output queue is at size limit ("<<(MAX_SAMPLEPAIR_QUEUE_SIZE-3)<<"), waiting...";
                    }
#endif
                }
                QThread::msleep(100);
            }
        }
        // Output data block for visualization.
        emit newBlockProcessed(*in_block);
    }
}

//------------------------ Output service tag "File ended".
void STC007DataStitcher::outputFileStop()
{
    size_t queue_size;
    if((out_samples==NULL)||(mtx_samples==NULL))
    {
        qWarning()<<DBG_ANCHOR<<"[L2B-007] Empty pointer provided, service tag discarded!";
    }
    else
    {
        PCMSamplePair service_pair;
        service_pair.setServEndFile();
        while(1)
        {
            // Try to put service tag into the queue.
            mtx_samples->lock();
            queue_size = (out_samples->size()+1);
            if(queue_size<(MAX_SAMPLEPAIR_QUEUE_SIZE-1))
            {
                // Put service pair in the output queue.
                out_samples->push_back(service_pair);
                mtx_samples->unlock();
#ifdef DI_EN_DBG_OUT
                if((log_level&LOG_PROCESS)!=0)
                {
                    qInfo()<<"[L2B-007] Service tag 'FILE END' written.";
                }
#endif
                break;
            }
            else
            {
                mtx_samples->unlock();
                QThread::msleep(20);
            }
        }
        // Reset file name.
        file_name.clear();
        // Report time that file processing took.
        qDebug()<<"[L2B-007] File processed in"<<file_time.elapsed()<<"msec";
    }
}

//------------------------ Perform deinterleave of a frame in [conv_queue].
void STC007DataStitcher::performDeinterleave()
{
    bool already_unsafe;
    std::deque<STC007Line>::iterator buf_scaner;
    STC007DataBlock pcm_block;

    // Set parameters for converter.
    lines_to_block.setInput(&conv_queue);
    lines_to_block.setOutput(&pcm_block);
    lines_to_block.setIgnoreCRC(ignore_CRC);
    lines_to_block.setForcedErrorCheck(!ignore_CRC);
    lines_to_block.setPCorrection(enable_P_code);
    lines_to_block.setQCorrection(enable_Q_code);
    lines_to_block.setCWDCorrection(enable_CWD);

    // Dump the whole line buffer out (for visualization).
    buf_scaner = conv_queue.begin();
    while(buf_scaner!=conv_queue.end())
    {
        if(((*buf_scaner).frame_number==frasm_f1.frame_number)||((*buf_scaner).frame_number==frasm_f2.frame_number))
        {
            emit newLineProcessed((*buf_scaner));
#ifdef DI_EN_DBG_OUT
            if((log_level&LOG_FIELD_ASSEMBLY)!=0)
            {
                qInfo()<<QString::fromStdString((*buf_scaner).dumpContentString());
            }
#endif
        }
        buf_scaner++;
    }

    // Dump buffered data (one frame) into converter.
    while(conv_queue.size()>STC007DataBlock::MIN_DEINT_DATA)
    {
        // Reset data block structure.
        pcm_block.clear();
        already_unsafe = false;
        // Set parameters for processing.
        lines_to_block.setResMode(getDataBlockResolution(&conv_queue, 0));

        // Fill up data block, performing de-interleaving, convert lines to data blocks.
        lines_to_block.processBlock(0);
        frasm_f1.blocks_total++;
        // TODO: determine emphasis for the data block
        //pcm_block.setEmphasis();
        // Set sample rate for data block.
        setBlockSampleRate(&pcm_block);
        frasm_f1.odd_sample_rate = frasm_f1.even_sample_rate = pcm_block.sample_rate;
        // Set sample format.
        pcm_block.setM2Format(mode_m2);

        // Remove first line from the input queue.
        conv_queue.pop_front();

        // Check if data is not pure silence.
        if(pcm_block.isSilent()==false)
        {
            // Check if invalid seam masking is enabled.
            if(mask_seams!=false)
            {
                // Check for field seams.
                if((frasm_f1.inner_padding_ok==false)&&(frasm_f1.inner_silence==false))
                {
                    // Interframe padding was not detected correctly (and not due to silence).
                    // Need to disable error-correction for in-frame field seam, so errors will get masked (interpolated or muted).
                    if((pcm_block.isOnSeam()!=false)&&
                        (pcm_block.getStartFrame()==frasm_f1.frame_number)&&(pcm_block.getStartFrame()==pcm_block.getStopFrame()))
                    {
                        // Current PCM data block was assembled on in-frame field seam.
                        pcm_block.markAsUnsafe();
                        already_unsafe = true;
#ifdef DI_EN_DBG_OUT
                        if(((log_level&LOG_UNSAFE)!=0)&&((log_level&LOG_FIELD_ASSEMBLY)!=0))
                        {
                            QString log_line;
                            log_line.sprintf("[L2B-007] Invalidating block at [%03u/%03u...%03u/%03u] due to bad interframe seam",
                                     pcm_block.getStartFrame(), pcm_block.getStartLine(), pcm_block.getStopFrame(), pcm_block.getStopLine());
                            qInfo()<<log_line;
                        }
#endif
                    }
                }
                if((frasm_f0.outer_padding_ok==false)&&(frasm_f0.outer_silence==false))
                {
                    // Frame-to-frame padding was not detected correctly (and not due to silence).
                    // Need to disable error-correction for inter-frame field seam, so errors will get masked (interpolated or muted).
                    if((pcm_block.getStartFrame()!=pcm_block.getStopFrame())&&
                        (pcm_block.getStartFrame()==frasm_f0.frame_number)&&(pcm_block.getStopFrame()==frasm_f1.frame_number))
                    {
                        // Current PCM data block was assembled on inter-frame field seam.
                        pcm_block.markAsUnsafe();
                        already_unsafe = true;
#ifdef DI_EN_DBG_OUT
                        if(((log_level&LOG_UNSAFE)!=0)&&((log_level&LOG_FIELD_ASSEMBLY)!=0))
                        {
                            QString log_line;
                            log_line.sprintf("[L2B-007] Invalidating block at [%03u/%03u...%03u/%03u] due to bad frame-to-frame seam",
                                     pcm_block.getStartFrame(), pcm_block.getStartLine(), pcm_block.getStopFrame(), pcm_block.getStopLine());
                            qInfo()<<log_line;
                        }
#endif
                    }
                }
            }

            // Check if data block already marked as unsafe.
            if(already_unsafe==false)
            {
                // Check if broken data blocks masking is enabled.
                if((broken_mask_dur>0)&&(broken_countdown==0))
                {
                    // Check for random "BROKEN" data blocks.
                    if(pcm_block.isDataBroken()!=false)
                    {
                        // If broken data block was found - disable P and Q corrections on next lines
                        // to prevent wrong "corrections" resulting in clicks and pops.
                        // Reset error-correction prohibition timer.
                        broken_countdown = broken_mask_dur;
#ifdef DI_EN_DBG_OUT
                        if((log_level&LOG_UNSAFE)!=0)
                        {
                            QString log_line;
                            log_line.sprintf("[L2B-007] Broken block detected at [%03u/%03u...%03u/%03u], disabling error correction for [%u] next lines",
                                 pcm_block.getStartFrame(), pcm_block.getStartLine(), pcm_block.getStopFrame(), pcm_block.getStopLine(), broken_countdown);
                            qInfo()<<log_line;
                        }
#endif
                    }
                }
                // Check for active countdown from random "BROKEN" block.
                if(broken_countdown!=0)
                {
                    // Mark trailing data blocks as unsafe to use error-correction on after "BROKEN" block.
                    pcm_block.markAsUnsafe();
#ifdef DI_EN_DBG_OUT
                    if((log_level&LOG_UNSAFE)!=0)
                    {
                        QString log_line;
                        log_line.sprintf("[L2B-007] Marking block at [%03u...%03u] as 'unsafe' due to broken block above",
                                 pcm_block.getStartLine(), pcm_block.getStopLine());
                        qInfo()<<log_line;
                    }
#endif
                }
            }
        }

        // Check if stats for the block should be reported.
        if(isBlockNoReport(&pcm_block)==false)
        {
            // Report damages and corrections.
            if(pcm_block.isBlockValid()!=false)
            {
                // Data block is valid.
                if(pcm_block.isDataFixedByP()!=false)
                {
                    // Data is fixed by P-correction.
                    frasm_f1.blocks_fix_p++;
                }
                else if(pcm_block.isDataFixedByQ()!=false)
                {
                    // Data is fixed by Q-correction.
                    frasm_f1.blocks_fix_q++;
                }
                if(pcm_block.isDataFixedByCWD()!=false)
                {
                    // Data block is fixed with help of CWD-correction.
                    frasm_f1.blocks_fix_cwd++;
                }
            }
            else
            {
                // Data block is corrupted.
                frasm_f1.blocks_drop++;
                // Samples in data block are corrupted.
                frasm_f1.samples_drop += pcm_block.getErrorsAudioFixed();
                if(pcm_block.isDataBroken()!=false)
                {
                    // Data is BROKEN.
                    frasm_f1.blocks_broken_field++;
                }
            }
        }

        // Countdown for trailing invalid data blocks after "BROKEN" one.
        if(broken_countdown>0)
        {
            broken_countdown--;
#ifdef DI_EN_DBG_OUT
            if((log_level&LOG_UNSAFE)!=0)
            {
                if(broken_countdown==0)
                {
                    qInfo()<<"[L2B-007] Broken block countdown ended.";
                }
            }
#endif
        }

#ifdef DI_EN_DBG_OUT
        if(((log_level&LOG_BLOCK_DUMP)!=0)
           ||(((log_level&LOG_UNSAFE)!=0)&&(broken_countdown>0)))
        {
            qInfo()<<QString::fromStdString("[L2B-007] "+pcm_block.dumpContentString());
        }
#endif
        // Add compiled data block into output queue.
        outputDataBlock(&pcm_block);
    }
}

//------------------------ Set logging level (using [STC007Deinterleaver] defines).
void STC007DataStitcher::setLogLevel(uint16_t new_log)
{
    log_level = new_log;
}

//------------------------ Preset video standard for stitching.
void STC007DataStitcher::setVideoStandard(uint8_t in_standard)
{
#ifdef DI_EN_DBG_OUT
    if(preset_video_mode!=in_standard)
    {
        if((log_level&LOG_SETTINGS)!=0)
        {
            if(in_standard==FrameAsmDescriptor::VID_NTSC)
            {
                qInfo()<<"[L2B-007] Video standard set to: NTSC.";
            }
            else if(in_standard==FrameAsmDescriptor::VID_PAL)
            {
                qInfo()<<"[L2B-007] Video standard set to: PAL.";
            }
            else if(in_standard==FrameAsmDescriptor::VID_UNKNOWN)
            {
                qInfo()<<"[L2B-007] Automatic video standard detection enabled.";
            }
            else
            {
                qInfo()<<"[L2B-007] Unknown video standard provided, ignored!";
            }
        }
    }
#endif
    if(in_standard<FrameAsmDescriptor::VID_MAX)
    {
        preset_video_mode = in_standard;
    }
}

//------------------------ Preset field order.
void STC007DataStitcher::setFieldOrder(uint8_t in_order)
{
#ifdef DI_EN_DBG_OUT
    if(preset_field_order!=in_order)
    {
        if((log_level&LOG_SETTINGS)!=0)
        {
            if(in_order==FrameAsmDescriptor::ORDER_TFF)
            {
                qInfo()<<"[L2B-007] Field order preset to 'TFF'.";
            }
            else if(in_order==FrameAsmDescriptor::ORDER_BFF)
            {
                qInfo()<<"[L2B-007] Field order preset to 'BFF'.";
            }
            else if(in_order==FrameAsmDescriptor::ORDER_UNK)
            {
                qInfo()<<"[L2B-007] Field order set to 'automatic detection'.";
            }
            else
            {
                qInfo()<<"[L2B-007] Unknown field order provided, ignored!";
            }
        }
    }
#endif
    if(in_order<FrameAsmDescriptor::ORDER_MAX)
    {
        preset_field_order = in_order;
    }
}

//------------------------ Enable/disable P-code error correction.
void STC007DataStitcher::setPCorrection(bool in_set)
{
#ifdef DI_EN_DBG_OUT
    if(enable_P_code!=in_set)
    {
        if((log_level&LOG_SETTINGS)!=0)
        {
            if(in_set==false)
            {
                qInfo()<<"[L2B-007] P-code ECC set to 'disabled'.";
            }
            else
            {
                qInfo()<<"[L2B-007] P-code ECC set to 'enabled'.";
            }
        }
    }
#endif
    enable_P_code = in_set;
}

//------------------------ Enable/disable Q-code error correction.
void STC007DataStitcher::setQCorrection(bool in_set)
{
#ifdef DI_EN_DBG_OUT
    if(enable_Q_code!=in_set)
    {
        if((log_level&LOG_SETTINGS)!=0)
        {
            if(in_set==false)
            {
                qInfo()<<"[L2B-007] Q-code ECC set to 'disabled'.";
            }
            else
            {
                qInfo()<<"[L2B-007] Q-code ECC set to 'enabled'.";
            }
        }
    }
#endif
    enable_Q_code = in_set;
}

//------------------------ Enable/disable CWD error correction.
void STC007DataStitcher::setCWDCorrection(bool in_set)
{
#ifdef DI_EN_DBG_OUT
    if(enable_CWD!=in_set)
    {
        if((log_level&LOG_SETTINGS)!=0)
        {
            if(in_set==false)
            {
                qInfo()<<"[L2B-007] Cross-Word Decoding set to 'disabled'.";
            }
            else
            {
                qInfo()<<"[L2B-007] Cross-Word Decoding set to 'enabled'.";
            }
        }
    }
#endif
    enable_CWD = in_set;
}

//------------------------ Enable/disable M2 sample format (13/16-bits in 14-bit words).
void STC007DataStitcher::setM2SampleFormat(bool in_m2)
{
#ifdef DI_EN_DBG_OUT
    if(mode_m2!=in_m2)
    {
        if((log_level&LOG_SETTINGS)!=0)
        {
            if(in_m2==false)
            {
                qInfo()<<"[L2B-007] M2 sample format set to 'disabled'.";
            }
            else
            {
                qInfo()<<"[L2B-007] M2 sample format set to 'enabled'.";
            }
        }
    }
#endif
    mode_m2 = in_m2;
}

//------------------------ Preset audio resolution.
void STC007DataStitcher::setResolutionPreset(uint8_t in_res)
{
#ifdef DI_EN_DBG_OUT
    if(preset_audio_res!=in_res)
    {
        if((log_level&LOG_SETTINGS)!=0)
        {
            if(in_res==SAMPLE_RES_14BIT)
            {
                qInfo()<<"[L2B-007] Resolution preset to '14-bit'.";
            }
            else if(in_res==SAMPLE_RES_16BIT)
            {
                qInfo()<<"[L2B-007] Resolution preset to '16-bit'.";
            }
            else if(in_res==SAMPLE_RES_UNKNOWN)
            {
                qInfo()<<"[L2B-007] Resolution set to 'automatic detection'.";
            }
            else
            {
                qInfo()<<"[L2B-007] Unknown audio resolution provided, ignored!";
            }
        }
    }
#endif
    if(in_res<SAMPLE_RES_MAX)
    {
        preset_audio_res = in_res;
    }
}

//------------------------ Preset audio sample rate.
void STC007DataStitcher::setSampleRatePreset(uint16_t in_srate)
{
#ifdef DI_EN_DBG_OUT
    if(preset_sample_rate!=in_srate)
    {
        if((log_level&LOG_SETTINGS)!=0)
        {
            if(in_srate==PCMSamplePair::SAMPLE_RATE_44056)
            {
                qInfo()<<"[L2B-007] Sample rate preset to '44056 Hz'.";
            }
            else if(in_srate==PCMSamplePair::SAMPLE_RATE_44100)
            {
                qInfo()<<"[L2B-007] Sample rate preset to '44100 Hz'.";
            }
            else if(in_srate==PCMSamplePair::SAMPLE_RATE_AUTO)
            {
                qInfo()<<"[L2B-007] Sample rate set to 'automatic detection'.";
            }
            else
            {
                qInfo()<<"[L2B-007] Unknown sample rate provided!";
            }
        }
    }
#endif
    preset_sample_rate = in_srate;
}

//------------------------ Set fine settings: maximum unchecked data blocks for a seam in 14-bit mode.
void STC007DataStitcher::setFineMaxUnch14(uint8_t in_set)
{
#ifdef DI_EN_DBG_OUT
    if(max_unchecked_14b_blocks!=in_set)
    {
        if((log_level&LOG_SETTINGS)!=0)
        {
            qInfo()<<"[L2B-007] Maximum unchecked 14-bit data blocks per seam set to:"<<in_set;
        }
    }
#endif
    max_unchecked_14b_blocks = in_set;
    emit guiUpdFineMaxUnch14(max_unchecked_14b_blocks);
}

