Fagear/SDVPCMdecoder/stc007datastitcher.cpp
//------------------------ Set fine settings: maximum unchecked data blocks for a seam in 16-bit mode.
void STC007DataStitcher::setFineMaxUnch16(uint8_t in_set)
{
#ifdef DI_EN_DBG_OUT
    if(max_unchecked_16b_blocks!=in_set)
    {
        if((log_level&LOG_SETTINGS)!=0)
        {
            qInfo()<<"[L2B-007] Maximum unchecked 16-bit data blocks per seam set to:"<<in_set;
        }
    }
#endif
    max_unchecked_16b_blocks = in_set;
    emit guiUpdFineMaxUnch16(max_unchecked_16b_blocks);
}

//------------------------ Set fine settings: usage of ECC on CRC-marked words.
void STC007DataStitcher::setFineUseECC(bool in_set)
{
#ifdef DI_EN_DBG_OUT
    if(ignore_CRC==in_set)
    {
        if((log_level&LOG_SETTINGS)!=0)
        {
            if(in_set==false)
            {
                qInfo()<<"[L2B-007] CRC usage set to 'enabled'.";
            }
            else
            {
                qInfo()<<"[L2B-007] CRC usage set to 'disabled'.";
            }
        }
    }
#endif
    ignore_CRC = !in_set;
    emit guiUpdFineUseECC(!ignore_CRC);
}

//------------------------ Set fine settings: usage of unchecked seams masking.
void STC007DataStitcher::setFineMaskSeams(bool in_set)
{
#ifdef DI_EN_DBG_OUT
    if(mask_seams!=in_set)
    {
        if((log_level&LOG_SETTINGS)!=0)
        {
            if(in_set==false)
            {
                qInfo()<<"[L2B-007] Masking unchecked field seams set to 'disabled'.";
            }
            else
            {
                qInfo()<<"[L2B-007] Masking unchecked field seams set to 'enabled'.";
            }
        }
    }
#endif
    mask_seams = in_set;
    emit guiUpdFineMaskSeams(mask_seams);
}

//------------------------ Set fine settings: number of lines to mask after BROKEN data block.
void STC007DataStitcher::setFineBrokeMask(uint8_t in_set)
{
#ifdef DI_EN_DBG_OUT
    if(broken_mask_dur!=in_set)
    {
        if((log_level&LOG_SETTINGS)!=0)
        {
            qInfo()<<"[L2B-007] ECC-disabled lines count after BROKEN data block set to:"<<in_set;
        }
    }
#endif
    broken_mask_dur = in_set;
    emit guiUpdFineBrokeMask(broken_mask_dur);
}

//------------------------ Set fine settings: allow automatic top-line addition.
void STC007DataStitcher::setFineTopLineFix(bool in_set)
{
#ifdef DI_EN_DBG_OUT
    if(fix_cut_above!=in_set)
    {
        if((log_level&LOG_SETTINGS)!=0)
        {
            if(in_set==false)
            {
                qInfo()<<"[L2B-007] Line insertion from the top of the frames set to 'disabled'.";
            }
            else
            {
                qInfo()<<"[L2B-007] Line insertion from the top of the frames set to 'enabled'.";
            }
        }
    }
#endif
    fix_cut_above = in_set;
    emit guiUpdFineTopLineFix(fix_cut_above);
}

//------------------------ Set fine settings to defaults.
void STC007DataStitcher::setDefaultFineSettings()
{
    setFineMaxUnch14(MAX_BURST_UNCH_14BIT);
    setFineMaxUnch16(MAX_BURST_UNCH_16BIT);
    setFineUseECC(true);
    setFineTopLineFix(false);
    setFineMaskSeams(true);
    setFineBrokeMask(UNCH_MASK_DURATION);
}

//------------------------ Get current fine settings.
void STC007DataStitcher::requestCurrentFineSettings()
{
    emit guiUpdFineMaxUnch14(max_unchecked_14b_blocks);
    emit guiUpdFineMaxUnch16(max_unchecked_16b_blocks);
    emit guiUpdFineUseECC(!ignore_CRC);
    emit guiUpdFineTopLineFix(fix_cut_above);
    emit guiUpdFineMaskSeams(mask_seams);
    emit guiUpdFineBrokeMask(broken_mask_dur);
}

//------------------------ Main processing loop.
void STC007DataStitcher::doFrameReassemble()
{
    uint16_t lines_per_frame;
    quint64 time_spent;
    size_t queue_size;
    STC007Line cur_line;

    broken_countdown = 0;
    frasm_f0.video_standard = frasm_f1.video_standard = frasm_f2.video_standard = FrameAsmDescriptor::VID_UNKNOWN;

#ifdef DI_EN_DBG_OUT
    qInfo()<<"[L2B-007] Launched, STC-007 thread:"<<this->thread()<<"ID"<<QString::number((uint)QThread::currentThreadId());
#endif
    // Check working pointers.
    if((in_lines==NULL)||(mtx_lines==NULL))
    {
        qWarning()<<DBG_ANCHOR<<"[L2B-007] Empty input pointer provided, unable to continue!";
        emit finished();
        return;
    }

    QElapsedTimer time_per_frame;
    // Inf. loop in a thread.
    while(finish_work==false)
    {
        // Process Qt events.
        QApplication::processEvents();

        if(finish_work!=false)
        {
            // Break the loop and do nothing if got shutdown event.
            break;
        }
        // Lock shared access.
        mtx_lines->lock();
        // Get input queue size.
        queue_size = in_lines->size();
        // Check if there is anything in the input queue and there is place for data.
        if(queue_size>0)
        {
            // Wait for sufficient data in the input queue and detect frame numbers.
            if(waitForTwoFrames()!=false)
            {
                // Two full frames are available.
#ifdef DI_EN_DBG_OUT
                if((log_level&LOG_PROCESS)!=0)
                {
                    qInfo()<<"[L2B-007] -------------------- Detected two frames of data, switching to processing...";
                }
#endif
                time_per_frame.start();

                //log_level |= LOG_UNSAFE;

                // Fast fill two frames into internal buffer.
                fillUntilTwoFrames();

                lines_per_frame = 0;

                // Remove lines from Frame A from input queue.
                cur_line = in_lines->front();
                while(1)
                {
                    // Check input queue size.
                    if(in_lines->size()>0)
                    {
                        // Get first line.
                        cur_line = in_lines->front();
                        // Check frame number.
                        if(cur_line.frame_number<=frasm_f1.frame_number)
                        {
                            // Line from Frame A.
                            lines_per_frame++;
                            // Remove line from the input.
                            in_lines->pop_front();
                        }
                        else
                        {
                            // No more lines from Frame A.
                            break;
                        }
                    }
                    else
                    {
                        // No more lines available.
                        break;
                    }
                }
                // Unlock shared access.
                mtx_lines->unlock();

#ifdef DI_EN_DBG_OUT
                if((log_level&LOG_PROCESS)!=0)
                {
                    qInfo()<<"[L2B-007] Removed"<<lines_per_frame<<"lines from input queue from frame"<<frasm_f1.frame_number;
                }
#endif
                // Set deinterleaver logging parameters.
                uint8_t ext_di_log_lvl = 0;
                if((log_level&LOG_SETTINGS)!=0)
                {
                    ext_di_log_lvl |= STC007Deinterleaver::LOG_SETTINGS;
                }
                if((log_level&LOG_DEINTERLEAVE)!=0)
                {
                    ext_di_log_lvl |= STC007Deinterleaver::LOG_PROCESS;
                }
                if((log_level&LOG_ERROR_CORR)!=0)
                {
                    ext_di_log_lvl |= STC007Deinterleaver::LOG_ERROR_CORR;
                }
                lines_to_block.setLogLevel(ext_di_log_lvl);

                // Detect trimming for two frames in the buffer and start/end file marks.
                findFramesTrim();

