Fagear/SDVPCMdecoder/stc007datastitcher.cpp
                if(file_start!=false)
                {
                    // Reset internal state.
                    resetState();
                }

                // Lock shared access.
                mtx_lines->lock();
                // Get input queue size.
                queue_size = in_lines->size();
                // Check if there is anything in the input queue and there is place for data.
                if(queue_size>0)
                {
                    // Check if file ended.
                    if(file_end!=false)
                    {
                        lines_per_frame = 0;
                        cur_line = in_lines->front();
                        // Remove lines from dummy Frame B from input queue.
                        while(cur_line.frame_number==frasm_f2.frame_number)
                        {
                            in_lines->pop_front();
                            lines_per_frame++;
                            if(in_lines->size()==0)
                            {
                                break;
                            }
                        }
#ifdef DI_EN_DBG_OUT
                        if((log_level&LOG_PROCESS)!=0)
                        {
                            qInfo()<<"[L2B-007] Removed"<<lines_per_frame<<"lines from input queue from dummy frame"<<frasm_f2.frame_number;
                        }
#endif
                    }
                }
                // Unlock shared access.
                mtx_lines->unlock();

                // Split frame buffer into 4x field buffers.
                splitFramesToFields();

                //QElapsedTimer dbg_timer;
                //dbg_timer.start();

                // Find a way to stitch fields together.
                findFieldStitching();

                // Inform processing chain about new file.
                if(file_start!=false)
                {
                    outputFileStart();
                }

                // Fill up PCM line queue from internal field buffers.
                fillFrameForOutput();

                // Pre-scan frame buffer, perform false-positive PCM line detection and CWD.
                prescanFrame();

                lines_to_block.setLogLevel(ext_di_log_lvl);
                // Perform deinterleaving on one frame.
                performDeinterleave();

                // Report frame assembling parameters.
                emit guiUpdFrameAsm(frasm_f1);

                // Move trim data from Frame B to Frame A.
                frasm_f0 = frasm_f1;
                frasm_f1 = frasm_f2;
                // Reset flags in Frame B.
                frasm_f2.trim_ok = false;
                frasm_f2.inner_padding_ok = false;
                frasm_f2.outer_padding_ok = false;

                // Report time that frame processing took.
                time_spent = time_per_frame.nsecsElapsed();
                time_spent = time_spent/1000;
                emit loopTime(time_spent);

                // Inform processing chain about end of file.
                if(file_end!=false)
                {
                    // Inform processing chain about end of file.
                    outputFileStop();
                    // Reset internal state.
                    resetState();
                }

                // Reset file start/end flags.
                file_start = file_end = false;
            }
            else
            {
                // Not enough data in the input queue.
                // Unlock shared access.
                mtx_lines->unlock();
                // Wait (~a frame) for input to fill up.
                QThread::msleep(25);
            }
        }
        else
        {
            // Input queue is empty.
            // Unlock shared access.
            mtx_lines->unlock();
            // Wait (~a frame) for input to fill up.
            QThread::msleep(50);
        }
    }
    resetState();
    qInfo()<<"[L2B-007] Loop stop.";
    emit finished();
}

//------------------------ Set the flag to break execution loop and exit.
void STC007DataStitcher::stop()
{
#ifdef DI_EN_DBG_OUT
    qInfo()<<"[L2B-007] Received termination request";
#endif
    finish_work = true;
}
